Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Basic editing ~ |starting.txt| starting Vim, Vim command arguments, initialisation |editing.txt| editing and writing files |motion.txt| commands for moving around |scroll.txt| scrolling the text in the window |insert.txt| Insert and Replace mode |change.txt| deleting and replacing text |indent.txt| automatic indenting for C and other languages |undo.txt| Undo and Redo |repeat.txt| repeating commands, Vim scripts and debugging |visual.txt| using the Visual mode (selecting a text area) |various.txt| various remaining commands |recover.txt| recovering from a crash
es: Edición básica ~ |starting.txt| Iniciar Vim, argumentos de la orden Vim, inicialización |editing.txt| Editar y escribir archivos |motion.txt| Órdenes de desplazamiento |scroll.txt| Desplazar el texto en una ventana |insert.txt| Modos insertar y reemplazar |change.txt| Borrar y reemplazar texto |indent.txt| Tabulación automática para C y otros lenguajes |undo.txt| Deshacer y rehacer |repeat.txt| Repetir órdenes, Vim scripts y depuración de fallos |visual.txt| Usar el modo Visual (seleccionar un área de texto) |various.txt| Otras órdenes restantes |recover.txt| Recuperar datos después de un fallo

source: Advanced editing ~ |cmdline.txt| Command-line editing |options.txt| description of all options |pattern.txt| regexp patterns and search commands |map.txt| key mapping and abbreviations |tagsrch.txt| tags and special searches |quickfix.txt| commands for a quick edit-compile-fix cycle |windows.txt| commands for using multiple windows and buffers |tabpage.txt| commands for using multiple tab pages |syntax.txt| syntax highlighting |spell.txt| spell checking |diff.txt| working with two to four versions of the same file |autocmd.txt| automatically executing commands on an event |filetype.txt| settings done specifically for a type of file |eval.txt| expression evaluation, conditional commands |fold.txt| hide (fold) ranges of lines
es: Edición avanzada ~ |cmdline.txt| Edición en línea de órdenes |options.txt| Descripción de todas las opciones |pattern.txt| Patrones de expresiones regulares y órdenes de búsqueda |map.txt| Macros y abreviaturas |tagsrch.txt| Etiquetas y búsquedas especiales |quickfix.txt| Órdenes para un rápido ciclo editar-compilar-arreglar |windows.txt| Órdenes de uso de múltiples ventanas y búfers |tabpage.txt| Órdenes de uso de múltiples pestañas |syntax.txt| Resaltado de sintaxis |spell.txt| Corrección ortográfica |diff.txt| Trabajar con un número de entre 2 y 4 copias del mismo archivo |autocmd.txt| Ejecutar órdenes de manera automática |filetype.txt| Configuración específica según el tipo de archivo |eval.txt| Evaluación de expresión, órdenes condicionales |fold.txt| Ocultar (plegar) rangos de líneas

source: GUI ~ |gui.txt| Graphical User Interface (GUI) |gui_w16.txt| Windows 3.1 GUI |gui_w32.txt| Win32 GUI |gui_x11.txt| X11 GUI
es: GUI/IGU ~ |gui.txt| Interfaz gráfica de usuario |gui_w16.txt| Interfaz gráfica de usuario de Windows 3.1 |gui_w32.txt| Interfaz gráfica de usuario de Win32 |gui_x11.txt| Interfaz gráfica de usuario de X11

source: Interfaces ~ |if_cscop.txt| using Cscope with Vim |if_lua.txt| Lua interface |if_mzsch.txt| MzScheme interface |if_perl.txt| Perl interface |if_pyth.txt| Python interface |if_sniff.txt| SNiFF+ interface |if_tcl.txt| Tcl interface |if_ole.txt| OLE automation interface for Win32 |if_ruby.txt| Ruby interface |debugger.txt| Interface with a debugger |workshop.txt| Sun Visual Workshop interface |netbeans.txt| NetBeans External Editor interface |sign.txt| debugging signs
es: Interfaces ~ |if_cscop.txt| Usar Cscope con Vim |if_lua.txt| Interfaz Lua |if_mzsch.txt| Interfaz de MzScheme |if_perl.txt| Interfaz de Perl |if_pyth.txt| Interfaz de Python |if_sniff.txt| Interfaz de SNiFF+ |if_tcl.txt| Interfaz de Tcl |if_ole.txt| Interfaz de automatización de OLE para Win32 |if_ruby.txt| Interfaz de Ruby |debugger.txt| Interfaz con un depurador de fallos |workshop.txt| Interfaz de Sun Visual Workshop |netbeans.txt| Interfaz de NetBeans External Editor (editor externo) |sign.txt| Signos de depuración de fallos

source: Versions ~ |vi_diff.txt| Main differences between Vim and Vi |version4.txt| Differences between Vim version 3.0 and 4.x |version5.txt| Differences between Vim version 4.6 and 5.x |version6.txt| Differences between Vim version 5.7 and 6.x |version7.txt| Differences between Vim version 6.4 and 7.x *sys-file-list* Remarks about specific systems ~ |os_390.txt| OS/390 Unix |os_amiga.txt| Amiga |os_beos.txt| BeOS and BeBox |os_dos.txt| MS-DOS and MS-Windows NT/95 common items |os_mac.txt| Macintosh |os_mint.txt| Atari MiNT |os_msdos.txt| MS-DOS (plain DOS and DOS box under Windows) |os_os2.txt| OS/2 |os_qnx.txt| QNX |os_risc.txt| RISC-OS |os_unix.txt| Unix |os_vms.txt| VMS |os_win32.txt| MS-Windows 95/98/NT *standard-plugin-list* Standard plugins ~ |pi_getscript.txt| Downloading latest version of Vim scripts |pi_gzip.txt| Reading and writing compressed files |pi_netrw.txt| Reading and writing files over a network |pi_paren.txt| Highlight matching parens |pi_tar.txt| Tar file explorer |pi_vimball.txt| Create a self-installing Vim script |pi_zip.txt| Zip archive explorer
es: Versiones ~ |vi_diff.txt| Diferencias principales entre Vim y Vi |version4.txt| Diferencias entre las versiones de Vim 3.0 y 4.x |version5.txt| Diferencias entre las versiones de Vim 4.6 y 5.x |version6.txt| Diferencias entre las versiones de Vim 5.7 y 6.x |version7.txt| Diferencias entre las versiones de Vim 6.4 y 7.x *sys-file-list* Apuntes sobre sistemas específicos ~ |os_390.txt| OS/390 Unix |os_amiga.txt| Amiga |os_beos.txt| BeOS and BeBox |os_dos.txt| Elementos comunes entre MS-DOS y MS-Windows NT/95 |os_mac.txt| Macintosh |os_mint.txt| Atari MiNT |os_msdos.txt| MS-DOS - DOS puro y terminal de DOS bajo Windows) |os_os2.txt| OS/2 |os_qnx.txt| QNX |os_risc.txt| RISC-OS |os_unix.txt| Unix |os_vms.txt| VMS |os_win32.txt| MS-Windows 95/98/NT *standard-plugin-list* Extensiones estándar ~ |pi_getscript.txt| Descargar la última versión de Vim scripts |pi_gzip.txt| Leer y escribir archivos comprimidos |pi_netrw.txt| Leer y escribir archivos en una red |pi_paren.txt| Resaltar «parens» coincidentes |pi_tar.txt| Explorador de archivos Tar |pi_vimball.txt|Crear un script de Vim autoinstalable |pi_zip.txt| Explorador de archivos Zip

source: LOCAL ADDITIONS: *local-additions*
es: ADICIONES LOCALES: *local-additions*

source: *bars* Bars example
es: *bars* Ejemplo de barras verticales

source: Note that tags are within | characters, but when highlighting is enabled these characters are hidden.
es: Tenga en cuenta que las etiquetas se encuentran entre caracteres «|», que se ocultarán si activa el resaltado.

source: That makes it easier to read a command.
es: Ello hace más sencillo leer una orden.

source: *usr_toc.txt* For Vim version 7.3.
es: *usr_toc.esx* Para Vim versión 7.3.

source: Table Of Contents *user-manual*
es: Tabla de contenidos *manual-de-usuario* *user-manual*

source: Reference manual |reference_toc| More detailed information for all commands
es: Manual de referencia |reference_toc| Más información detallada de todas las órdenes

source: The user manual is available as a single, ready to print HTML and PDF file here: http://vimdoc.sf.net
es: El manual de usuario está disponible en un único archivo listo para su impresión, en formato PDF y HTML, en está ubicación: http://vimdoc.sf.net

source: |usr_01.txt| About the manuals |01.1| Two manuals |01.2| Vim installed |01.3| Using the Vim tutor |01.4| Copyright
es: |usr_01.esx| Acerca de los manuales |01.1| Dos manuales |01.2| Vim instalado |01.3| Usar el tutor de Vim |01.4| Copyright

source: |usr_02.txt| The first steps in Vim |02.1| Running Vim for the First Time |02.2| Inserting text |02.3| Moving around |02.4| Deleting characters |02.5| Undo and Redo |02.6| Other editing commands |02.7| Getting out |02.8| Finding help
es: |usr_02.esx| Primeros pasos en Vim |02.1| Ejecutar Vim por primera vez |02.2| Insertar texto |02.3| Movimiento |02.4| Eliminar caracteres |02.5| Deshacer y rehacer |02.6| Otras órdenes de edición |02.7| Salir |02.8| Encontrar ayuda

source: |usr_03.txt| Moving around |03.1| Word movement |03.2| Moving to the start or end of a line |03.3| Moving to a character |03.4| Matching a paren |03.5| Moving to a specific line |03.6| Telling where you are |03.7| Scrolling around |03.8| Simple searches |03.9| Simple search patterns |03.10| Using marks
es: |usr_03.esx| Desplazamiento |03.1| Desplazarse sobre palabras |03.2| Desplazarse al principio o al final de la línea |03.3| Desplazarse a un carácter |03.4| Emparejar un paréntesis |03.5| Desplazarse a una línea específica |03.6| Indicar dónde estás |03.7| Desplazar el texto |03.8| Búsquedas simples |03.9| Patrones sencillos de búsqueda |03.10| Uso de marcadores o marcas

source: |usr_04.txt| Making small changes |04.1| Operators and motions |04.2| Changing text |04.3| Repeating a change |04.4| Visual mode |04.5| Moving text |04.6| Copying text |04.7| Using the clipboard |04.8| Text objects |04.9| Replace mode |04.10| Conclusion
es: |usr_04.esx| Making small changes |04.1| Operadores y movimiento |04.2| Cambiar texto |04.3| Repetir un cambio |04.4| Modo Visual |04.5| Mover texto |04.6| Copiar texto |04.7| Uso del portapapeles |04.8| Objetos de texto |04.9| Modo reemplazar |04.10| Conclusión

source: |usr_05.txt| Set your settings |05.1| The vimrc file |05.2| The example vimrc file explained |05.3| Simple mappings |05.4| Adding a plugin |05.5| Adding a help file |05.6| The option window |05.7| Often used options
es: |usr_05.esx| Configuración |05.1| El archivo vimrc |05.2| El archivo vimrc de ejemplo, explicado |05.3| Macros sencillas |05.4| Añadir una extensión |05.5| Añadir un archivo de ayuda |05.6| La ventana de opciones |05.7| Opciones más comunes

source: |usr_06.txt| Using syntax highlighting |06.1| Switching it on |06.2| No or wrong colors?
es: |usr_06.esx| Uso del resaltado de sintaxis |06.1| Activar |06.2| ¿Colores incorrectos o ausentes?

source: |06.3| Different colors |06.4| With colors or without colors |06.5| Printing with colors |06.6| Further reading
es: |06.3| Diferentes colores |06.4| Con colores o sin colores |06.5| Imprimir con colores |06.6| Más información

source: |usr_07.txt| Editing more than one file |07.1| Edit another file |07.2| A list of files |07.3| Jumping from file to file |07.4| Backup files |07.5| Copy text between files |07.6| Viewing a file |07.7| Changing the file name
es: |usr_07.esx| Editar más de un archivo |07.1| Editar otro archivo |07.2| Una lista de archivos |07.3| Pasar de archivo a archivo |07.4| Copias de seguridad |07.5| Copiar texto entre archivos |07.6| Ver un archivo |07.7| Cambiar el nombre de archivo

source: |usr_08.txt| Splitting windows |08.1| Split a window |08.2| Split a window on another file |08.3| Window size |08.4| Vertical splits |08.5| Moving windows |08.6| Commands for all windows |08.7| Viewing differences with vimdiff |08.8| Various
es: |usr_08.esx| Dividir en ventanas |08.1| Dividir una ventana |08.2| Dividir una ventana con otro archivo |08.3| Tamaño de ventana |08.4| Divisiones verticales |08.5| Mover ventanas |08.6| Órdenes sobre todas las ventanas |08.7| Ver las diferencias con «vimdiff» |08.8| Varios

source: |usr_09.txt| Using the GUI |09.1| Parts of the GUI |09.2| Using the mouse |09.3| The clipboard |09.4| Select mode
es: |usr_09.esx| Uso de la interfaz gráfica (GUI) |09.1| Partes de la interfaz gráfica |09.2| Uso del ratón |09.3| El portapapeles |09.4| Modo Seleccionar

source: |usr_10.txt| Making big changes |10.1| Record and playback commands |10.2| Substitution |10.3| Command ranges |10.4| The global command |10.5| Visual block mode |10.6| Reading and writing part of a file |10.7| Formatting text |10.8| Changing case |10.9| Using an external program
es: |usr_10.esx| Realizar cambios grandes |10.1| Órdenes de grabación y reproducción |10.2| Sustitución |10.3| Rangos de aplicación |10.4| Las órdenes globales |10.5| El modo de bloque Visual |10.6| Leer y escribir parte de un archivo |10.7| Formatear texto |10.8| Cambiar mayúsculas y minúsculas |10.9| Uso de un programa externo

source: |usr_11.txt| Recovering from a crash |11.1| Basic recovery |11.2| Where is the swap file?
es: |usr_11.esx| Recuperarse de un fallo |11.1| Recuperación básica |11.2| ¿Dónde está el archivo de recuperación?

source: |usr_12.txt| Clever tricks |12.1| Replace a word |12.2| Change "Last, First" to "First Last" |12.3| Sort a list |12.4| Reverse line order |12.5| Count words |12.6| Find a man page |12.7| Trim blanks |12.8| Find where a word is used
es: |usr_12.esx| Trucos |12.1| Reemplazar una palabra |12.2| Cambiar «Último, Primero» a «Primero Último» |12.3| Ordenar una lista |12.4| Invertir el orden de las líneas |12.5| Contar palabras |12.6| Encontrar una página de manual |12.7| Eliminar espacios en blanco sobrantes |12.8| Buscar dónde se emplea una palabra

source: |usr_20.txt| Typing command-line commands quickly |20.1| Command line editing |20.2| Command line abbreviations |20.3| Command line completion |20.4| Command line history |20.5| Command line window
es: |usr_20.esx| Ser eficaz en la línea de órdenes |20.1| Edición en línea de órdenes |20.2| Abreviaturas en línea de órdenes |20.3| Autocompletado en la línea de órdenes |20.4| Histórico de la línea de órdenes |20.5| Ventana de la línea de órdenes

source: |usr_21.txt| Go away and come back |21.1| Suspend and resume |21.2| Executing shell commands |21.3| Remembering information; viminfo |21.4| Sessions |21.5| Views |21.6| Modelines
es: |usr_21.esx| Abandonar el editor y volver |21.1| Suspender y continuar |21.2| Ejecutar órdenes de consola |21.3| Recordar información; viminfo |21.4| Sesiones |21.5| Vistas |21.6| «Modelines»

source: |usr_22.txt| Finding the file to edit |22.1| The file explorer |22.2| The current directory |22.3| Finding a file |22.4| The buffer list
es: |usr_22.esx| Encontrar el archivo a editar |22.1| El explorador de archivos |22.2| El directorio actual |22.3| Encontrar un archivo |22.4| La lista de búfers

source: |usr_23.txt| Editing other files |23.1| DOS, Mac and Unix files |23.2| Files on the internet |23.3| Encryption |23.4| Binary files |23.5| Compressed files
es: |usr_23.esx| Editar otros archivos |23.1| Archivos de DOS, Mac y Unix |23.2| Archivos en Internet |23.3| Cifrado |23.4| Archivos binarios |23.5| Archivos comprimidos

source: |usr_24.txt| Inserting quickly |24.1| Making corrections |24.2| Showing matches |24.3| Completion |24.4| Repeating an insert |24.5| Copying from another line |24.6| Inserting a register |24.7| Abbreviations |24.8| Entering special characters |24.9| Digraphs |24.10| Normal mode commands
es: |usr_24.esx| Insertar con rapidez |24.1| Corregir | 24.2| Mostrar coincidencias |24.3| Autocompletado |24.4| Repetir una inserción |24.5| Copiar desde otra línea |24.6| Insertar un registro |24.7| Abreviaturas |24.8| Introducir caracteres especiales |24.9| Dígrafos |24.10| Órdenes del modo Normal

source: |usr_25.txt| Editing formatted text |25.1| Breaking lines |25.2| Aligning text |25.3| Indents and tabs |25.4| Dealing with long lines |25.5| Editing tables
es: |usr_25.txt| Editar texto con formato |25.1| Dividir líneas |25.2| Alinear texto |25.3| Sangrado y tabulación |25.4| Tratar líneas largas |25.5| Editar tablas

source: |usr_26.txt| Repeating |26.1| Repeating with Visual mode |26.2| Add and subtract |26.3| Making a change in many files |26.4| Using Vim from a shell script
es: |usr_26.txt| Repetición |26.1| Repetir en modo Visual |26.2| Sumar y restar |26.3| Realizar un cambio en varios archivos |26.4| Usar Vim desde un script de intérprete de órdenes

source: |usr_27.txt| Search commands and patterns |27.1| Ignoring case |27.2| Wrapping around the file end |27.3| Offsets |27.4| Matching multiple times |27.5| Alternatives |27.6| Character ranges |27.7| Character classes |27.8| Matching a line break |27.9| Examples
es: |usr_27.esx| Órdenes y patrones de búsqueda |27.1| Ignorar la distinción entre mayúsculas y minúsculas |27.2| Justificar el fin del archivo |27.3| Dirección relativa («offsets») |27.4| Emparejar varios elementos |27.5| Alternativas |27.6| Rangos de caracteres |27.7| Clases de caracteres |27.8| Coincidir con un salto de línea |27.9| Ejemplos

source: |usr_28.txt| Folding |28.1| What is folding?
es: |usr_28.txt| Plegar |28.1| ¿Qué es plegar?

source: |28.2| Manual folding |28.3| Working with folds |28.4| Saving and restoring folds |28.5| Folding by indent |28.6| Folding with markers |28.7| Folding by syntax |28.8| Folding by expression |28.9| Folding unchanged lines |28.10| Which fold method to use?
es: |28.2| Plegar manualmente |28.3| Trabajar con pliegues |28.4| Guardar y restaurar pliegues |28.5| Plegar por sangrado |28.6| Plegar con marcadores |28.7| Plegar por sintaxis |28.8| Plegar por expresión |28.9| Plegar líneas sin cambios |28.10¿| ¿Qué método de plegar debería usar?

source: |usr_29.txt| Moving through programs |29.1| Using tags |29.2| The preview window |29.3| Moving through a program |29.4| Finding global identifiers |29.5| Finding local identifiers
es: |usr_29.txt| Moverse a través de programas |29.1| Usar etiquetas |29.2| La ventana de previsualización |29.3| Moverse a través de un programa |29.4| Buscar identificadores globales |29.5| Buscar identificadores locales

source: |usr_30.txt| Editing programs |30.1| Compiling |30.2| Indenting C files |30.3| Automatic indenting |30.4| Other indenting |30.5| Tabs and spaces |30.6| Formatting comments
es: |usr_30.txt| Editar programas |30.1| Compilar |30.2| Sangrado en archivos C |30.3| Sangrado automático |30.4| Otros sangrados |30.5| Tabulados y espacios |30.6| Formatear comentarios

source: |usr_31.txt| Exploiting the GUI |31.1| The file browser |31.2| Confirmation |31.3| Menu shortcuts |31.4| Vim window position and size |31.5| Various
es: |usr_31.txt| Sacar partido a la interfaz gráfica |31.1| El explorador de archivos |31.2| Confirmación |31.3| Atajos de teclado para menús |31.4| Posición y tamaño de la ventana de Vim |31.5| Varios

source: |usr_32.txt| The undo tree |32.1| Undo up to a file write |32.2| Numbering changes |32.3| Jumping around the tree |32.4| Time travelling
es: |usr_32.txt| El árbol de deshacer |32.1|Volver a un punto de edición anterior |32.2|Numerar los cambios |32.3|Desplazarse en el árbol |32.4|Viajar en el tiempo

source: |usr_40.txt| Make new commands |40.1| Key mapping |40.2| Defining command-line commands |40.3| Autocommands
es: |usr_40.txt| Crear órdenes nuevas |40.1|Macros de teclado |40.2|Definir órdenes de línea de órdenes |40.3|Órdenes automáticas

source: |usr_41.txt| Write a Vim script |41.1| Introduction |41.2| Variables |41.3| Expressions |41.4| Conditionals |41.5| Executing an expression |41.6| Using functions |41.7| Defining a function |41.8| Lists and Dictionaries |41.9| Exceptions |41.10| Various remarks |41.11| Writing a plugin |41.12| Writing a filetype plugin |41.13| Writing a compiler plugin |41.14| Writing a plugin that loads quickly |41.15| Writing library scripts |41.16| Distributing Vim scripts
es: |usr_41.txt| Escribir scripts para Vim |41.1| Introducción |41.2| Variables |41.3| Expresiones |41.4| Estructuras de decisión |41.5| Ejecución de expresiones |41.6| Funciones |41.7| Definición de funciones |41.8| Listas y Diccionarios |41.9| Excepciones |41.10| Observaciones |41.11| Escribir extensiones |41.12| Escribir extensiones para tipo de archivo |41.13| Escribir extensiones para compiladores |41.14| Escribir extensiones que carguen rápidamente |41.15| Escribir bibliotecas |41.16| Distribuir scripts de Vim

source: *usr_06.txt* For Vim version 7.3.
es: *usr_06.esx* Para Vim version 7.3.

source: Last change: 2009 Oct 28
es: Último cambio: 24/5/2006

source: Using syntax highlighting
es: Uso del resaltado de sintaxis

source: Black and white text is boring.
es: El texto en blanco y negro es aburrido.

source: With colors your file comes to life.
es: Con colores los archivos tienen más vida.

source: This not only looks nice, it also speeds up your work.
es: No sólo adquieren mejor apariencia, si no que acelera la producción.

source: Change the colors used for the different sorts of text.
es: Cambie los colores para distintos tipos de texto.

source: Print your text, with the colors you see on the screen.
es: Imprima sus textos con los colores que ve en pantalla.

source: |06.1| Switching it on |06.2| No or wrong colors?
es: |06.1| Activar |06.2| ¿Colores incorrectos o ausentes?

source: |06.3| Different colors |06.4| With colors or without colors |06.5| Printing with colors |06.6| Further reading
es: |06.3| Diferentes colores |06.4| Con colores o sin colores |06.5| Imprimir con colores |06.6| Más información

source: Next chapter: |usr_07.txt| Editing more than one file Previous chapter: |usr_05.txt| Set your settings Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_07.esx| Editar más de un archivo Capítulo anterior: |usr_05.esx| Configuración Tabla de contenidos: |usr_toc.esx|

source: *06.1* Switching it on
es: *06.1* Activar

source: That should work in most situations to get color in your files.
es: Esto debería funcionar en la mayoría de las situaciones para obtener el coloreado.

source: Vim will automagically detect the type of file and load the right syntax highlighting.
es: Vim detectará automágicamente el tipo de archivo y cargará la sintaxis correspondiente.

source: Suddenly comments are blue, keywords brown and strings red.
es: De repente, los comentarios, las palabras clave y las cadenas se colorean.

source: This makes it easy to overview the file.
es: Esto facilita una vista general del archivo.

source: After a while you will find that black&white text slows you down!
es: ¡Tras usarlo un poco se dará cuenta de lo que le ralentizaba la edición el blanco y negro!

source: *06.2* No or wrong colors?
es: *06.2* ¿Colores incorrectos o ausentes?

source: - Your terminal does not support colors.
es: - Su terminal no soporta colores.

source: Vim will use bold, italic and underlined text, but this doesn't look very nice.
es: Vim usará negrita, itálica y texto subrayado, pero esto no es muy agradable.

source: You probably will want to try to get a terminal with colors.
es: Probablemente quiera probar una terminal con colores.

source: For Unix, I recommend the xterm from the XFree86 project: |xfree-xterm|.
es: Para Unix, se recomienda usar la xterm del proyecto XFree86: |xfree-xterm|.

source: - Your terminal does support colors, but Vim doesn't know this.
es: - Su terminal soporta colores, pero Vim no lo sabe.

source: Make sure your $TERM setting is correct.
es: Asegúrese de que la variable $TERM es correcta.

source: For example, when using an xterm that supports colors: >
es: Por ejemplo, cuando use una xterm que soporte colores: >

source: setenv TERM xterm-color < or (depending on your shell): >
es: setenv TERM xterm-color < o (dependiendo de su consola): >

source: < The terminal name must match the terminal you are using.
es: < El nombre de la terminal debe coincidir con la terminal que esté usando.

source: If it still doesn't work, have a look at |xterm-color|, which shows a few ways to make Vim display colors (not only for an xterm).
es: Si aún así no funciona, consulte |xterm-color|, donde puede ver unas cuantas maneras de hacer que se vean colores.

source: - The file type is not recognized.
es: - El tipo de archivo no es reconocido.

source: Vim doesn't know all file types, and sometimes it's near to impossible to tell what language a file uses.
es: Vim no conoce todos los tipos de archivos, y a veces es casi imposible decir que lenguaje usa un archivo.

source: Try this command: >
es: Pruebe esta orden: >
