Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Let's copy a sentence to the f register (f for First): >
es: Vamos a copiar una frase en el registro f: >

source: The "yas" command yanks a sentence like before.
es: La orden «yas» copia una frase.

source: It's the "f that tells Vim the text should be place in the f register.
es: Es el «"f» el que le dice a Vim que el texto se debe situar en el registro f.

source: This must come just before the yank command.
es: Esto debe aparecer justo antes de la orden copiar.

source: Now yank three whole lines to the l register (l for line): >
es: Ahora copie tres líneas completas en el registro l: >

source: The count could be before the "l just as well.
es: El multiplicador puede situarse también antes del «"l».

source: To yank a block of text to the b (for block) register: >
es: Para copiar un bloque de texto al registro b: >

source: Notice that the register specification "b is just before the "y" command.
es: Observe que la especificación del registro «"b» se encuentra justo antes de la orden «y».

source: This is required.
es: Esto es imprescindible.

source: If you would have put it before the "w" command, it would not have worked.
es: Si lo hubierse puesto antes de la orden «w», no habría funcionado.

source: Now you have three pieces of text in the f, l and b registers.
es: Ahora tiene tres porciones de texto en los registros f, l, y b.

source: Edit another file, move around and place the text where you want it: >
es: Edite otro archivo, desplácese por el texto y allá donde desee: >

source: When you delete text, you can also specify a register.
es: Cuando elimine texto, también puedes especificar un registro.

source: Use this to move several pieces of text around.
es: Use esto para mover varias porciones de texto de un lado para otro.

source: For example, to delete-a-word and write it in the w register: >
es: Por ejemplo, para eliminar una palabra y ponerla en el registro w (delete-a-word): >

source: :write >> logfile
es: :write >> archivo_registro

source: *07.6* Viewing a file
es: *07.6* Ver un archivo

source: Sometimes you only want to see what a file contains, without the intention to ever write it back.
es: A veces sólo quiere ver qué contiene un archivo, sin la intención de guardar ningún cambio.

source: There is the risk that you type ":w" without thinking and overwrite the original file anyway.
es: Existe el riesgo de que escribas «:w» sin pensar y sobreescriba el archivo original.

source: To avoid this, edit the file read-only.
es: Para evitar esto, edite el archivo como sólo lectura.

source: To start Vim in readonly mode, use this command: >
es: Para ejecutar Vim en modo sólo lectura, haga lo siguiente: >

source: vim -R file
es: vim -R archivo

source: view file
es: view archivo

source: You are now editing "file" in read-only mode.
es: Ahora está editando «archivo» en modo sólo lectura.

source: When you try using ":w" you will get an error message and the file won't be written.
es: Cuando pruebe a usar «:w» se dará cuenta de que aparecerá un mensaje de error y no se guardará.

source: When you try to make a change to the file Vim will give you a warning:
es: Cuando intente hacer un cambio al archivo, Vim le dará un aviso:

source: W10: Warning: Changing a readonly file ~
es: W10: Advertencia: cambiando un fichero de solo lectura ~

source: The change will be done though.
es: El cambio se realizará igualmente.

source: This allows for formatting the file, for example, to be able to read it easily.
es: Esto permite formatear el archivo, por ejemplo, para facilitar su lectura.

source: If you make changes to a file and forgot that it was read-only, you can still write it.
es: Si intenta hacer cambios a un archivo y olvidas que era de sólo lectura, aún podrá guardarlo.

source: Add the ! to the write command to force writing.
es: Añada «!» a la orden guardar para forzar la escritura.

source: Now every attempt to change the text will fail.
es: Ahora, cualquier intento de cambiar el texto fallará.

source: The help files are like this, for example.
es: Los archivos de ayuda son así, por ejemplo.

source: If you try to make a change you get this error message:
es: Si intenta cambiar algo, obtendrá el siguiente error:

source: E21: Cannot make changes, 'modifiable' is off ~
es: E21: No se pueden hacer cambios, «modifiable» está desactivado ~

source: *07.7* Changing the file name
es: *07.7* Cambiar el nombre de un archivo

source: A clever way to start editing a new file is by using an existing file that contains most of what you need.
es: Una forma inteligente de comenzar la edición de un archivo nuevo es usar un archivo similar de partida que contenga algo parecido.

source: For example, you start writing a new program to move a file.
es: Por ejemplo, empiece a escribir un programa para filtrar archivos.

source: You know that you already have a program that copies a file, thus you start with: >
es: Sabe que ya tiene un código que copia archivos, así que podría comenzar con él: >

source: :edit copy.c
es: :edit copiar.c

source: You can delete the stuff you don't need.
es: Puede eliminar lo que no necesita.

source: Now you need to save the file under a new name.
es: A continuación tendrá que guardar el archivo bajo un nombre distinto.

source: The ":saveas" command can be used for this: >
es: La orden «:saveas» es adecuado para esto: >

source: :saveas move.c
es: :saveas filtrar.c

source: Vim will write the file under the given name, and edit that file.
es: Vim escribirá el archivo con el nuevo nombre y editará el nuevo archivo.

source: Thus the next time you do ":write", it will write "move.c".
es: Así la próxima vez que haga «:write», escribirá «filtrar.c».

source: "copy.c" remains unmodified.
es: «copiar.c» se mantiene sin modificaciones.

source: When you want to change the name of the file you are editing, but don't want to write the file, you can use this command: >
es: Cuando desee cambiar el nombre del archivo que está editando pero no quiere escribirlo, puede usar el siguiente orden: >

source: Vim will mark the file as "not edited".
es: Vim marcará el archivo como «no editado».

source: This means that Vim knows this is not the file you started editing.
es: Esto significa que Vim sabe que este no es el archivo que comenzó a editar.

source: When you try to write the file, you might get this message:
es: Cuando intente guardar el archivo, puede que vea el siguiente mensaje:

source: E13: File exists (use ! to override) ~
es: E13: El fichero ya existe (use ! para sobreescribir) ~

source: *usr_41.txt* For Vim version 7.3.
es: *usr_41.esx* Para Vim versión 7.3.

source: Write a Vim script
es: Escribir scripts para Vim

source: The Vim script language is used for the startup vimrc file, syntax files, and many other things.
es: El lenguaje de programación de Vim se usa en el archivo de arranque vimrc, los archivos de sintaxis, y muchas otras cosas.

source: This chapter explains the items that can be used in a Vim script.
es: Este capítulo presenta y explica en detalle los elementos que componen un script de Vim.

source: There are a lot of them, thus this is a long chapter.
es: Hay muchos de ellos, por lo que éste es un capítulo largo.

source: |41.1| Introduction |41.2| Variables |41.3| Expressions |41.4| Conditionals |41.5| Executing an expression |41.6| Using functions |41.7| Defining a function |41.8| Lists and Dictionaries |41.9| Exceptions |41.10| Various remarks |41.11| Writing a plugin |41.12| Writing a filetype plugin |41.13| Writing a compiler plugin |41.14| Writing a plugin that loads quickly |41.15| Writing library scripts |41.16| Distributing Vim scripts
es: |41.1| Introducción |41.2| Variables |41.3| Expresiones |41.4| Estructuras de decisión |41.5| Ejecución de expresiones |41.6| Funciones |41.7| Definición de funciones |41.8| Listas y Diccionarios |41.9| Excepciones |41.10| Observaciones |41.11| Escribir extensiones |41.12| Escribir extensiones para tipo de archivo |41.13| Escribir extensiones para compiladores |41.14| Escribir extensiones que carguen rápidamente |41.15| Escribir bibliotecas |41.16| Distribuir scripts de Vim

source: Next chapter: |usr_42.txt| Add new menus Previous chapter: |usr_40.txt| Make new commands Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_42.esx| Añadir menús nuevos Capítulo anterior: |usr_40.esx| Crear órdenes nuevas Tabla de contenidos: |usr_toc.txt|

source: *41.1* Introduction *vim-script-intro* *script*
es: *41.1* Introducción *vim-script-intro* *script*

source: :let i = 1 :while i < 5 : echo "count is" i : let i += 1 :endwhile < Note: The ":" characters are not really needed here.
es: :let i = 1 :while i < 5 : echo "cuenta es" i : let i += 1 :endwhile < Nota: En realidad en el ejemplo de arriba los caracteres «:» no son necesarios.

source: You only need to use them when you type a command.
es: Sólo es necesario su uso al escribir una orden.

source: In a Vim script file they can be left out.
es: En los archivos de script de Vim es posible omitirlos.

source: We will use them here anyway to make clear these are colon commands and make them stand out from Normal mode commands.
es: Aquí se muestran para evidenciar que son órdenes de la línea de órdenes, y no órdenes del modo Normal.

source: Note: You can try out the examples by yanking the lines from the text here and executing them with :@"
es: Nota: Puede probar los ejemplos que se muestran aquí copiando el texto correspondiente, y ejecutándolo con la orden «:@"»

source: count is 1 ~ count is 2 ~ count is 3 ~ count is 4 ~
es: cuenta es 1 ~ cuenta es 2 ~ cuenta es 3 ~ cuenta es 4 ~

source: In the first line the ":let" command assigns a value to a variable.
es: En la primera línea la orden «:let» le asigna un valor a una variable.

source: :let {variable} = {expression}
es: :let {variable} = {expresión}

source: In this case the variable name is "i" and the expression is a simple value, the number one.
es: En este caso el nombre de la variable es «i» y la expresión es simplemente un valor, el número uno.

source: The ":while" command starts a loop.
es: La orden «:while» inicia un ciclo.

source: :while {condition} : {statements} :endwhile
es: :while {condicion} : {instrucciones} :endwhile

source: The statements until the matching ":endwhile" are executed for as long as the condition is true.
es: Las instrucciones hasta el «:endwhile» correspondiente se ejecutan mientras que la {condicion} se siga cumpliendo.

source: The condition used here is the expression "i < 5".
es: La condición aquí es la expresión «i < 5».

source: This is true when the variable i is smaller than five.
es: Ésta es verdadera cuando la variable i es menor a cinco.

source: Note: If you happen to write a while loop that keeps on running, you can interrupt it by pressing CTRL-C (CTRL-Break on MS-Windows).
es: Nota: Si llega a escribir un ciclo «while» que nunca termina de ejecutarse, puede interrumpirlo presionando CTRL-C (o CTRL-Break en MS-Windows).

source: The ":echo" command prints its arguments.
es: La orden «:echo» imprime en pantalla los argumentos que se le introduzcan.

source: In this case the string "count is" and the value of the variable i.
es: En este caso son la cadena «cuenta es» y el valor de la variable i.

source: Since i is one, this will print:
es: Como i vale uno, se imprimirá:

source: count is 1 ~
es: cuenta es 1 ~

source: Then there is the ":let i += 1" command.
es: Luego está la orden «:let i += 1».

source: This does the same thing as ":let i = i + 1".
es: Ésta tiene el mismo efecto que «:let i = i + 1».

source: This adds one to the variable i and assigns the new value to the same variable.
es: Le añade uno a la variable i y asigna el resultado a la misma variable.

source: :for i in range(1, 4) : echo "count is" i :endfor
es: :for i in range(1, 4) : echo "cuenta es" i :endfor

source: We won't explain how |:for| and |range()| work until later.
es: El funcionamiento de |:for| y |range()| se explicará después.

source: Follow the links if you are impatient.
es: Siga los enlaces si no desea esperar.

source: Numbers can be decimal, hexadecimal or octal.
es: Los números pueden ser decimales, hexadecimales, u octales.

source: A hexadecimal number starts with "0x" or "0X".
es: Un número hexadecimal empieza con «0x» o «0X».

source: For example "0x1f" is decimal 31.
es: Por ejemplo, «0x1f» es 31 en decimal.

source: An octal number starts with a zero.
es: Un número octal empieza con cero.

source: "017" is decimal 15.
es: «017» es 15 en decimal.

source: Careful: don't put a zero before a decimal number, it will be interpreted as an octal number!
es: Tenga cuidado: no ponga ceros al comienzo de un número decimal, ¡será interpretado como un octal!

source: The ":echo" command always prints decimal numbers.
es: La orden «:echo» siempre muestra los números como decimales.

source: A number is made negative with a minus sign.
es: Se pueden obtener números negativos añadiéndoles un signo de resta.

source: This also works for hexadecimal and octal numbers.
es: Esto funciona también para números octales y hexadecimales.

source: A minus sign is also used for subtraction.
es: El signo menos también se usa para la substracción.

source: Compare this with the previous example: >
es: Compare lo siguiente con el ejemplo anterior: >

source: White space in an expression is ignored.
es: En las expresiones se ignoran los espacios en blanco.

source: However, it's recommended to use it for separating items, to make the expression easier to read.
es: Sin embargo, es recomendable usarlo para separar elementos, para hacer que las expresiones sean más legibles.

source: For example, to avoid the confusion with a negative number above, put a space between the minus sign and the following number: >
es: Por ejemplo, para evitar confundir el ejemplo anterior con un número negativo, ponga un espacio entre el signo de resta y el número que lo sigue: >

source: A variable name consists of ASCII letters, digits and the underscore.
es: Los nombres de variables pueden consistir de las letras del código ASCII, dígitos, y el guión bajo.

source: It cannot start with a digit.
es: No pueden empezar con dígitos.

source: Valid variable names are:
es: Los siguientes son nombres válidos de variables:

source: counter _aap3 very_long_variable_name_with_underscores FuncLength LENGTH
es: contador _aap3 nombre_de_variable_largo_con_guion_bajo FuncLongitud LONGITUD

source: Invalid names are "foo+bar" and "6var".
es: «foo+bar» y «6var» no son nombres válidos.

source: These variables are global.
es: Estas variables son globales.

source: To see a list of currently defined variables use this command: >
es: Para ver un listado de las variables definidas actualmente, use la siguiente orden: >

source: :let s:count = 1 :while s:count < 5 : source other.vim : let s:count += 1 :endwhile
es: :let s:cuenta = 1 :while s:cuenta < 5 : source otro.vim : let s:cuenta += 1 :endwhile

source: Since "s:count" is local to this script, you can be sure that sourcing the "other.vim" script will not change this variable.
es: Ya que el ámbito de «s:cuenta» es local al script, puede estar seguro de que cargar el archivo «otro.vim» no hará cambios a dicha variable.

source: If "other.vim" also uses an "s:count" variable, it will be a different copy, local to that script.
es: Si «otro.vim» también usa una variable «s:cuenta», será una copia distinta, local al ámbito de ese script.

source: More about script-local variables here: |script-variable|.
es: Puede encontrar más información acerca de las variables locales a un script en |script-variable|.

source: There are more kinds of variables, see |internal-variables|.
es: Existen más clases de variables, consulte |internal-variables|.

source: The most often used ones are:
es: Las que se usan más frecuentemente son:

source: b:name variable local to a buffer w:name variable local to a window g:name global variable (also in a function) v:name variable predefined by Vim
es: b:nombre variable local a un búfer w:nombre variable local a una ventana g:nombre variable global (incluso dentro de funciones) v:nombre variable predeterminada por Vim

source: Variables take up memory and show up in the output of the ":let" command.
es: Las variables que aparecen en el listado que genera la orden «:let» consumen recursos de memoria.

source: To delete a variable use the ":unlet" command.
es: Para eliminar una variable use la orden «:unlet».

source: :unlet s:count
es: :unlet s:cuenta

source: This deletes the script-local variable "s:count" to free up the memory it uses.
es: Esta orden elimina la variable «s:count», local al script actual, para liberar la memoria que ésta usa.

source: If you are not sure if the variable exists, and don't want an error message when it doesn't, append !: >
es: Si no está seguro de que una variable exista, y no quiere obtener mensajes de error si no existe, añada ! a la orden: >

source: :unlet! s:count
es: :unlet! s:cuenta

source: When a script finishes, the local variables used there will not be automatically freed.
es: Cuando la ejecución de un script termina, no se liberan automáticamente los recursos usados por sus variables locales.

source: The next time the script executes, it can still use the old value.
es: La próxima vez que se ejecute el script, los valores antiguos estarán disponibles.

source: :if !exists("s:call_count") : let s:call_count = 0 :endif :let s:call_count = s:call_count + 1 :echo "called" s:call_count "times"
es: :if !exists("s:cuenta_llamadas") : let s:cuenta_llamadas = 0 :endif :let s:cuenta_llamadas = s:cuenta_llamadas + 1 :echo "llamado" s:cuenta_llamadas "veces"

source: The "exists()" function checks if a variable has already been defined.
es: La función «exists()» comprueba la existencia de una variable.

source: Its argument is the name of the variable you want to check.
es: Recibe como argumento el nombre de la variable a comprobar.

source: Not the variable itself!
es: ¡No la variable como tal!

source: If you would do this: >
es: Si intenta esto: >

source: :if !exists(s:call_count)
es: :if !exists(s:cuenta_llamadas)

source: Then the value of s:call_count will be used as the name of the variable that exists() checks.
es: El valor de «s:cuenta_llamadas» se usará como el nombre de variable que exists() revisará.

source: The exclamation mark ! negates a value.
es: El símbolo de exclamación ! niega un valor.

source: When the value was true, it becomes false.
es: Cuando un valor es verdadero, se vuelve falso.

source: When it was false, it becomes true.
es: Cuando es falso, se vuelve verdadero.

source: You can read it as "not".
es: Puede leer este símbolo como «not» (negación lógica).

source: Thus "if !exists()" can be read as "if not exists()".
es: Así, «if !exists()» se lee como «if not exists()».

source: What Vim calls true is anything that is not zero.
es: Vim considera como verdadero cualquier valor distinto de cero.

source: Zero is false.
es: Cero equivale a falso.

source: Note: Vim automatically converts a string to a number when it is looking for a number.
es: Nota: Vim convierte las cadenas de texto a números de manera automática cuando se espera un número.

source: When using a string that doesn't start with a digit the resulting number is zero.
es: Cuando se hace esta conversión con una cadena que no empieza con un dígito el número resultante es cero.

source: Thus look out for this: > :if "true" < The "true" will be interpreted as a zero, thus as false!
es: Debido a esto, tenga cuidado con instrucciones como: > :if "verdadero" < en este caso, la cadena «verdadero» será interpretada como un cero, ¡y por tanto como falso!

source: So far only numbers were used for the variable value.
es: Hasta ahora sólo se han usado números como valores de variables.

source: Strings can be used as well.
es: También es posible usar cadenas de texto.

source: Numbers and strings are the basic types of variables that Vim supports.
es: Los tipos básicos de variables que Vim soporta son números y cadenas.

source: The type is dynamic, it is set each time when assigning a value to the variable with ":let".
es: El tipo de cada variable es dinámico, y se fija cada vez que se asigna un valor a una variable mediante «:let».

source: More about types in |41.8|.
es: Refiérase a |41.8| para más información acerca de tipos.

source: To assign a string value to a variable, you need to use a string constant.
es: Para asignar un valor de tipo cadena a una variable, debe usar una constante de cadena.

source: There are two types of these.
es: Hay dos tipos de estas constantes.

source: First the string in double quotes: >
es: El primero es la cadena con comillas dobles: >

source: :let name = "peter" :echo name < peter ~
es: :let nombre = "pedro" :echo nombre < pedro ~

source: :let name = "\"peter\"" :echo name < "peter" ~
es: :let nombre = "\"pedro\"" :echo nombre < "pedro" ~

source: :let name = '"peter"' :echo name < "peter" ~
es: :let nombre = '"pedro"' :echo nombre < "pedro" ~

source: Inside a single-quote string all the characters are as they are.
es: En una cadena de comillas sencillas todos los caracteres tienen solamente su significado literal.

source: Only the single quote itself is special: you need to use two to get one.
es: Sólo la comilla sencilla es especial: debe usar dos seguidas para obtener una dentro de una cadena.

source: A backslash is taken literally, thus you can't use it to change the meaning of the character after it.
es: La barra inversa se considera literalmente, por lo que no es posible usarla para cambiar el significado del carácter después de ella.

source: In double-quote strings it is possible to use special characters.
es: En las cadenas de comillas dobles es posible usar caracteres especiales.

source: Here are a few useful ones:
es: A continuación algunos de los más usados:

source: \t <Tab> \n <NL>, line break \r <CR>, <Enter> \e <Esc> \b <BS>, backspace \" " \\ \, backslash \<Esc> <Esc> \<C-W> CTRL-W
es: \t <Tab> \n <NL>, salto de línea \r <CR>, <Enter> \e <Esc> \b <BS>, retroceso \" " \\ \, barra inversa \<Esc> <Esc> \<C-W> CTRL-W

source: The last two are just examples.
es: Los últimos dos sólo son ejemplos.

source: The "\<name>" form can be used to include the special key "name".
es: Se puede usar la forma «\<nombre>» para incluir la tecla «nombre».

source: See |expr-quote| for the full list of special items in a string.
es: Consulte |expr-quote| para ver la lista completa de elementos especiales en una cadena de texto.

source: *41.3* Expressions
es: *41.3* Expresiones

source: Vim has a rich, yet simple way to handle expressions.
es: Vim tiene una forma expresiva, pero sencilla, de manejar expresiones.

source: You can read the definition here: |expression-syntax|.
es: Puede leer la definición aquí: |expression-syntax|.

source: Here we will show the most common items.
es: A continuación mostraremos algunos de los elementos más comunes.

source: The numbers, strings and variables mentioned above are expressions by themselves.
es: Los números, cadenas, y las variables mencionadas anteriormente son expresiones por sí mismas.

source: Thus everywhere an expression is expected, you can use a number, string or variable.
es: Así que, en donde sea que se espere una expresión, puede usar un número, una cadena, o una variable.

source: Other basic items in an expression are:
es: Otros de los elementos comunes en una expresión son:

source: $NAME environment variable &name option @r register
es: $NOMBRE variable de entorno &nombre opción @r registro

source: :echo "The value of 'tabstop' is" &ts :echo "Your home directory is" $HOME :if @a > 5
es: :echo "El valor de 'tabstop' es" &ts :echo "Su directorio personal es" $HOME :if @a > 5
