Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The &name form can be used to save an option value, set it to a new value, do something and restore the old value.
es: Puede usar la forma «&nombre» para guardar el valor de una opción, fijarla a un nuevo valor, hacer algo, y restaurar el valor original.

source: :let save_ic = &ic :set noic :/The Start/,$delete :let &ic = save_ic
es: :let ic_orig = &ic :set noic :/El Principio/,$delete :let &ic = ic_orig

source: This makes sure the "The Start" pattern is used with the 'ignorecase' option off.
es: Con esto se asegura que el patrón «El Principio» se buscará con la opción 'ignorecase' desactivada.

source: Still, it keeps the value that the user had set.
es: Sin embargo, se conserva y restaura el valor que el usuario definió para la opción.

source: (Another way to do this would be to add "\C" to the pattern, see |/\C|.)
es: (Otra forma de hacer esta búsqueda es añadir «\C» al patrón, consulte |/\C|.)

source: It becomes more interesting if we combine these basic items.
es: Las cosas se hacen más interesantes si combinamos estos elementos básicos.

source: Let's start with mathematics on numbers:
es: Empecemos con operaciones matemáticas sobre números:

source: a + b add a - b subtract a * b multiply a / b divide a % b modulo
es: a + b adición a - b sustracción a * b multiplicación a / b división a % b módulo (residuo)

source: The usual precedence is used.
es: Se maneja la precendencia de operadores usual.

source: Grouping is done with braces.
es: Puede cambiar la precendencia de las operaciones usando paréntesis.

source: No surprises here.
es: Esto no es nada nuevo.

source: Strings can be concatenated with ".".
es: Puede unir cadenas usando «.».

source: When the ":echo" command gets multiple arguments, it separates them with a space.
es: Cuando recibe varios argumentos, la orden «:echo» los muestra en pantalla separados con espacios.

source: In the example the argument is a single expression, thus no space is inserted.
es: En el ejemplo anterior el argumento es una única expresión, por lo que no se insertan espacios.

source: If "a" evaluates to true "b" is used, otherwise "c" is used.
es: Si «a» se evalúa como verdadero, la expresión corresponderá a «b», y en caso contrario a «c».

source: "i is big" : "i is small" < i is small ~
es: "i es grande" : "i es pequeño" < i es pequeño ~

source: *41.4* Conditionals
es: *41.4* Estructuras de decisión

source: The ":if" commands executes the following statements, until the matching ":endif", only when a condition is met.
es: La orden «:if» ejecuta las órdenes a continuación de ella, hasta el «:endif» correspondiente, cuando se cumple la condición especificada.

source: The generic form is:
es: La forma genérica es:

source: :if {condition} {statements} :endif
es: :if {condicion} {instrucciones} :endif

source: Only when the expression {condition} evaluates to true (non-zero) will the {statements} be executed.
es: Las {instrucciones} se ejecutan únicamente cuando la expresión {condicion} es verdadera, esto es, diferente de cero.

source: These must still be valid commands.
es: Dichas instrucciones deben ser órdenes válidas.

source: If they contain garbage, Vim won't be able to find the ":endif".
es: Si las órdenes tienen errores de sintaxis, Vim no podrá encontrar el «:endif» correspondiente.

source: You can also use ":else".
es: También puede usar «:else».

source: The generic form for this is:
es: La forma genérica es:

source: :if {condition} {statements} :else {statements} :endif
es: :if {condicion} {instrucciones} :else {instrucciones} :endif

source: The second {statements} is only executed if the first one isn't.
es: El segundo grupo de {instrucciones} sólo se ejecuta si el primero no lo hace.

source: Finally, there is ":elseif":
es: Finalmente, está «:elseif»

source: :if {condition} {statements} :elseif {condition} {statements} :endif
es: :if {condicion} {instrucciones} :elseif {condicion} {instrucciones} :endif

source: This works just like using ":else" and then "if", but without the need for an extra ":endif".
es: Esta orden funciona como «:else» seguido de «:if», pero tiene la ventaja de no requerir un «:endif» adicional.

source: A useful example for your vimrc file is checking the 'term' option and doing something depending upon its value: >
es: Un ejemplo útil que podría usar en su archivo vimrc es comprobar la opción 'term' y ejecutar órdenes diferentes de acuerdo a su valor: >

source: :if &term == "xterm" : " Do stuff for xterm :elseif &term == "vt100" : " Do stuff for a vt100 terminal :else : " Do something for other terminals :endif
es: :if &term == "xterm" : " Configuración para xterm :elseif &term == "vt100" : " Configuración para la terminal vt100 :else : " Configuración para otras terminales :endif

source: We already used some of them in the examples.
es: Ya hemos usado algunas de ellas en los ejemplos anteriores.

source: These are the most often used ones:
es: A continuación listamos las más utilizadas:

source: a == b equal to a != b not equal to a > b greater than a >= b greater than or equal to a < b less than a <= b less than or equal to
es: a == b igual a a != b diferente de a > b mayor que a >= b mayor o igual a a < b menor que a <= b menor o igual a

source: The result is one if the condition is met and zero otherwise.
es: El resultado es uno si la condición se cumple, y cero en caso contrario.

source: An example: >
es: Por ejemplo: >

source: :if v:version >= 700 : echo "congratulations" :else : echo "you are using an old version, upgrade!" :endif
es: :if v:version >= 700 : echo "felicitaciones" :else : echo "¡está usando una versión vieja, actualícese!" :endif

source: The logic operators work both for numbers and strings.
es: Los operadores lógicos funcionan con números y con cadenas de texto.

source: When comparing two strings, the mathematical difference is used.
es: Al comparar dos cadenas, se trabaja con la diferencia matemática de las mismas.

source: This compares byte values, which may not be right for some languages.
es: Esto compara valores de bytes, lo que para algunos idiomas puede no entregar resultados correctos.

source: When comparing a string with a number, the string is first converted to a number.
es: Al comparar cadenas con números, la cadena es convertida a un número antes de hacer la comparación.

source: This is a bit tricky, because when a string doesn't look like a number, the number zero is used.
es: Debe tener en cuenta que, cuando el contenido de una cadena no se asemeja a un número, se usa el número cero.

source: :if 0 == "one" : echo "yes" :endif
es: :if 0 == "uno" : echo "sí" :endif

source: a =~ b matches with a !~ b does not match with
es: a =~ b coincide con a !~ b no coincide con

source: The left item "a" is used as a string.
es: El operando de la izquierda, «a», se trata como una cadena.

source: The right item "b" is used as a pattern, like what's used for searching.
es: El operando de la derecha, «b», se trata como un patrón para una búsqueda de texto.

source: :if str =~ " " : echo "str contains a space" :endif :if str !~ '\.$' : echo "str does not end in a full stop" :endif
es: :if str =~ " " : echo "str contiene un espacio" :endif :if str !~ '\.$' : echo "str no termina con punto final" :endif

source: Notice the use of a single-quote string for the pattern.
es: Tenga en cuenta el uso de una cadena de comillas sencillas como patrón de búsqueda.

source: This is useful, because backslashes would need to be doubled in a double-quote string and patterns tend to contain many backslashes.
es: En este caso es útil porque las barras inversas tendrían que insertarse por partida doble en una cadena de comillas dobles, y los patrones de búsqueda suelen contener muchas barras inversas.

source: The 'ignorecase' option is used when comparing strings.
es: Al comparar cadenas se tiene en cuenta la opción 'ignorecase'.

source: When you don't want that, append "#" to match case and "?" to ignore case.
es: Si no desea este comportamiento, añada un «#» para diferenciar mayúsculas de minúsculas, o «?» para ignorar dicha diferencia.

source: Thus "==?" compares two strings to be equal while ignoring case.
es: Así, «==?» compara dos cadenas sin diferenciar mayúsculas de minúsculas.

source: And "!~#" checks if a pattern doesn't match, also checking the case of letters.
es: «!~#» revisa la no coincidencia de un patrón, teniendo en cuenta diferencias de mayúsculas y minúsculas.

source: For the full table see |expr-==|.
es: Puede consultar la tabla completa de operadores de comparación en |expr-==|.

source: The ":while" command was already mentioned.
es: Ya hemos mencionado la orden «:while».

source: Two more statements can be used in between the ":while" and the ":endwhile":
es: Hay dos instrucciones adicionales que pueden usarse entre «:while» y el «:endwhile» correspondiente:

source: :continue Jump back to the start of the while loop; the loop continues.
es: :continue Salta hasta el inicio del ciclo «while»; el ciclo continúa.

source: :break Jump forward to the ":endwhile"; the loop is discontinued.
es: :break Salta hasta después del «:endwhile»; provoca la terminación del ciclo.

source: :while counter < 40 : call do_something() : if skip_flag : continue : endif : if finished_flag : break : endif : sleep 50m :endwhile
es: :while contador < 40 : call hacer_algo() : if opción_omitir : continue : endif : if opción_terminado : break : endif : sleep 50m :endwhile

source: The ":sleep" command makes Vim take a nap.
es: La orden «:sleep» hace que Vim tome una pausa.

source: The "50m" specifies fifty milliseconds.
es: El argumento «50m» especifica una duración de 50 milisegundos.

source: Another example is ":sleep 4", which sleeps for four seconds.
es: Otro ejemplo es «:sleep 4», que especifica una pausa de cuatro segundos.

source: *41.5* Executing an expression
es: *41.5* Ejecución de expresiones

source: So far the commands in the script were executed by Vim directly.
es: Hasta ahora, todas las órdenes mostradas han sido ejecutadas directamente por Vim.

source: The ":execute" command allows executing the result of an expression.
es: La orden «:execute» permite ejecutar el resultado de una expresión.

source: This is a very powerful way to build commands and execute them.
es: Ésta es una forma poderosa de construir y ejecutar órdenes.

source: An example is to jump to a tag, which is contained in a variable: >
es: Un ejemplo es saltar a una etiqueta, cuyo nombre está almacenado en una variable: >

source: :execute "tag " . tag_name
es: :execute "tag " . nombre_etiqueta

source: The "." is used to concatenate the string "tag " with the value of variable "tag_name".
es: El «.» se usa para concatenar la cadena «tag » con el valor de la variable «nombre_etiqueta».

source: Suppose "tag_name" has the value "get_cmd", then the command that will be executed is: >
es: Si suponemos que «nombre_etiqueta» tiene el contenido «obtener_orden», entonces la orden que se ejecutará es: >

source: :tag get_cmd
es: :tag obtener_orden

source: The ":execute" command can only execute colon commands.
es: La orden «:execute» sólo puede ejecutar órdenes de la línea de órdenes (órdenes Ex, que empiezan con «:»).

source: The ":normal" command executes Normal mode commands.
es: La orden «:normal» ejecuta órdenes del modo Normal.

source: However, its argument is not an expression but the literal command characters.
es: Sin embargo, su argumento no es una expresión, sino los caracteres literales de la orden.

source: This jumps to the first line and formats all lines with the "=" operator.
es: Se mueve hasta la primera línea y formatea todas las líneas usando el operador «=».

source: To make ":normal" work with an expression, combine ":execute" with it.
es: Para usar «:normal» con el resultado de una expresión, debe combinar «:execute» con dicha orden.

source: :execute "normal " . normal_commands
es: :execute "normal " . ordenes_modo_normal

source: The variable "normal_commands" must contain the Normal mode commands.
es: La variables «ordenes_modo_normal» debe contener órdenes para el modo Normal.

source: Make sure that the argument for ":normal" is a complete command.
es: Asegúrese de que el argumento para «:normal» es una orden completa.

source: Otherwise Vim will run into the end of the argument and abort the command.
es: En caso contrario, Vim llegará al final del argumento e interrumpirá la orden.

source: For example, if you start Insert mode, you must leave Insert mode as well.
es: Por ejemplo, si inicia el modo Insertar, debe salir del mismo.

source: This works: >
es: Lo siguiente funciona adecuadamente: >

source: :execute "normal Inew text \<Esc>"
es: :execute "normal Itexto nuevo \<Esc>"

source: This inserts "new text " in the current line.
es: Esta orden inserta «texto nuevo» en la línea actual.

source: Notice the use of the special key "\<Esc>".
es: Observe el uso de la tecla especial «\<Esc>».

source: This avoids having to enter a real <Esc> character in your script.
es: Así se evita la necesidad de escribir un <Esc> real en el script.

source: :let optname = "path" :let optval = eval('&' . optname)
es: :let nomopcion = "path" :let valopcion = eval('&' . nomopcion)

source: A "&" character is prepended to "path", thus the argument to eval() is "&path".
es: Se antepone un «&» a «path», y así el argumento para eval() es «&path».

source: The result will then be the value of the 'path' option.
es: El resultado será el valor de la opción 'path'.

source: The same thing can be done with: > :exe 'let optval = &' . optname
es: Puede obtener el mismo resultado con: > :exe 'let optval = &' . optname

source: *41.6* Using functions
es: *24.1* Funciones

source: Vim defines many functions and provides a large amount of functionality that way.
es: Vim define muchas funciones y provee bastante funcionalidad a través de este mecanismo.

source: A few examples will be given in this section.
es: Aquí daremos algunos ejemplos.

source: You can find the whole list here: |functions|.
es: La referencia para la lista completa se encuentra en |functions|.

source: A function is called with the ":call" command.
es: Las funciones se llaman con la orden «:call».

source: The parameters are passed in between braces, separated by commas.
es: Los parámetros se introducen entre paréntesis, separados por comas.

source: :call search("Date: ", "W")
es: :call search("Fecha: ", "W")

source: This calls the search() function, with arguments "Date: " and "W".
es: Se invoca a la función search(), con los argumentos «Fecha: » y «W».

source: The search() function uses its first argument as a search pattern and the second one as flags.
es: La función search() usa su primer argumento como patrón de búsqueda y el segundo como una serie de opciones.

source: The "W" flag means the search doesn't wrap around the end of the file.
es: La opción «W» hace que la búsqueda termine al alcanzar el final del archivo.

source: A function can be called in an expression.
es: También es posible invocar funciones en expresiones.

source: :let line = getline(".") :let repl = substitute(line, '\a', "*", "g") :call setline(".", repl)
es: :let linea = getline(".") :let reempl = substitute(linea, '\a', "*", "g") :call setline(".", reempl)

source: FUNCTIONS *function-list*
es: FUNCIONES *function-list*

source: There are many functions.
es: Vim cuenta con muchas funciones.

source: We will mention them here, grouped by what they are used for.
es: Las mencionaremos aquí, agrupadas de acuerdo a su funcionalidad.

source: You can find an alphabetical list here: |functions|.
es: En |functions| se encuentra una lista de ellas ordenada alfabéticamente.

source: Use CTRL-] on the function name to jump to detailed help on it.
es: Puede ubicar el cursor sobre el nombre de una función y pulsar CTRL-] para ver documentación más detallada sobre ella.

source: String manipulation: *string-functions* nr2char() get a character by its ASCII value char2nr() get ASCII value of a character str2nr() convert a string to a Number str2float() convert a string to a Float printf() format a string according to % items escape() escape characters in a string with a '\' shellescape() escape a string for use with a shell command fnameescape() escape a file name for use with a Vim command tr() translate characters from one set to another strtrans() translate a string to make it printable tolower() turn a string to lowercase toupper() turn a string to uppercase match() position where a pattern matches in a string matchend() position where a pattern match ends in a string matchstr() match of a pattern in a string matchlist() like matchstr() and also return submatches stridx() first index of a short string in a long string strridx() last index of a short string in a long string strlen() length of a string substitute() substitute a pattern match with a string submatch() get a specific match in a ":substitute" strpart() get part of a string expand() expand special keywords iconv() convert text from one encoding to another byteidx() byte index of a character in a string repeat() repeat a string multiple times eval() evaluate a string expression
es: Manipulación de cadenas: *string-functions* nr2char() obtiene un carácter dado su valor ASCII char2nr() obtiene el número ASCII del carácter dado str2nr() convierte una cadena a Número str2float() convierte una cadena a Flotante printf() formatea una cadena de acuerdo a elementos % escape() escapa caracteres en una cadena con '\' shellescape() escapa una cadena para usarse una orden de consola fnameescape() escapa un nombre de archivo para usar en una orden Vim tr() traduce caracteres de un conjunto a otro strtrans() traduce una cadena para que se pueda imprimir tolower() convierte una cadena a minúsculas toupper() convierte una cadena a mayúsculas match() posición en la que un patrón coincide en una cadena matchend() posición en la que un patrón termina en una cadena matchstr() coincidencia de un patrón en una cadena matchlist() similar a matchstr() y retorna subcoincidencias stridx() primer índice de una cadena corta dentro de una larga strridx() último índice de una cadena corta dentro de una larga strlen() longitud de una cadena substitute() sustituye la coincidencia de un patrón con una cadena submatch() obtiene una subcoincidencia específica en un «:substitute» strpart() obtiene parte de una cadena expand() expande palabras clave iconv() convierte texto entre distintas codificaciones byteidx() índice de byte de un carácter en una cadena repeat() repite una cadena múltiples veces eval() evalúa una cadena como expresión

source: List manipulation: *list-functions* get() get an item without error for wrong index len() number of items in a List empty() check if List is empty insert() insert an item somewhere in a List add() append an item to a List extend() append a List to a List remove() remove one or more items from a List copy() make a shallow copy of a List deepcopy() make a full copy of a List filter() remove selected items from a List map() change each List item sort() sort a List reverse() reverse the order of a List split() split a String into a List join() join List items into a String range() return a List with a sequence of numbers string() String representation of a List call() call a function with List as arguments index() index of a value in a List max() maximum value in a List min() minimum value in a List count() count number of times a value appears in a List repeat() repeat a List multiple times
es: Manipulación de Listas: *list-functions* get() obtiene un elemento sin generar error al usar índices erróneos len() número de elementos en una Lista empty() comprueba si una Lista está vacía insert() inserta un elemento en una Lista add() añade un elemento a una Lista extend() añade los contenidos de una Lista a otra Lista remove() elimina uno o más elementos de una lista copy() hace una copia superficial de una Lista deepcopy() hace una copia completa de una Lista filter() elimina elementos particulares de una Lista map() cambia cada elemento de una Lista sort() ordena una Lista reverse() invierte el orden de una Lista split() divide una cadena en una Lista join() une los elementos de una Lista en una cadena range() retorna una Lista con una secuencia de números string() representación de una Lista en una cadena call() invoca una función con una Lista como argumentos index() índice de un valor en una Lista max() valor máximo en una Lista min() valor mínimo en una Lista count() cuenta la cantidad de veces que un valor aparece en una Lista repeat() repite una Lista múltiples veces

source: Dictionary manipulation: *dict-functions* get() get an entry without an error for a wrong key len() number of entries in a Dictionary has_key() check whether a key appears in a Dictionary empty() check if Dictionary is empty remove() remove an entry from a Dictionary extend() add entries from one Dictionary to another filter() remove selected entries from a Dictionary map() change each Dictionary entry keys() get List of Dictionary keys values() get List of Dictionary values items() get List of Dictionary key-value pairs copy() make a shallow copy of a Dictionary deepcopy() make a full copy of a Dictionary string() String representation of a Dictionary max() maximum value in a Dictionary min() minimum value in a Dictionary count() count number of times a value appears
es: Manipulación de Diccionarios: *dict-functions* get() obtiene una entrada sin generar error al usar claves erróneas len() número de entradas en un Diccionario has_key() comprueba si una clave aparece en un Diccionario empty() comprueba si un Diccionario está vacío remove() elimina una entrada de un Diccionario extend() añade las entradas de un Diccionario a otro filter() elimina entradas particulares de un Diccionario map() cambia cada entrada de un Diccionario keys() devuelve una Lista con las claves de un Diccionario values() devuelve una Lista con los valores de un Diccionario items() devuelve una Lista de pares clave-valor de un Diccionario copy() hace una copia superficial de un Diccionario deepcopy() hace una copia completa de un Diccionario string() representación de cadena de un Diccionario max() valor máximo en un Diccionario min() valor mínimo en un Diccionario count() cuenta la cantidad de veces que un valor aparece en un Diccionario

source: Floating point computation: *float-functions* float2nr() convert Float to Number abs() absolute value (also works for Number) round() round off ceil() round up floor() round down trunc() remove value after decimal point log10() logarithm to base 10 pow() value of x to the exponent y sqrt() square root sin() sine cos() cosine atan() arc tangent
es: Operaciones de punto flotante: *float-functions* float2nr() convertir Flotante a Número abs() valor absoluto (también funciona para Números) round() redondear ceil() redondear hacia arriba (techo) floor() redondear hacia abajo (piso) trunc() eliminar valores después del punto decimal log10() logaritmo en base 10 pow() valor de x elevado a la y potencia sqrt() raíz cuadrada sin() seno cos() coseno atan() arcotangente
