Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: When you now type a text like "(example)", as soon as you type the ) Vim will briefly move the cursor to the matching (, keep it there for half a second, and move back to where you were typing.
es: Ahora, cuando teclee un texto como «(ejemplo), tan pronto como teclee el «)» Vim moverá el cursor brevemente al «(» correspondiente, lo mantendrá ahí medio segundo, y volverá a donde estaba tecleando.

source: In case there is no matching (, Vim will beep.
es: En caso de no existir un correspondiente «(», Vim pitará.

source: Then you know that you might have forgotten the ( somewhere, or typed a ) too many.
es: Sabrá entonces que ha olvidado el «(» en algún lugar, o que escribió una «)» demasiadas veces.

source: The match will also be shown for [] and {} pairs.
es: También se mostrará el signo correspondiente en las parejas «[]» «{}».

source: You don't have to wait with typing the next character, as soon as Vim sees it the cursor will move back and inserting continues as before.
es: No tiene que esperar a teclear el siguiente carácter, ya que tan pronto como Vim lo detecte, devolverá el cursor a su posición original, continuando la inserción.

source: You can change the time Vim waits with the 'matchtime' option.
es: Puede modificar el tiempo que Vim espera con la opción 'matchtime'.

source: For example, to make Vim wait one and a half second: >
es: Por ejemplo, para hacer que Vim espere un segundo y medio: >

source: *24.3* Completion
es: *24.3* Autocompletado

source: Vim can automatically complete words on insertion.
es: Vim puede auto-completar palabras durante la inserción.

source: You type the first part of a word, press CTRL-P, and Vim guesses the rest.
es: Escriba primero la parte inicial de una palabra, pulse CTRL-P y Vim adivinará el resto.

source: Suppose, for example, that you are creating a C program and want to type in the following:
es: Suponga, por ejemplo, que está creando un programa en C y que desea teclear lo siguiente:

source: At this point, you tell Vim to complete the word using the command CTRL-P.
es: En este punto es cuando le dice a Vim que complete la palabra usando la orden CTRL-P.

source: Vim searches for a word that starts with what's in front of the cursor.
es: Vim buscará una palabra que empiece con lo que se aparece frente al cursor.

source: In this case, it is "ch_", which matches with the word ch_array.
es: En este caso, es «ch_», el cual encaja con la palabra «ch_array».

source: So typing CTRL-P gives you the following:
es: Por ello, teclear CTRL-P le daría lo siguiente:

source: If you now type CTRL-P Vim will search again for a word that completes the word before the cursor.
es: Si pulsa ahora CTRL-P, Vim buscará otra vez una palabra que complete la que se haya frente al cursor.

source: Since there is nothing in front of the cursor, it finds the first word backwards, which is "ch_array".
es: Ya que no hay nada en frente del cursor, busca la palabra en sentido inverso, el cual es «ch_array».

source: Typing CTRL-P again gives you the next word that matches, in this case "total".
es: Pulsar CTRL-P otra vez le daría la siguiente palabra que encaja, en este caso «total».

source: A third CTRL-P searches further back.
es: Si lo pulsa por tercera vez, Vim buscará aún más atrás.

source: If there is nothing else, it causes the editor to run out of words, so it returns to the original text, which is nothing.
es: Si no hay nada más, al editor se le acabarían las palabras, volviendo al texto original, que es nada.

source: A fourth CTRL-P causes the editor to start over again with "ch_array".
es: Un cuarto CTRL-P causaría al editor empezar otra vez con «ch_array».

source: To search forward, use CTRL-N.
es: Use CTRL-N para una búsqueda hacia delante.

source: Since the search wraps around the end of the file, CTRL-N and CTRL-P will find the same matches, but in a different sequence.
es: Ya que la búsqueda vuelve al inicio cuando llega al final del archivo, CTRL-N y CTRL-P encontrarán las mismas coincidencias, pero en distinto orden.

source: Hint: CTRL-N is Next-match and CTRL-P is Previous-match.
es: Pista: CTRL-N es siguiente coincidencia («Next-match») y CTRL-P es la coincidencia anterior («Previous-match»).

source: The Vim editor goes through a lot of effort to find words to complete.
es: Vim realiza un gran esfuerzo por encontrar palabras que completar.

source: By default, it searches the following places:
es: Por omisión, busca en los siguientes lugares:

source: Current file 2.
es: Archivo actual 2.

source: Files in other windows 3.
es: Archivos en otras ventanas 3.

source: Other loaded files (hidden buffers) 4.
es: Otros archivos cargados (búfers ocultos) 4.

source: Files which are not loaded (inactive buffers) 5.
es: Archivos que no están cargados (búfers inactivos) 5.

source: Tag files 6.
es: Archivos de etiquetas 6.

source: All files #included by the current file
es: Todos los archivos #incluidos en el archivo actual

source: The 'ignorecase' option is used.
es: La opción 'ignorecase' es empleada.

source: When it is set, case differences are ignored when searching for matches.
es: Las diferencias entre mayúsculas y minúsculas se ignorarán al buscar coincidencias de activar esta opción.

source: A special option for completion is 'infercase'.
es: 'infercase' es una opción especial para el autocompletado.

source: This is useful to find matches while ignoring case ('ignorecase' must be set) but still using the case of the word typed so far.
es: Es útil para encontrar parejas cuando ignora la sensibilidad a mayúsculas y minúsculas (debe activar 'ignorecase') , y seguir usando con esta palabra la mencionada sensibilidad.

source: Thus if you type "For" and Vim finds a match "fortunately", it will result in "Fortunately".
es: Por ello, si teclea «Para» y Vim encuentra «paramilitar», el resultado final será «Paramilitar».

source: CTRL-X CTRL-F file names CTRL-X CTRL-L whole lines CTRL-X CTRL-D macro definitions (also in included files) CTRL-X CTRL-I current and included files CTRL-X CTRL-K words from a dictionary CTRL-X CTRL-T words from a thesaurus CTRL-X CTRL-] tags CTRL-X CTRL-V Vim command line
es: CTRL-X CTRL-F Nombres de archivo CTRL-X CTRL-L Líneas completas CTRL-X CTRL-D Definiciones de macros (también en archivos incluidos) CTRL-X CTRL-I Archivo actual e incluidos CTRL-X CTRL-K Palabras de un diccionario CTRL-X CTRL-T Palabras de un tesauro CTRL-X CTRL-] Etiquetas CTRL-X CTRL-V Línea de órdenes de Vim

source: After each of them CTRL-N can be used to find the next match, CTRL-P to find the previous match.
es: Puede usar CTRL-N después de cada uno de estas órdenes para hallar la siguiente coincidencia, y CTRL-P para hallar la anterior.

source: More information for each of these commands here: |ins-completion|.
es: Para más información acerca de estas órdenes, consulte |ins-completion|.

source: Let's take CTRL-X CTRL-F as an example.
es: Tomemos CTRL-X CTRL-F como ejemplo.

source: This will find file names.
es: Esto busca nombres de archivo.

source: It scans the current directory for files and displays each one that matches the word in front of the cursor.
es: Examina el directorio actual en busca de archivos, y muestra cada uno que encaja con la palabra frenet al cursor.

source: Suppose, for example, that you have the following files in the current directory:
es: Suponga, por ejemplo, que tiene las siguientes líneas en el directorio actual:

source: The exit code is in the file sub ~
es: El código de salida está en el archivo sub ~

source: At this point, you enter the command CTRL-X CTRL-F.
es: En este momento, introduzca la orden CTRL-X CTRL-F.

source: Vim now completes the current word "sub" by looking at the files in the current directory.
es: Vim completará la palabra «sub» mirando en los ficheros en el directorio actual.

source: The first match is sub_count.c.
es: La primera coincidencia es «sub_count.c».

source: This is not the one you want, so you match the next file by typing CTRL-N.
es: Esto no es lo que buscaba, así que busca la siguiente pareja pulsando CTRL-N.

source: This match is sub_done.c.
es: La coincidencia es «sub_done.c».

source: Typing CTRL-N again takes you to sub_exit.c.
es: Teclear CTRL-N otra vez le devolvería a «sub_exit.c».

source: The results:
es: El resultado:

source: The exit code is in the file sub_exit.c ~
es: El código de salida está en el archivo sub_exit.c ~

source: If the file name starts with / (Unix) or C:\ (MS-Windows) you can find all files in the file system.
es: Si el nombre de archivo empieza con «/» (Unix) o «C:\» (MS-Windows), puede buscar todos los archivos en el sistema de archivos.

source: For example, type "/u" and CTRL-X CTRL-F.
es: Por ejemplo, teclee «/u» y CTRL-X CTRL-F.

source: This will match "/usr" (this is on Unix):
es: Esto buscará «/usr» (en Unix):

source: the file is found in /usr/ ~
es: El archivo se encuentra en "/usr/" ~

source: If you now press CTRL-N you go back to "/u".
es: Si ahora pulsa CTRL-N volvería a «/u».

source: Instead, to accept the "/usr/" and go one directory level deeper, use CTRL-X CTRL-F again:
es: En lugar de ello, para aceptar «/usr/» y descender un nivel en el árbol de directorios, use otra vez CTRL-X CTRL-F:

source: the file is found in /usr/X11R6/ ~
es: El archivo se encuentra en /usr/X11R6/~

source: The results depend on what is found in your file system, of course.
es: Los resultados varían según lo que se encuentra en su sistema de archivos.

source: The matches are sorted alphabetically.
es: Las coincidencias aparecen alfabéticamente.

source: Source code files are well structured.
es: Los archivos de código están bien estructurados.

source: That makes it possible to do completion in an intelligent way.
es: Esto posibilita un autocompletado inteligente.

source: In Vim this is called Omni completion.
es: En Vim, esto se llama autocompletado global («Omni completion»).

source: In some other editors it's called intellisense, but that is a trademark.
es: Algunos otros editores lo llaman intellisense, pero eso es una marca.

source: The key to Omni completion is CTRL-X CTRL-O.
es: La tecla para el autocompletado global es CTRL-X CTRL-O.

source: Obviously the O stands for Omni here, so that you can remember it easier.
es: Obviamente, la «O» significa «Omni», para recordarla mejor.

source: Let's use an example for editing C source:
es: Usemos un ejemplo para editar código C:

source: The cursor is after "p->".
es: El cursor está después de «p->».

source: Now type CTRL-X CTRL-O.
es: Pulse ahora CTRL-X CTRL-O.

source: Vim will offer you a list of alternatives, which are the items that "struct foo" contains.
es: Vim le ofrecerá una lista de alternativas, los cuales son los elementos que contiene «struct foo».

source: That is quite different from using CTRL-P, which would complete any word, while only members of "struct foo" are valid here.
es: Esto es diferente al uso de CTRL-P, el cual completa cualquier palabra, mientras que aquí sólo son válidos los miembros de «struct foo».

source: For Omni completion to work you may need to do some setup.
es: Necesita realizar alguna configuración para que funcione el autocompletado global.

source: At least make sure filetype plugins are enabled.
es: Asegúrese al menos de que las extensiones de tipo de archivo (filetype) están activadas.

source: Your vimrc file should contain a line like this: > filetype plugin on Or: > filetype plugin indent on
es: El archivo vimrc debería tener esta línea: > filetype plugin on O: > filetype plugin indent on

source: For C code you need to create a tags file and set the 'tags' option.
es: Necesita crear un archivo de etiquetas y definir la opción 'tags' si desea editar código C.

source: That is explained |ft-c-omni|.
es: Consulte |ft-c-omni|.

source: For other filetypes you may need to do something similar, look below |compl-omni-filetypes|.
es: Puede que tenga que realizar algo similar para otros tipos de archivo, consulte más adelante |compl-omni-filetypes|.

source: It only works for specific filetypes.
es: Sólo funciona para ciertos tipos de archivo.

source: Check the value of the 'omnifunc' option to find out if it would work.
es: Revise el valor de la opción 'omnifunc' para ver si funcionaría.

source: *24.4* Repeating an insert
es: *24.4* Repetir una inserción

source: If you press CTRL-A, the editor inserts the text you typed the last time you were in Insert mode.
es: Si pulsa CTRL-A, el editor insertará el texto que tecleó la última que estaba en el modo Insertar.

source: Assume, for example, that you have a file that begins with the following:
es: Suponga, por ejemplo, que tiene un archivo que empieza con lo siguiente:

source: "file.h" ~ /* Main program begins */ ~
es: "file.h" ~ /* El programa principal comienza */ ~

source: #include "file.h" ~ /* Main program begins */ ~
es: #include "file.h" ~ /* El programa principal comienza */ ~

source: You go down to the beginning of the next line using the commands "j^".
es: Puede bajar hasta el inicio de la siguiente línea con las órdenes «j^».

source: You now start to insert a new "#include" line.
es: Ahora puede empezar a insertar una nueva línea «include».

source: So you type: >
es: Asi que escribe: >

source: #include "file.h" ~ #include /* Main program begins */ ~
es: #include "file.h" ~ #include /* El programa principal comienza */ ~

source: The "#include " was inserted because CTRL-A inserts the text of the previous insert.
es: «#include» se insertó porque CTRL-A inserta el texto de la inserción anterior.

source: Now you type "main.h"<Enter> to finish the line:
es: Teclee ahora «main.h» <Enter> para finalizar la línea:

source: #include "file.h" ~ #include "main.h" ~ /* Main program begins */ ~
es: #include "file.h" ~ #include "main.h" ~ /* El programa principal comienza */ ~

source: The CTRL-@ command does a CTRL-A and then exits Insert mode.
es: La orden CTRL-@ realiza un CTRL-A y abandona el modo Insertar.

source: That's a quick way of doing exactly the same insertion again.
es: Esta es una manera rápida de hacer la misma inserción otra vez.

source: *24.5* Copying from another line
es: *24.5* Copiar desde otra línea

source: The CTRL-Y command inserts the character above the cursor.
es: La orden CTRL-Y inserta el carácter sobre el cursor.

source: This is useful when you are duplicating a previous line.
es: Esto es útil si está duplicando una línea anterior.

source: For example, you have this line of C code:
es: Por ejemplo, tiene esta línea de código C:

source: Now you need to type the same line, but with "s_prev" instead of "s_next".
es: Ahora necesita escribir la misma línea, pero con un «s_prev» en lugar de «s_next».

source: Start the new line, and press CTRL-Y 14 times, until you are at the "n" of "next":
es: Inicie una nueva línea, y pulse CTRL-Y 14 veces, hasta encontrarse en la «n» de «next»:

source: *24.6* Inserting a register
es: *24.6* Insertar un registro

source: The command CTRL-R {register} inserts the contents of the register.
es: La orden CTRL-R {registro} inserta el contenido de un registro.

source: This is useful to avoid having to type a long word.
es: Esto es útil para evitar escribir una palabra larga.

source: For example, you need to type this:
es: Por ejemplo, necesita teclear esto:

source: r = VeryLongFunction(a) + VeryLongFunction(b) + VeryLongFunction(c) ~
es: r = FunciónMuyLarga(a) + FunciónMuyLarga(b) + FunciónMuyLarga(c) ~

source: The function name is defined in a different file.
es: El nombre de la función se define en otro archivo.

source: Edit that file and move the cursor on top of the function name there, and yank it into register v: >
es: Edite ese archivo y desplace el cursor sobre el nombre de función presente, y copie el mismo al registro v:

source: "v is the register specification, "yiw" is yank-inner-word.
es: «"v» es el especificador del registro, «yiw» signifia copiar la palabra interior («yank inner word»).

source: Now edit the file where the new line is to be inserted, and type the first letters:
es: Edite ahora el archivo donde se insertará la línea, y escriba las primeras letras:

source: r = VeryLongFunction ~
es: r = FunciónMuyLarga ~

source: You continue to type the characters in between the function name, and use CTRL-R v two times more.
es: Continua insertando caracteres en medio del nombre de la función, y usa «CTRL-R v» dos veces más.

source: You could have done the same with completion.
es: Podría haber realizado lo mismo con el autocompletado.

source: Using a register is useful when there are many words that start with the same characters.
es: Usar un registro es útil cuando hay varias palabras que empiezan con el mismo carácter.

source: If the register contains characters such as <BS> or other special characters, they are interpreted as if they had been typed from the keyboard.
es: Si el registro contiene caracteres tales como <BS> o otros caracteres especiales, se interpretarán como introducidos a través del teclado.

source: If you do not want this to happen (you really want the <BS> to be inserted in the text), use the command CTRL-R CTRL-R {register}.
es: Si no desea que esto ocurra (realmente quiere que <BS> acabe insertado en el texto), use la orden CTRL-R CTRL-R {registro}.

source: *24.7* Abbreviations
es: *24.7* Abreviaturas

source: An abbreviation is a short word that takes the place of a long one.
es: Una abreviatura es una palabra corta que sustituye a otra más larga.

source: For example, "ad" stands for "advertisement".
es: Por ejemplo, «poli» simboliza «policía».

source: Vim enables you to type an abbreviation and then will automatically expand it for you.
es: Vim le permite insertar una abreviatura para después expandirla automáticamente.

source: To tell Vim to expand "ad" into "advertisement" every time you insert it, use the following command: >
es: Para decir a Vim que expanda «poli» a «policía» cada vez que lo inserte, use la siguiente orden: >

source: :iabbrev ad advertisement
es: :iabbrev poli policía

source: Now, when you type "ad", the whole word "advertisement" will be inserted into the text.
es: Ahora, cuando escribe «po», aparecerá la palabra completa «policía» en el texto.

source: This is triggered by typing a character that can't be part of a word, for example a space:
es: Esto se activa cuando teclea un carácter que no puede ser parte de una palabra, como por ejemplo un espacio:

source: What Is Entered What You See I saw the a I saw the a ~ I saw the ad I saw the ad ~ I saw the ad<Space> I saw the advertisement<Space> ~
es: Texto introducido Lo que ve Vi al p Vi al p ~ Vi al po Vi al po ~ Vi al po<Espacio> Vi al policía<Espacio> ~

source: The expansion doesn't happen when typing just "ad".
es: La expansión no ocurre si solo escribe «po».

source: That allows you to type a word like "add", which will not get expanded.
es: Esto permite escribir una palabra como «polifacético», que no se expandirá.

source: Only whole words are checked for abbreviations.
es: Solo se revisan palabras completas con abreviaturas.

source: It is possible to define an abbreviation that results in multiple words.
es: Es posible definir una abreviatura cuyo resultado sean varias palabras.

source: For example, to define "JB" as "Jack Benny", use the following command: >
es: Por ejemplo, para definir «JB» como «Juan Benítez», use la siguiente orden: >

source: :iabbrev JB Jack Benny
es: :iabbrev JB Juan Benítez

source: These are used for creating boxed comments.
es: Uso esto para crear comentarios en cajas.

source: The comment starts with #b, which draws the top line.
es: El comentario empieza con «#b», el cual escribe la línea superior.

source: I then type the comment text and use #e to draw the bottom line.
es: Después escribo el texto del comentario y uso «#e» para dibujar la línea inferior.

source: Notice that the #e abbreviation begins with a space.
es: Observe que la abreviatura «#e» empieza con un espacio.

source: In other words, the first two characters are space-star.
es: En otras palabras, los primeros dos caracteres son espacio-asterisco.

source: Usually Vim ignores spaces between the abbreviation and the expansion.
es: Por lo general, Vim ignora los espacios entre la abreviatura y la expansión.

source: To avoid that problem, I spell space as seven characters: <, S, p, a, c, e, >.
es: Para evitar tal problema, deletreo espacio («space») como siete caracters: <, S, p, a, c, e,>.

source: Note: ":iabbrev" is a long word to type.
es: Nota: La palabra «:iabbrev» es algo larga.

source: ":iab" works just as well.
es: «:iab» también daría resultado.

source: That's abbreviating the abbreviate command!
es: ¡Esto es abreviar la orden de abreviar!

source: It's very common to make the same typing mistake every time.
es: Es bastante normal escribir siempre el mismo error.

source: For example, typing "teh" instead of "the".
es: Por ejemplo, escribir «qeu» en lugar de «que».

source: You can fix this with an abbreviation: >
es: Puede arreglar esto con una abreviatura: >

source: :abbreviate teh the
es: :abbreviate qeu que

source: You can add a whole list of these.
es: Puede crear una lista completa de ejemplos como este.

source: Add one each time you discover a common mistake.
es: Añada uno cada vez que descubra un error común.

source: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Jack Benny i ad advertisement !
es: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Juan Benítez i po policía !

source: teh the
es: qeu que

source: The "i" in the first column indicates Insert mode.
es: La «i» en la primera columna indica modo Insertar.

source: These abbreviations are only active in Insert mode.
es: Estas abreviaturas sólo están activas en el modo Insertar.

source: Other possible characters are:
es: Otros caracteres posibles son:

source: Since abbreviations are not often useful in Command-line mode, you will mostly use the ":iabbrev" command.
es: Debido a que las abreviaturas no son útiles en el modo Línea de órdenes, usará más regularmente la orden «:iabbrev».

source: That avoids, for example, that "ad" gets expanded when typing a command like: >
es: Esto evita, por ejemplo, que se expanda «po» al escribir una orden como: >

source: :edit ad
es: :edit po

source: To get rid of an abbreviation, use the ":unabbreviate" command.
es: Para eliminar una abreviatura, use la orden «:unabbreviate».

source: Suppose you have the following abbreviation: >
es: Suponga que tiene la siguiente abreviatura: >

source: :abbreviate @f fresh
es: :abbreviate @f fresco

source: While you type this, you will notice that @f is expanded to "fresh".
es: Notará al escribir esto que @f se expande a «fresco».

source: Don't worry about this, Vim understands it anyway (except when you have an abbreviation for "fresh", but that's very unlikely).
es: No se preocupe, Vim lo entiende de todas formas (a menos que tenga una abreviatura «fresco», pero eso es improbable).

source: To remove all the abbreviations: >
es: Para eliminar todas las abreviaturas: >

source: There is one thing to watch out for when defining an abbreviation: The resulting string should not be mapped.
es: Existe un aspecto a tener en cuenta a la hora de definir una abreviatura: no debería asignar la cadena resultante a una macro.

source: When you now type @a, you will get "adisk-doorer".
es: Si ahora teclea @a, obtendrá «adisk-doorer».

source: To avoid this, use the ":noreabbrev" command.
es: Para evitarlo, use la orden «:noabbrev».

source: It does the same as ":abbreviate", but avoids that the resulting string is used for mappings: >
es: Hace lo mismo que «:abbreviate», pero evita que la cadena resultante se use en macros.
