Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: When 'wrap' is off and the text has scrolled horizontally, you can use the following commands to move the cursor to a character you can see. Thus text left and right of the window is ignored. These never cause the text to scroll:
es: Cuando ha desplazado el texto horizontalmente y 'wrap' está desactivado, puede usar las siguientes órdenes para mover el cursor a un carácter que puede ver. Por ello, se ignorará el texto a la izquierda y derecha de la ventana. Esto nunca causa un desplazamiento del texto:

source: g0 to first visible character in this line g^ to first non-blank visible character in this line gm to middle of this line g$ to last visible character in this line
es: g0 Desplazarse al primer carácter en esta línea g^ Al primer carácter que no está en blanco de la línea gm Al centro de esta línea g$ Al ultimo carácter visible en esta línea

source: |<-- window -->| some long text, part of which is visible ~ g0 g^ gm g$
es: |<-- ventan -->| algún texto largo, parte del cual visible ~ g0 g^ gm g$

source: BREAKING AT WORDS *edit-no-break*
es: DIVIDIR LÍNEAS EN PALABRAS *edición-sin-partir* *edit-no-break*

source: When preparing text for use by another program, you might have to make paragraphs without a line break. A disadvantage of using 'nowrap' is that you can't see the whole sentence you are working on. When 'wrap' is on, words are broken halfway, which makes them hard to read. A good solution for editing this kind of paragraph is setting the 'linebreak' option. Vim then breaks lines at an appropriate place when displaying the line. The text in the file remains unchanged. Without 'linebreak' text might look like this:
es: Cuando prepara el texto para su uso con otro programa, puede que tenga que crear los párrafos sin salto de línea. Una desventaja de usar 'nowrap' es que no puede ver la oración completa sobre la que trabaja. Si 'wrap' está, activada, las palabras se dividen por la mitad, dificultando la lectura. Una buena solución para editar este tipo de párrafos es definir la opción 'linebreak'. Vim dividirá las líneas en los puntos apropiados al mostrar la línea. El texto en el archivo no se modifica. Sin 'linebreak', el texto presentará este aspecto:

source: +---------------------------------+ |letter generation program for a b| |ank. They wanted to send out a s| |pecial, personalized letter to th| |eir richest 1000 customers. Unfo| |rtunately for the programmer, he | +---------------------------------+ After: >
es: +---------------------------------+ |letter generation program for a b| |ank. They wanted to send out a s| |pecial, personalized letter to th| |eir richest 1000 customers. Unfo| |rtunately for the programmer, he | +---------------------------------+ Después: >

source: Related options: 'breakat' specifies the characters where a break can be inserted. 'showbreak' specifies a string to show at the start of broken line. Set 'textwidth' to zero to avoid a paragraph to be split.
es: Opciones relacionadas: 'breakat' especifica los caracteres donde insertar el salto de línea. 'showbreak' especifica una cadena a mostrar al principio de una línea dividida. Defina 'textwitdh' como cero para evitar dividir un párrafo.

source: The "j" and "k" commands move to the next and previous lines. When used on a long line, this means moving a lot of screen lines at once. To move only one screen line, use the "gj" and "gk" commands. When a line doesn't wrap they do the same as "j" and "k". When the line does wrap, they move to a character displayed one line below or above. You might like to use these mappings, which bind these movement commands to the cursor keys: >
es: Las órdenes «j» y «k» desplazan el cursor. Esto desplaza varias líneas en la pantalla en caso de usarlo sobre una larga línea. Para desplazarse sólo una línea en la pantalla, use las órdenes «gj» y «gk». Estas órdenes hacen lo mismo que «j» y «k» si la línea no está justificada. De activar 'wrap', se desplazan a un carácter visible en una línea inferior o superior. Puede que desee usar estas macros, que relacionan estas órdenes de desplazamiento a las teclas de cursor: >

source: If you want to import text into a program like MS-Word, each paragraph should be a single line. If your paragraphs are currently separated with empty lines, this is how you turn each paragraph into a single line: >
es: Si desea importar texto desde un programa como MS-Word, cada párrafo debería ser una sola línea. De existir una separación entre los párrafos en forma de de líneas vacías, debe realizar lo siguiente para convertir cada párrafo en una sola línea: >

source: That looks complicated. Let's break it up in pieces:
es: Parece complicado. Vamos a dividirlo:

source: :g/./ A ":global" command that finds all lines that contain at least one character. ,/^$/ A range, starting from the current line (the non-empty line) until an empty line. join The ":join" command joins the range of lines together into one line.
es: :g/./ Una orden «:global» que encuentra todas las cadenas que contienen al menos un carácter. ,/^$/ Un rango, que empieza en la línea actual (no vacía), y acaba en una línea vacía. join La orden «:join» (unir) une el rango de líneas en una sola línea.

source: Note that this doesn't work when the separating line is blank but not empty; when it contains spaces and/or tabs. This command does work with blank lines: > :g/\S/,/^\s*$/join
es: Tenga en cuenta que esto no funciona si la línea de separación está en blanco, pero no vacía; cuando contiene espacios y/o tabulados. Esta orden funciona con líneas en blanco: > :g/\S/,/^\s*$/join

source: *25.5* Editing tables
es: *25.5* Editar tablas

source: nice table test 1 test 2 test 3 ~ input A 0.534 ~ input B 0.913 ~
es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 ~ entrada B 0.913 ~

source: You need to enter numbers in the third column. You could move to the second line, use "A", enter a lot of spaces and type the text. For this kind of editing there is a special option: >
es: Necesita introducir números en la tercera columna. Podría desplazarse a la segunda línea, usar «A», introducir espacios y escribir el texto. Existe una orden especial para este tipo de edición: >

source: Now press "j" and you are right where you can enter the value for "input A". Typing "0.693" results in:
es: Pulse ahora «j» y estará dónde puede introducir el valor para «input A». Teclear «0.693» da como resultado:

source: nice table test 1 test 2 test 3 ~ input A 0.534 0.693 ~ input B 0.913 ~
es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 0.693 ~ entrada B 0.913 ~

source: Vim has automatically filled the gap in front of the new text for you. Now, to enter the next field in this column use "Bj". "B" moves back to the start of a white space separated word. Then "j" moves to the place where the next field can be entered.
es: Vim a rellenado automáticamente el espacio en frente del texto. Ahora, para introducir el siguiente campo de esta columna use «Bj». «B» le devuelve al inicio de una palabra separada por un espacio en blanco. «j» le desplaza al lugar dónde puede introducir el siguiente campo.

source: Note: You can move the cursor anywhere in the display, also beyond the end of a line. But Vim will not insert spaces there, until you insert a character in that position.
es: Nota: Puede mover el cursor a cualquier lugar de la pantalla, también más allá del final de línea. Pero Vim no insertará aquí espacios hasta que inserte un carácter en esa posición.

source: You want to add a column, which should be a copy of the third column and placed before the "test 1" column. Do this in seven steps: 1. Move the cursor to the left upper corner of this column, e.g., with "/test 3". 2. Press CTRL-V to start blockwise Visual mode. 3. Move the cursor down two lines with "2j". You are now in "virtual space": the "input B" line of the "test 3" column. 4. Move the cursor right, to include the whole column in the selection, plus the space that you want between the columns. "9l" should do it. 5. Yank the selected rectangle with "y". 6. Move the cursor to "test 1", where the new column must be placed. 7. Press "P".
es: Si desea añadir una columna, que debe ser la copia de la tercera columna y deberá situarse antes de la columna «test 1». Haga estos 7 pasos: 1. Mueva el cursor a la esquina superior izquierda de esta columna, p. ej., con «/test 3». 2. Pulse CTRL-V para empezar el modo de bloque visual. 3. Mueva el cursor dos líneas hacia abajo con «2j». Ahora se encuentra en espacio virtual («virtual space»): la línea «entrada B» de la columna «test 3». 4. Mueva el cursor a la derecha para incluir toda la columna en la selección además del espacio que desea entre las columnas. «9l» hará esto. 5. Copie el rectángulo seleccionado con «y» (yank). 6. Mueva el cursor a «test 1», donde se debería situar la nueva columna. 7. Pulse «P».

source: nice table test 3 test 1 test 2 test 3 ~ input A 0.693 0.534 0.693 ~ input B 0.913 ~
es: Tabla ordenada test 3 test 1 test 2 test 3 ~ entrada A 0.693 0.534 0.693 ~ entrada B 0.913 ~

source: The disadvantage of using 'virtualedit' is that it "feels" different. You can't recognize tabs or spaces beyond the end of line when moving the cursor around. Another method can be used: Virtual Replace mode. Suppose you have a line in a table that contains both tabs and other characters. Use "rx" on the first tab:
es: La desventaja de usar 'virtualedit' es que parece distinto. No puede reconocer tabulados o espacios más allá del final de línea si desplaza el cursor. Puede usar otro método: Modo Virtual de Reemplazar. Suponga que tiene una línea en una tabla que contienen tabulados y otros caracteres. Use «rx» en el primer tabulado:

source: The layout is messed up. To avoid that, use the "gr" command:
es: EL diseño está desordenado. Use la orden «gr» para evitarlo:

source: What happens is that the "gr" command makes sure the new character takes the right amount of screen space. Extra spaces or tabs are inserted to fill the gap. Thus what actually happens is that a tab is replaced by "x" and then blanks added to make the text after it keep its place. In this case a tab is inserted. When you need to replace more than one character, you use the "R" command to go to Replace mode (see |04.9|). This messes up the layout and replaces the wrong characters:
es: Lo que ocurre es que la orden «gr» se asegura que el nuevo carácter tomará la cantidad de espacio de pantalla correcta. Los espacios y tabulados adicionales se insertarán en el hueco. Por ello, lo que realmente ocurre es que el tabulado se reemplaza por «x», y después se añaden espacios en blanco para que el texto a continuación siga en el mismo sitio. En este caso se inserta un tabulado. Cuando necesita reemplazar más de un carácter, use la orden «R» para pasar al modo Reemplazar (consulte |04.9|). Esto desordena la presentación y reemplaza los caracteres erróneos:

source: The "gR" command uses Virtual Replace mode. This preserves the layout:
es: La orden «gR» usa el modo Virtual Reemplazar. Esto respeta el diseño:

source: *usr_09.txt* For Vim version 7.3. Last change: 2006 Apr 24
es: *usr_09.esx* Para Vim versión 7.3. Último cambio: 24/5/2006

source: Using the GUI
es: Uso de la interfaz gráfica (GUI)

source: Vim works in an ordinary terminal. GVim can do the same things and a few more. The GUI offers menus, a toolbar, scrollbars and other items. This chapter is about these extra things that the GUI offers.
es: Vim funciona en una terminal normal. GVim puede hacer las mismas cosas y algunas más. La interfaz gráfica ofrece menús, una barra de menú, barras de desplazamiento y otros. Este capítulo trata de las funcionalidades adicionales que la interfaz gráfica ofrece.

source: |09.1| Parts of the GUI |09.2| Using the mouse |09.3| The clipboard |09.4| Select mode
es: |09.1| Partes de la interfaz gráfica |09.2| Uso del ratón |09.3| El portapapeles |09.4| Modo Seleccionar

source: Next chapter: |usr_10.txt| Making big changes Previous chapter: |usr_08.txt| Splitting windows Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_10.esx| Realizar grandes cambios Capítulo anterior: |usr_08.esx| Dividir en ventanas Tabla de contenidos: |usr_toc.esx|

source: *09.1* Parts of the GUI
es: *09.1* Partes de la interfaz gráfica (GUI)

source: You might have an icon on your desktop that starts gVim. Otherwise, one of these commands should do it: >
es: Puede que tenga un icono en su escritorio que arranca gVim. En caso contrario, una de estas órdenes lo hará: >

source: gvim file.txt vim -g file.txt
es: gvim archivo.txt vim -g archivo.txt

source: If this doesn't work you don't have a version of Vim with GUI support. You will have to install one first. Vim will open a window and display "file.txt" in it. What the window looks like depends on the version of Vim. It should resemble the following picture (for as far as this can be shown in ASCII!).
es: Si esto no funciona es que no tiene la versión de Vim con soporte para GUI. Tendrá que instalar una primero. Vim abrirá una ventana y mostrará «archivo.txt». El aspecto de la ventana dependerá de la versión de Vim. Se debería parecer a la siguiente figura (¡tanto como se pueda parecer con texto ASCII!).

source: The largest space is occupied by the file text. This shows the file in the same way as in a terminal. With some different colors and another font perhaps.
es: El espacio más grande está ocupado por el archivo de texto. Esto muestra el archivo de una manera similar a una terminal. Con algunas diferencias de tipo de letra y color, quizá.

source: - The file cannot be modified (e.g., a help file) + The file contains changes = The file is read-only =+ The file is read-only, contains changes anyway
es: - El archivo no se puede modificar (por ej. la ayuda) + El archivo contiene cambios = El archivo es de sólo lectura =+ El archivo es de sólo lectura pero contiene cambios

source: You know how menus work, right? Vim has the usual items, plus a few more. Browse them to get an idea of what you can use them for. A relevant submenu is Edit/Global Settings. You will find these entries:
es: Ya sabe como funcionan los menús, ¿no? Vim tiene los elementos habituales, además de otros. Explórelos para tener una idea de cómo podría usarlos. Un submenú relevante es «Editar/Opciones globlales». Encontrará los siguientes elementos:

source: This contains icons for the most often used actions. Hopefully the icons are self-explanatory. There are tooltips to get an extra hint (move the mouse pointer to the icon without clicking and don't move it for a second).
es: Este contiene los iconos para las acciones más empleadas. La intención es que los iconos se expliquen a sí mismos. Hay globos de ayuda que le aconsejan (pon el puntero sobre un botón y no lo muevas durante un segundo).

source: The "Edit/Global Settings/Toggle Toolbar" menu item can be used to make the toolbar disappear. If you never want a toolbar, use this command in your vimrc file: >
es: La opción «Editar/Opciones globales/Ocultar/Mostrar barra de herramientas» se puede emplear para hacer que la barra de herramientas desaparezca. Si no desea tener una barra de herramientas en ningún momento, escriba esto en su «vimrc»: >

source: This removes the 'T' flag from the 'guioptions' option. Other parts of the GUI can also be enabled or disabled with this option. See the help for it.
es: Esto elimina la opción 'T' de la opción 'guioptions'. Otras partes de la interfaz gráfica se pueden también activar o desactivar del mismo modo. Consulte la ayuda.

source: By default there is one scrollbar on the right. It does the obvious thing. When you split the window, each window will get its own scrollbar. You can make a horizontal scrollbar appear with the menu item Edit/Global Settings/Toggle Bottom Scrollbar. This is useful in diff mode, or when the 'wrap' option has been reset (more about that later).
es: Por omisión sólo hay una barra de desplazamiento en la derecha. Hace lo que se espera de ella. Cada ventana tendrá su barra de desplazamiento. Puede hacer que una barra horizontal aparezca con la opción «Editar/ Opciones globales/Ocultar/Mostrar barra de desplazamiento inferior». Esto es útil en el modo diff, o cuando la opción 'wrap' está desactivada (eso lo veremos más adelante).

source: When there are vertically split windows, only the windows on the right side will have a scrollbar. However, when you move the cursor to a window on the left, it will be this one the that scrollbar controls. This takes a bit of time to get used to. When you work with vertically split windows, consider adding a scrollbar on the left. This can be done with a menu item, or with the 'guioptions' option: > :set guioptions+=l
es: Cuando hay ventanas divididas verticalmente, sólo las de la derecha tendrán barra de desplazamiento. Sin embargo, si mueve el cursor a una ventana en la izquierda, será esta la que la barra controle. Lleva cierto tiempo acostumbrarse a esto. Cuando trabaje con ventanas divididas verticalmente, considere la posibilidad de añadir barras en la izquierda. Pruebe con esta opción: > :set guioptions+=1

source: *09.2* Using the mouse
es: *09.2* Uso del ratón

source: Standards are wonderful. In Microsoft Windows, you can use the mouse to select text in a standard manner. The X Window system also has a standard system for using the mouse. Unfortunately, these two standards are not the same. Fortunately, you can customize Vim. You can make the behavior of the mouse work like an X Window system mouse or a Microsoft Windows mouse. The following command makes the mouse behave like an X Window mouse: >
es: Los estándares son maravillosos. En Microsoft Windows, puede usar el ratón para seleccionar texto de una forma estándar. El sistema de ventanas X Window System también tiene un estándar para el uso del ratón. Por desgracia, estos dos estándares no son compatibles. Afortunadamente, puede personalizarlo en Vim. Puede hacer que el comportamiento del ratón sea el mismo que bajo X o el de Windows. La siguiente orden hace que el ratón se comporte como bajo X: >

source: The default behavior of the mouse on UNIX systems is xterm. The default behavior on a Microsoft Windows system is selected during the installation process. For details about what the two behaviors are, see |:behave|. Here follows a summary.
es: El comportamiento predeterminado de un ratón en los sistemas UNIX es xterm. El comportamiento predeterminado en un sistema Windows se selecciona durante la instalación. Para más detalles sobre estos comportamientos, consulte |:behave|. Aquí tiene un pequeño resumen:

source: Left mouse click position the cursor Left mouse drag select text in Visual mode Middle mouse click paste text from the clipboard Right mouse click extend the selected text until the mouse pointer
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Visual Click botón central pegar texto desde el portapapeles Click botón derecho extender el texto seleccionado hasta el puntero del ratón

source: Left mouse click position the cursor Left mouse drag select text in Select mode (see |09.4|) Left mouse click, with Shift extend the selected text until the mouse pointer Middle mouse click paste text from the clipboard Right mouse click display a pop-up menu
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Seleccionar (|09.4|) Click botón izquierdo, con May. extender el texto seleccionado hasta el puntero del ratón Click botón central pegar texto desde el portapapeles Click botón derecho mostrar un menú pop-up

source: The mouse can be further tuned. Check out these options if you want to change the way how the mouse works:
es: Puede configurar el ratón con más detalle. Consulte estas opciones si desea cambiar el funcionamiento del ratón:

source: 'mouse' in which mode the mouse is used by Vim 'mousemodel' what effect a mouse click has 'mousetime' time between clicks for a double-click 'mousehide' hide the mouse while typing 'selectmode' whether the mouse starts Visual or Select mode
es: 'mouse' en qué modo Vim usa el ratón 'mousemodel' qué efectos tiene pulsar con el ratón 'mousetime' tiempo entre dos pulsacionespara un doble click 'mousehide' esconde el ratón mientras teclea 'selectmode' si el ratón comienza el modo Visual o Seleccionar

source: *09.3* The clipboard
es: *09.3* El portapapeles

source: In section |04.7| the basic use of the clipboard was explained. There is one essential thing to explain about X-windows: There are actually two places to exchange text between programs. MS-Windows doesn't have this.
es: En la sección |04.7| se explica el uso básico del portapapeles. Hay algo esencial que debe ser explicado sobre las X-windows: Hay dos lugares para intercambiar texto entre programas. MS-Windows sólo tiene uno.

source: In X-Windows there is the "current selection". This is the text that is currently highlighted. In Vim this is the Visual area (this assumes you are using the default option settings). You can paste this selection in another application without any further action. For example, in this text select a few words with the mouse. Vim will switch to Visual mode and highlight the text. Now start another gVim, without a file name argument, so that it displays an empty window. Click the middle mouse button. The selected text will be inserted.
es: En X-Windows hay una «selección actual». Esto es el texto que está actualmente marcado. En Vim esto es el área Visual (suponiendo que usa las opciones predeterminadas). Puede pegar esta selección en otra aplicación sin ninguna acción posterior. Por ejemplo, en este texto seleccione unas cuantas palabras con el ratón. Vim pasará al modo Visual y resaltará el texto. Ahora inicie otro gVim, sin un nombre de archivo, de forma que muestre una ventana vacía. Pulse el botón central del ratón. El texto seleccionado se insertará.

source: The "current selection" will only remain valid until some other text is selected. After doing the paste in the other gVim, now select some characters in that window. You will notice that the words that were previously selected in the other gVim window are displayed differently. This means that it no longer is the current selection.
es: La «selección actual» sólo será válida hasta que seleccione otro texto. Tras pegar el texto en otro gVim, seleccione ahora algunos caracteres en esa ventana. Se dará cuenta de que las palabras que estaban previamente seleccionadas en otra ventana gVim se muestran de otro modo. Esto significa que ya no están en la «selección actual».

source: This use of both the "current selection" and the "real clipboard" might sound a bit confusing. But it is very useful. Let's show this with an example. Use one gVim with a text file and perform these actions:
es: Esto de usar simultáneamente la «selección actual» y el «verdadero portapapeles» puede sonar un poco confuso. Pero es muy útil. Veámoslo con un ejemplo. Abra un gVim con un archivo de texto y haga lo siguiente:

source: If you don't like using the mouse, you can access the current selection and the real clipboard with two registers. The "* register is for the current selection. To make text become the current selection, use Visual mode. For example, to select a whole line just press "V". To insert the current selection before the cursor: >
es: Si no le gusta usar el ratón, puede acceder a la selección actual y al verdadero portapapeles con dos registros. El registro "* es para la selección actual. Para hacer que el texto se convierta en selección actual, use el modo Visual. Por ejemplo, para seleccionar una línea completa use «V». Para insertar la selección actual antes del cursor: >
