Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The first time user commands and mappings are defined that offer the functionality.
es: La primera vez, se definen las órdenes de usuario y macros que ofrecen la funcionalidad de la extensión.

source: The second time the functions that implement the functionality are defined.
es: La segunda vez, se definen las funciones que implementan tales funcionalidades.

source: It may sound surprising that quickload means loading a script twice.
es: Puede que sorprenda que «carga rápida» signifique cargar una extensión dos veces.

source: What we mean is that it loads quickly the first time, postponing the bulk of the script to the second time, which only happens when you actually use it.
es: Lo que queremos decir es que se carga rápidamente la primera, demorando la carga de la mayoría de la extensión a la segunda vez, lo que sólo ocurre cuando realmente la usa.

source: When you always use the functionality it actually gets slower!
es: ¡Si usa siempre la funcionalidad que provee la extensión, no obtendrá ninguna ventaja!

source: " Vim global plugin for demonstrating quick loading " Last Change: 2005 Feb 25 " Maintainer: Bram Moolenaar <Bram@vim.org> " License: This file is placed in the public domain.
es: " Extensión global de Vim para mostrar la carga rápida " Último cambio: 2005 Feb 25 " Desarrollador: Bram Moolenaar <Bram@vim.org> " Licencia: Este archivo se encuentra en el dominio público

source: if !exists("s:did_load") command -nargs=* BNRead call BufNetRead(<f-args>) map <F19> :call BufNetWrite('something')<CR>
es: if !exists("s:did_load") command -nargs=* BNRead call BufNetRead(<f-args>) map <F19> :call BufNetWrite('algo')<CR>

source: ')' " read functionality here endfunction
es: ')' " Funcionalidad de lectura aquí endfunction

source: ')' " write functionality here endfunction
es: ')' " Funcionalidad de escritura aquí endfunction

source: The second time the script is loaded "s:did_load" exists and the commands after the "endif" are executed.
es: La segunda vez que se carga, «s:did_load» existe y se ejecutan las órdenes después de «endif».

source: This defines the (possible long) BufNetRead() and BufNetWrite() functions.
es: Esto define las (posiblemente largas) funciones BufNetRead() y BufNetWrite().

source: If you drop this script in your plugin directory Vim will execute it on startup.
es: Si ubica este script en su directorio «plugin», Vim lo ejecutará al inicio.

source: This is the sequence of events that happens:
es: A continuación la secuencia de los eventos:

source: The "BNRead" command is defined and the <F19> key is mapped when the script is sourced at startup.
es: Se define la orden «BNRead» y la tecla <F19> se asigna a una macro al cargar el script al inicio.

source: A |FuncUndefined| autocommand is defined.
es: Se define una orden automática |FuncUndefined|.

source: The ":finish" command causes the script to terminate early.
es: La orden «:finish» hace que el script finalice antes.

source: The user types the BNRead command or presses the <F19> key.
es: El usuario introduce la orden «BNRead» o pulsa la tecla <F19>.

source: The BufNetRead() or BufNetWrite() function will be called.
es: Se invoca la función «BufNetRead()» o «BufNetWrite()».

source: Vim can't find the function and triggers the |FuncUndefined| autocommand event.
es: Vim no puede encontrar la función y ejecuta la orden automática |FuncUndefined|.

source: Since the pattern "BufNet*" matches the invoked function, the command "source fname" will be executed.
es: Ya que el patrón «BufNet*» coincide con la función invocada, se ejecutará la orden «source nombre-archivo».

source: "fname" will be equal to the name of the script, no matter where it is located, because it comes from expanding "<sfile>" (see |expand()|).
es: «nombre-archivo» debe ser igual al nombre del script, sin importar su ubicación, ya que procede de expandir «<sfile>» (consulte |expand()|).

source: The script is sourced again, the "s:did_load" variable exists and the functions are defined.
es: El script se carga otra vez, la variable «s:did_load» existe, y se definen las funciones.

source: Notice that the functions that are loaded afterwards match the pattern in the |FuncUndefined| autocommand.
es: Tenga en cuenta que las funciones se cargan después de comparar el patrón en la orden automática |FuncUndefined|.

source: You must make sure that no other plugin defines functions that match this pattern.
es: Debe comprobar que ninguna otra extensión define funciones que coincidan con este patrón.

source: *41.15* Writing library scripts *write-library-script*
es: *41.15* Crear bibliotecas *write-library-script*

source: Some functionality will be required in several places.
es: Algunas funcionalidades son necesarias en varios lugares.

source: When this becomes more than a few lines you will want to put it in one script and use it from many scripts.
es: Cuando se trata de algo más que unos pocas líneas, querrá ubicarlo en un script, y usarlo desde varios otros.

source: We will call that one script a library script.
es: Vamos a denominar ese script como biblioteca.

source: Manually loading a library script is possible, so long as you avoid loading it when it's already done.
es: Cargar una biblioteca manualmente es posible, siempre que evite cargarla cuando ya lo está.

source: You can do this with the |exists()| function.
es: Puede evitarlo con la función |exists()|.

source: if !exists('*MyLibFunction') runtime library/mylibscript.vim endif call MyLibFunction(arg)
es: if !exists('*MiFuncionBiblioteca') runtime library/biblioteca.vim endif call MiFuncionBiblioteca(arg)

source: To make this a bit simpler Vim offers the autoload mechanism.
es: Para hacer esto más sencillo, Vim ofrece el mecanismo «autoload» (carga automática).

source: Then the example looks like this: >
es: Así, el ejemplo tendría este aspecto: >

source: call mylib#myfunction(arg)
es: call mibiblioteca#mifuncion(arg)

source: That's a lot simpler, isn't it?
es: Mucho más sencillo, ¿verdad?

source: Vim will recognize the function name and when it's not defined search for the script "autoload/mylib.vim" in 'runtimepath'.
es: Vim reconoce el nombre de la función y, cuando no esté definida, la buscará el script «autoload/mibiblioteca.vim» en 'runtimepath'.

source: That script must define the "mylib#myfunction()" function.
es: El script debe definir la función «mibiblioteca#mifuncion()».

source: You can put many other functions in the mylib.vim script, you are free to organize your functions in library scripts.
es: Puede almacenar varias funciones en el script mibiblioteca.vim, y puede organizar como desee las funciones en sus bibliotecas.

source: But you must use function names where the part before the '#' matches the script name.
es: Pero debe usar nombres de funciones en las que la parte que precede a «#» coincide con el nombre del script.

source: Otherwise Vim would not know what script to load.
es: En caso contrario, Vim no sabrá qué script cargar.

source: If you get really enthusiastic and write lots of library scripts, you may want to use subdirectories.
es: Si esto le entusiasma, y escribe muchas bibliotecas, puede que quiera usar subdirectorios.

source: function netlib#ftp#read(fname) " Read the file fname through ftp endfunction
es: function netlib#ftp#read(nombre_archivo) " Lee al archivo mediante FTP endfunction

source: Notice that the name the function is defined with is exactly the same as the name used for calling the function.
es: Tenga en cuenta que el nombre con el que se define la función es idéntico al utilizado para invocar la función.

source: And the part before the last '#' exactly matches the subdirectory and script name.
es: Y la parte a continuación del último «#» coincide con el subdirectorio y el nombre del script.

source: let weekdays = dutch#weekdays
es: let dias_semana = colombia#dias_semana

source: let dutch#weekdays = ['zondag', 'maandag', 'dinsdag', 'woensdag', \ 'donderdag', 'vrijdag', 'zaterdag']
es: let colombia#dias_semana = ['lunes', 'martes', 'miércoles', 'jueves', \ 'viernes', 'sábado', 'domingo']

source: *41.16* Distributing Vim scripts *distribute-script*
es: *41.16* Distribuir scripts de Vim *distribute-script*

source: Vim users will look for scripts on the Vim website: http://www.vim.org.
es: Los usuarios de Vim buscarán scripts en el sitio web de Vim: http://www.vim.org.

source: If you made something that is useful for others, share it!
es: Si ha creado algo útil para otros, ¡compártalo!

source: Vim scripts can be used on any system.
es: Los scripts de Vim se pueden usar en cualquier sistema.

source: There might not be a tar or gzip command.
es: Las órdenes tar o gzip pueden no estar disponibles en dichos sistemas.

source: If you want to pack files together and/or compress them the "zip" utility is recommended.
es: Si desea empaquetar o comprimir los archivos, se recomienda usar la herramienta «zip».

source: For utmost portability use Vim itself to pack scripts together.
es: Para obtener la máxima portabilidad use Vim para empaquetar los scripts.

source: This can be done with the Vimball utility.
es: Puede hacer esto con la herramienta Vimball.

source: See |vimball|.
es: Consulte |vimball|.

source: It's good if you add a line to allow automatic updating.
es: Es una buena idea añadir una línea para pemitir la actualización automática.

source: See |glvs-plugins|.
es: Consulte |glvs-plugins|.

source: *usr_30.txt* For Vim version 7.3.
es: *usr_30.esx* Para Vim versión 7.3.

source: Last change: 2007 Nov 10
es: Último cambio: 10/11/2007

source: Editing programs
es: Edición de programas

source: |30.1| Compiling |30.2| Indenting C files |30.3| Automatic indenting |30.4| Other indenting |30.5| Tabs and spaces |30.6| Formatting comments
es: |30.1| Compilar |30.2| Sangrado en archivos C |30.3| Sangrado automático |30.4| Otros sangrados |30.5| Tabulados y espacios |30.6| Formatear comentarios

source: Next chapter: |usr_31.txt| Exploiting the GUI Previous chapter: |usr_29.txt| Moving through programs Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_31.esx| Sacar partido a la interfaz gráfica Capítulo anterior: |usr_29.esx| Moverse a través de programas Tabla de contenidos: |usr_toc.esx|

source: *30.1* Compiling
es: *30.1* Compilar

source: Vim has a set of so called "quickfix" commands.
es: Vim tiene un conjunto de órdenes de arreglos rápidos («quickfix»).

source: They enable you to compile a program from within Vim and then go through the errors generated and fix them (hopefully).
es: Permiten compilar un programa desde Vim y después navegar a través de los errores generados y (posiblemente) arreglarlos.

source: You can then recompile and fix any new errors that are found until finally your program compiles without any error.
es: Puede después recompilar y arreglar cualquier error nuevo detectado hasta que finalmente su programa se compile sin problemas.

source: If errors were generated, they are captured and the editor positions you where the first error occurred.
es: Si se genera algún error, se captura y el editor le posicionará sobre el primer error.

source: Take a look at an example ":make" session.
es: Este es un ejemplo de una sesión típica de «:make».

source: (Typical :make sessions generate far more errors and fewer stupid ones.) After typing ":make" the screen looks like this:
es: (Las sesiones típicas de «:make» generan muchos menos errores y menos errores estúpidos.) La pantalla presentará este aspecto después de teclear «:make»:

source: From this you can see that you have errors in the file "main.c".
es: Aquí puede ver que tiene errores en el archivo «main.c».

source: When you press <Enter>, Vim displays the file "main.c", with the cursor positioned on line 6, the first line with an error.
es: Cuando pulse <Intro>, Vim mostrará el archivo «main.c», con el cursor posicionado en la línea 6, la primera con un error.

source: You did not need to specify the file or the line number, Vim knew where to go by looking in the error messages.
es: No necesitó definir el archivo o el número de línea, ya que Vim sabe dónde ir analizando los mensajes de error.

source: Vim jumps to line 10, the last line in the file, where there is an extra '}'.
es: Vim salta a la línea 10, la última línea en el archivo, donde hay un «}» adicional.

source: When there is not enough room, Vim will shorten the error message.
es: Cuando no hay suficiente espacio Vim acorta el mensaje de error.

source: To see the whole message use: >
es: Para ver el mensaje completo, use lo siguiente: >

source: You can get an overview of all the error messages with the ":clist" command.
es: Puede obtener una visión general de todos los mensajes de error con la orden «:clist».

source: The output looks like this: >
es: La salida tiene el siguiente aspecto: >

source: Only the lines where Vim recognized a file name and line number are listed here.
es: Sólo se muestran las líneas donde Vim reconoció un nombre de archivo y un número de línea.

source: It assumes those are the interesting lines and the rest is just boring messages.
es: Asume que aquéllas son las líneas de interés, mientras que toma el resto como mensajes aburridos.

source: However, sometimes unrecognized lines do contain something you want to see.
es: Aún así, a veces las líneas no reconocidas contiene algo que desea ver.

source: Output from the linker, for example, about an undefined function.
es: Por ejemplo, la salida del enlazador acerca de una función no definida.

source: To see all the messages add a "!" to the command: >
es: Para ver todos los mensajes, añada «!» a la orden: >

source: Vim will highlight the current error.
es: Vim resaltará el error actual.

source: To go back to the previous error, use: > :cprevious
es: Use lo siguiente para volver al error anterior: > :cprevious

source: :cfirst to first error :clast to last error :cc 3 to error nr 3
es: :cfirst primer error :clast último error :cc 3 error número 3

source: The name of the program to run when the ":make" command is executed is defined by the 'makeprg' option.
es: El nombre del programa a ejecutar cuando usa la orden «:make» se define con la opción 'makeprg'.

source: Usually this is set to "make", but Visual C++ users should set this to "nmake" by executing the following command: >
es: Habitualmente, esto se define como «make», pero usuarios de Visual C++ deberían definir esto como «nmake» ejecutando la siguiente orden: >

source: You can also include arguments in this option.
es: También puede incluir argumentos en esta opción.

source: Special characters need to be escaped with a backslash.
es: Los caracteres especiales se deben escapar con una barra inversa.

source: You can include special Vim keywords in the command specification.
es: Puede incluir palabras clave especiales de Vim al especificar la orden.

source: The % character expands to the name of the current file.
es: El carácter «%» se expande con el nombre del archivo actual.

source: So if you execute the command: > :set makeprg=make\ %
es: Así que se ejecuta la siguiente orden: > :set makeprg=make\ %

source: Suppose you ":make" a program.
es: Suponga que compila un programa con «:make».

source: There is a warning message in one file and an error message in another.
es: Hay un mensaje de aviso en un archivo y un mensaje de error en otro.

source: You fix the error and use ":make" again to check if it was really fixed.
es: Arregla el mensaje y usa «:make» otra vez para comprobar que lo ha arreglado.

source: Now you want to look at the warning message.
es: Ahora desea ver el mensaje de aviso.

source: It doesn't show up in the last error list, since the file with the warning wasn't compiled again.
es: No aparece en la última lista de errores ya que aún no se ha compilado el archivo con el aviso.

source: You can go back to the previous error list with: >
es: Puede volver a la lista de errores previa con: >

source: Then use ":clist" and ":cc {nr}" to jump to the place with the warning.
es: Use ahora «:clist» y «:cc {nr}» para saltar al lugar con el aviso.

source: To go forward to the next error list: >
es: Use lo siguiente para avanzar a la siguiente lista de errores: >

source: You have to tell Vim what format the error messages are that your compiler produces.
es: Tiene que indicar a Vim el formato de los mensajes de error que produce su compilador.

source: This is done with the 'errorformat' option.
es: Se puede hacer con la opción 'errorformat'.

source: The syntax of this option is quite complicated and it can be made to fit almost any compiler.
es: La sintaxis de esta opción es algo complicada, y puede hacer que encaje con prácticamente cualquier compilador.

source: You can find the explanation here: |errorformat|.
es: Puede encontrar la explicación aquí: |errorformat|.

source: You might be using various different compilers.
es: Puede que esté usando varios compiladores diferentes.

source: Setting the 'makeprg' option, and especially the 'errorformat' each time is not easy.
es: Definir la opción 'makeprg' y especialmente la opción 'errorformat' cada vez no es un tarea sencilla.

source: Vim offers a simple method for this.
es: Vim ofrece una forma sencilla de hacer esto.

source: For example, to switch to using the Microsoft Visual C++ compiler: >
es: Por ejemplo, para cambiar al compilador Microsoft Visual C++: >

source: This will find the Vim script for the "msvc" compiler and set the appropriate options.
es: Esta orden encontrará el script de Vim para el compilador «msvc» y definirá las opciones adecuadas.

source: You can write your own compiler files.
es: Puede escribir sus propios archivos de compilador.

source: See |write-compiler-plugin|.
es: Consulte |write-compiler-plugin|.

source: The ":make" command redirects the output of the executed program to an error file.
es: La orden «:make» redirige la salida del programa ejecutado a un archivo error.

source: How this works depends on various things, such as the 'shell'.
es: El modo en que esto último funciona depende de varias cosas, tales como la consola ('shell').

source: If your ":make" command doesn't capture the output, check the 'makeef' and 'shellpipe' options.
es: Si su orden «:make» no captura la salida, compruebe las opciones 'makeef' y 'shellpipe'.

source: The 'shellquote' and 'shellxquote' options might also matter.
es: Las opciones 'shellquote' y 'shellxquote' también son de importancia.

source: In case you can't get ":make" to redirect the file for you, an alternative is to compile the program in another window and redirect the output into a file.
es: En el caso de que no pueda hacer que «:make» redirija la salida del archivo, una alternativa es compilar el programa en otra ventana y redirigir la salida al archivo.

source: Then have Vim read this file with: >
es: Después, haga que Vim lea este archivo con: >

source: *30.2* Indenting C style text
es: *30.2* Sangrado en archivos C

source: A program is much easier to understand when the lines have been properly indented.
es: Un programa es mucho más fácil de entender cuando las líneas tienen un sangrado adecuado.

source: Vim offers various ways to make this less work.
es: Vim ofrece varias formas de facilitar esto.

source: For C or C style programs like Java or C++, set the 'cindent' option.
es: Para programas C o con estilo C como Java o C++, defina la opción 'cindent'.

source: Vim knows a lot about C programs and will try very hard to automatically set the indent for you.
es: Vim sabe mucho acerca de programas C e intentará definir el sangrado automáticamente.

source: Set the 'shiftwidth' option to the amount of spaces you want for a deeper level.
es: Defina la opción 'shiftwidth' con el número de espacios que desea para cada nivel de profundidad.

source: Four spaces will work fine.
es: Cuatro espacios funcionarán bien.

source: One ":set" command will do it: >
es: Puede hacerlo con una orden 'set': >

source: if (flag) Automatic indent ---> do_the_work(); Automatic unindent <-- if (other_flag) { Automatic indent ---> do_file(); keep indent do_some_more(); Automatic unindent <-- }
es: if (opción) Sangrado automático ---> do_the_work(); Eliminar sangrado automático <-- if (otra_opción) { Sangrado automático ---> do_file(); Preservar el sangrado do_some_more(); Eliminar sangrado automático <-- }

source: When you type something in curly braces ({}), the text will be indented at the start and unindented at the end.
es: Cuando teclee algo entre llaves ({}), el texto tendrá un sangrado al inicio, pero no al final.

source: The unindenting will happen after typing the '}', since Vim can't guess what you are going to type.
es: La eliminación de sangrado («unindenting») aparecerá después de teclear '}', ya que Vim no puede adivinar qué va a escribir.

source: One side effect of automatic indentation is that it helps you catch errors in your code early.
es: Un efecto secundario del sangrado automático es que le permite encontrar los errores en su código de manera temprana.

source: When you type a } to finish a function, only to find that the automatic indentation gives it more indent than what you expected, there is probably a } missing.
es: Si teclea «}» para finalizar una función y ve que el sangrado automático la da más del esperado, puede que falte un «}».

source: Use the "%" command to find out which { matches the } you typed.
es: Use la orden «%» para encontrar qué «{» encaja con la «}» que introdujo.

source: A missing ) and ; also cause extra indent.
es: Un «)» y «;» omitido también causan un sangrado adicional.

source: Thus if you get more white space than you would expect, check the preceding lines.
es: Por ello, si obtiene más espacios en blanco del esperado, compruebe la líneas precedentes.

source: When you have code that is badly formatted, or you inserted and deleted lines, you need to re-indent the lines.
es: Cuando tiene código mal formateado, o si ha insertado o eliminado líneas, tendrá que sangrar las líneas nuevamente.

source: The "=" operator does this.
es: El operador «=» hace esto.

source: The simplest form is: >
es: La forma más simple es: >

source: I you have really badly indented code, you can re-indent the whole file with: > gg=G
es: Si tiene código con un pésimo sangrado, puede sangrar nuevamente el archivo completo con: > gg=G

source: However, don't do this in files that have been carefully indented manually.
es: Sin embargo, no lo haga en los archivos que han sido cuidadosamente sangrados manualmente.

source: The automatic indenting does a good job, but in some situations you might want to overrule it.
es: El sangrado automático hace un buen trabajo, pero en algunas situaciones puede que desee anularlo.

source: Different people have different styles of indentation.
es: Diferentes personas tienen diferentes estilos de sangrado.

source: By default Vim does a pretty good job of indenting in a way that 90% of programmers do.
es: Por omisión, Vim realiza un buen trabajo de sangrado de la manera en que lo hace el 90% de los programadores.

source: There are different styles, however; so if you want to, you can customize the indentation style with the 'cinoptions' option.
es: Aun así, hay diferentes estilos; así que si lo desea, puede personalizar el estilo de sangrado con la opción 'cinoptions'.

source: By default 'cinoptions' is empty and Vim uses the default style.
es: Por omisión, 'cinoptions' está vacío, usando Vim el estilo predeterminado.

source: You can add various items where you want something different.
es: Puede añadir varios elementos cuando desee algo diferente.

source: For example, to make curly braces be placed like this:
es: Por ejemplo, para ubicar llaves de la siguiente forma:

source: if (flag) ~ { ~ i = 8; ~ j = 0; ~ } ~
es: if (opción) ~ { ~ i = 8; ~ j = 0; ~ } ~
