Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: *03.1* Word movement
es: *03.1* Desplazarse sobre palabras

source: To move the cursor forward one word, use the "w" command. Like most Vim commands, you can use a numeric prefix to move past multiple words. For example, "3w" moves three words. This figure shows how it works:
es: Para mover el cursor una palabra hacia delante, use la orden «w». Del mismo modo que la mayoría de órdenes Vim, puede usar un prefijo numérico. Por ejemplos, «3w» se mueve tres palabras. Esta figura muestra cómo funciona:

source: This is a line with example text ~ --->-->->-----------------> w w w 3w
es: Ésta es una línea con texto de ejemplo ~ --->-->--->---------------> w w w 3w

source: Notice that "w" moves to the start of the next word if it already is at the start of a word. The "b" command moves backward to the start of the previous word:
es: Fíjese en que «w» le mueve al comienzo de la siguiente palabra si ya se encuentra al comienzo de una palabra. La orden «b» le desplaza al comienzo de la palabra anterior:

source: This is a line with example text ~ <----<--<-<---------<--- b b b 2b b
es: Ésta es una línea con texto de ejemplo ~ <----<--<---<---------<--- b b b 2b b

source: This is a line with example text ~ <- <--- -----> ----> ge ge e e
es: Ésta es una línea con texto de ejemplo ~ <- <--- -----> ----> ge ge e e

source: A word ends at a non-word character, such as a ".", "-" or ")". To change what Vim considers to be a word, see the 'iskeyword' option. It is also possible to move by white-space separated WORDs. This is not a word in the normal sense, that's why the uppercase is used. The commands for moving by WORDs are also uppercase, as this figure shows:
es: Una palabra termina en un carácter de separación, como «.», «-» o «)». Para cambiar lo que Vim considera una palabra, consulte la opción 'iskeyword'. También es posible desplazarse por palabras separadas por espacios en blanco. Esto no es una PALABRA en el sentido habitual, por ello se usan las mayúsculas para designarla. Las órdenes para desplazarse por PALABRAS están también en mayúsculas, como muestra la siguiente figura:

source: ge b w e <- <- ---> ---> This is-a line, with special/separated/words (and some more). ~ <----- <----- --------------------> -----> gE B W E
es: ge b w e <- <- ---> ---> Ésta es-una línea, con palabras separadas/de forma/especial (y algo más). ~ <----- <----- --------------------> -----> gE B W E

source: *03.2* Moving to the start or end of a line
es: *03.2* Desplazarse al principio o al final de la línea

source: The "$" command moves the cursor to the end of a line. If your keyboard has an <End> key it will do the same thing.
es: La orden «$» mueve el cursor al final de la línea. Si su teclado tiene la tecla <Fin>, conseguirá el mismo resultado pulsándola.

source: The "^" command moves to the first non-blank character of the line. The "0" command (zero) moves to the very first character of the line. The <Home> key does the same thing. In a picture:
es: La orden «^» le lleva hacia el primer carácter no vacío de la línea. La orden «0» (cero) le mueve al primer carácter de la línea. La tecla <Inicio> hace lo mismo. En una imagen:

source: ^ <------------ .....This is a line with example text ~ <----------------- ---------------> 0 $
es: ^ <------------ .....Ésta es una línea con texto de ejemplo ~ <----------------- ---------------> 0 $

source: The "$" command takes a count, like most movement commands. But moving to the end of the line several times doesn't make sense. Therefore it causes the editor to move to the end of another line. For example, "1$" moves you to the end of the first line (the one you're on), "2$" to the end of the next line, and so on. The "0" command doesn't take a count argument, because the "0" would be part of the count. Unexpectedly, using a count with "^" doesn't have any effect.
es: La orden «$» admite un multiplicador, como la mayoría de órdenes de evento. Pero moverse hacia el final de la línea varias veces no tiene sentido. Por lo tanto, lo que hace es moverle hacia el final de la siguiente línea. Por ejemplo, «1$» le mueve hacia el final de la primera línea (en la que está), «2$» te mueve al final de la siguiente línea, y así en adelante. La orden «0» no admite ningún multiplicador, porque el «0» podría ser parte del número. Usar un multiplicador con «^» tampoco tiene ningún efecto.

source: *03.3* Moving to a character
es: *03.3* Desplazarse a un carácter

source: One of the most useful movement commands is the single-character search command. The command "fx" searches forward in the line for the single character x. Hint: "f" stands for "Find". For example, you are at the beginning of the following line. Suppose you want to go to the h of human. Just execute the command "fh" and the cursor will be positioned over the h:
es: Uno de las órdenes de movimiento más útiles es la orden de búsqueda de un único carácter. La orden «fx» busca hacia delante en la línea el carácter x. Truco: «f» viene de «Find» (en inglés, buscar). Por ejemplo, está al principio de la línea siguiente. Suponga que quiere ir a la «h» de «humano». Ejecute la orden «fh» y el cursor se posicionará sobre la h:

source: To err is human. To really foul up you need a computer. ~ ---------->---------------> fh fy
es: Errar es humano. Para liarla de verdad necesita un ordenador. ~ ---------->---------------> fh fy

source: This also shows that the command "fy" moves to the end of the word really. You can specify a count; therefore, you can go to the "l" of "foul" with "3fl":
es: Esto también muestra que la orden «d» le lleva al comienzo de la palabra «de». Puede especificar un multiplicador; por lo tanto, puede ir a la «r» de «verdad» con «3fr»:

source: To err is human. To really foul up you need a computer. ~ ---------------------> 3fl
es: Errar es humano. Para liarla de verdad necesita un ordenador. ~ ---------------------> 3fl

source: To err is human. To really foul up you need a computer. ~ <--------------------- Fh
es: Errar es humano. Para liarla de verdad necesitas un ordenador. ~ <--------------------- Fh

source: The "tx" command works like the "fx" command, except it stops one character before the searched character. Hint: "t" stands for "To". The backward version of this command is "Tx".
es: La orden «tx» funciona como la orden «fx», salvo que para un carácter antes del buscado. Truco: «t» viene de «To». La versión inversa de esta orden es «Tx».

source: To err is human. To really foul up you need a computer. ~ <------------ -------------> Th tn
es: Errar es humano. Para liarla de verdad necesita un ordenador. ~ <------------ -------------> Th tn

source: These four commands can be repeated with ";". "," repeats in the other direction. The cursor is never moved to another line. Not even when the sentence continues.
es: Estas cuatro órdenes se pueden repetir con «;». «,» repite en la otra dirección. El cursor nunca se mueve a otra línea. Ni siquiera cuando la frase continúa.

source: Sometimes you will start a search, only to realize that you have typed the wrong command. You type "f" to search backward, for example, only to realize that you really meant "F". To abort a search, press <Esc>. So "f<Esc>" is an aborted forward search and doesn't do anything. Note: <Esc> cancels most operations, not just searches.
es: En ciertas ocasiones comenzará la búsqueda y se dará cuenta de que ha tecleado la orden errónea. Por ejemplo, pulsa «f» para buscar hacia atrás, y se da cuenta de que tenía que haber pulsado «F». Para abortar la búsqueda, pulse <Esc>. Por lo tanto, «f<Esc>» es una búsqueda abortada. Nota: <Esc> cancela la mayoría de las operaciones, no sólo búsquedas.

source: *03.4* Matching a parenthesis
es: *03.4* Emparejar un paréntesis

source: When writing a program you often end up with nested () constructs. Then the "%" command is very handy: It moves to the matching paren. If the cursor is on a "(" it will move to the matching ")". If it's on a ")" it will move to the matching "(".
es: Al escribir código, a menudo usa constructos anidados del tipo (). Para ello la orden «%x resulta muy útil: le desplaza hasta el paréntesis opuesto. Si el cursor está en un «(», le moverá hasta el «)». Si está en un «)» le moverá hasta el «(» correspondiente.

source: This also works for [] and {} pairs. (This can be defined with the 'matchpairs' option.)
es: Esto también funciona para parejas de [] y {}. (Esto se puede definido con la opción 'matchpairs'.)

source: *03.5* Moving to a specific line
es: *03.5* Desplazarse a una línea específica

source: This tells you that you might want to fix something on line 33. So how do you find line 33? One way is to do "9999k" to go to the top of the file and "32j" to go down thirty two lines. It is not a good way, but it works. A much better way of doing things is to use the "G" command. With a count, this command positions you at the given line number. For example, "33G" puts you on line 33. (For a better way of going through a compiler's error list, see |usr_30.txt|, for information on the :make command.) With no argument, "G" positions you at the end of the file. A quick way to go to the start of a file use "gg". "1G" will do the same, but is a tiny bit more typing.
es: Esto le indica que probablemente quiera arreglar algo en la línea 33. Entonces, ¿cómo encuentra la línea 33? Un modo es hacer «9999k» para ir a la parte superior del archivo y «32j» para ir hacia abajo 32 líneas. Este no es el mejor modo, pero funciona. Uno mucho mejor es usar la orden «G». Con un multiplicador, esta orden le posiciona en la línea indicada. Por ejemplo, «33G» le lleva a la línea 33. (Hay un modo aún mejor de ir por la lista de errores del compilador, consulte |usr_30.txt| para información sobre «:make».) Sin argumentos, «G» le posiciona al final del archivo. Una forma rápida de ir al comienzo de la línea es usar «gg». «1G» hará lo mismo, pero es una pizca más lento de escribir.

source: | first line of a file ^ | text text text text | | text text text text | gg 7G | text text text text | | text text text text | text text text text V text text text text | text text text text | G text text text text | last line of a file V
es: | primera línea de un archivo ^ | texto texto texto texto | | texto texto texto texto | gg 7G | texto texto texto texto | | texto texto texto texto | texto texto texto texto V texto texto texto texto | texto texto texto texto | G texto texto texto texto | última línea de un archivo V

source: Another way to move to a line is using the "%" command with a count. For example "50%" moves you to halfway the file. "90%" goes to near the end.
es: Otra manera de ir a una línea es con la orden «%» y un multiplicador. Por ejemplo «50%» le mueve a la mitad del archivo. «90%» va casi al final.

source: The previous assumes that you want to move to a line in the file, no matter if it's currently visible or not. What if you want to move to one of the lines you can see? This figure shows the three commands you can use:
es: Lo anterior asume que se quiere mover a una línea en un archivo, no importa si está visible o no. Pero ¿qué pasa si se quiere mover a una de las líneas que puede ver? Esta figura le muestra las tres órdenes que puede emplear:

source: +---------------------------+ H --> | text sample text | | sample text | | text sample text | | sample text | M --> | text sample text | | sample text | | text sample text | | sample text | L --> | text sample text | +---------------------------+
es: +---------------------------+ H --> | texto ejemplo texto | | ejemplo texto | | texto ejemplo texto | | ejemplo texto | M --> | texto ejemplo texto | | ejemplo texto | | texto ejemplo texto | | ejemplo texto | L --> | texto ejemplo texto | +---------------------------+

source: *03.6* Telling where you are
es: *03.6* Indicar donde está

source: 1. Use the CTRL-G command. You get a message like this (assuming the 'ruler' option is off):
es: 1. Use la orden CTRL-G. Obtendrá un mensaje como este (asumiendo que la opción 'ruler' está desactivada:

source: This shows the name of the file you are editing, the line number where the cursor is, the total number of lines, the percentage of the way through the file and the column of the cursor. Sometimes you will see a split column number. For example, "col 2-9". This indicates that the cursor is positioned on the second character, but because character one is a tab, occupying eight spaces worth of columns, the screen column is 9.
es: Esto le muestra el nombre del archivo que está editando, el número de línea en el que se encuentra su cursor, la posición relativa (en porcentaje) y la columna del cursor. A veces verá dos números separados por guión. Por ejemplo, «col 2-9». Esto indica que el cursor está posicionado en el segundo carácter, pero ya que el primer carácter es un tabulador, ocupará ocho espacios de columnas, y la columna en pantalla será 9.

source: 2. Set the 'number' option. This will display a line number in front of every line: >
es: 2. Definir la opción 'number'. Esto mostrará el número de línea al principio de cada línea: >

source: :set number < To switch this off again: >
es: :set number < Para desactivar esto de nuevo: >

source: :set nonumber < Since 'number' is a boolean option, prepending "no" to its name has the effect of switching it off. A boolean option has only these two values, it is either on or off. Vim has many options. Besides the boolean ones there are options with a numerical value and string options. You will see examples of this where they are used.
es: :set nonumber < Ya que 'number' es una opción booleana, al escribirla con el prefijo «no» produce el efecto de apagarla. Una opción booleana tiene sólo estos dos posibles valores, «apagado» o «encendido». Vim tiene muchas opciones. Además de las booleanas, hay opciones con un valor numérico y otras de cadenas de caracteres. Verá ejemplos de esto donde sean usados.

source: 3. Set the 'ruler' option. This will display the cursor position in the lower right corner of the Vim window: >
es: 3. Activar la opción 'ruler'. Esto mostrará la posición del cursor en la esquina inferior a la derecha de la ventana de Vim: >

source: *03.7* Scrolling around
es: *03.7* Desplazar el texto

source: The CTRL-U command scrolls down half a screen of text. Think of looking through a viewing window at the text and moving this window up by half the height of the window. Thus the window moves up over the text, which is backward in the file. Don't worry if you have a little trouble remembering which end is up. Most users have the same problem. The CTRL-D command moves the viewing window down half a screen in the file, thus scrolls the text up half a screen.
es: La orden CTRL-U desplaza el texto hacia abajo. Imagine que mira a través de una ventana hacia un texto y mueve esta ventana hacia arriba una distancia igual a la mitad de la ventana. Entonces la ventana se mueve hacia arriba sobre el texto, lo cuál es hacia arriba en el archivo. No se preocupe si no recuerda qué es hacia arriba. A la mayoría de los usuarios les pasa. La orden CTRL-D mueve la ventana de visualización media pantalla hacia abajo, con lo que desplaza el texto hacia arriba media pantalla.

source: +----------------+ | some text | | some text | | some text | +---------------+ | some text | | some text | CTRL-U --> | | | | | 123456 | | 123456 | +----------------+ | 7890 | | | +----------------+ | example | CTRL-D --> | 7890 | +---------------+ | | | example | | example | | example | | example | +----------------+
es: +----------------+ | un texto | | un texto | | un texto | +---------------+ | un texto | | un texto | CTRL-U --> | | | | | 123456 | | 123456 | +----------------+ | 7890 | | | +----------------+ | ejemplo | CTRL-D --> | 7890 | +---------------+ | | | ejemplo | | ejemplo | | ejemplo | | ejemplo | +----------------+

source: To scroll one line at a time use CTRL-E (scroll up) and CTRL-Y (scroll down). Think of CTRL-E to give you one line Extra. (If you use MS-Windows compatible key mappings CTRL-Y will redo a change instead of scroll.)
es: Para bajar una sola línea use CTRL-E (avanzar) y CTRL-Y (retroceder). Piense en CTRL-E como si le diese una línea Extra. (Si usa un mapa de teclado compatible con MS-Windows CTRL-Y rehará un cambio en lugar de desplazar el texto.)

source: To scroll forward by a whole screen (except for two lines) use CTRL-F. The other way is backward, CTRL-B is the command to use. Fortunately CTRL-F is Forward and CTRL-B is Backward, that's easy to remember.
es: Para avanzar una pantalla completa (menos dos líneas) use CTRL-F. La otra manera es hacia atrás, y se usa CTRL-B. Afortunadamente CTRL-F es Forward y CTRL-B es Backward, lo cuál lo hace fácil de recordar si sabe algo de inglés.

source: +------------------+ +------------------+ | some text | | some text | | some text | | some text | | some text | | some text | | some text | zz --> | line with cursor | | some text | | some text | | some text | | some text | | line with cursor | | some text | +------------------+ +------------------+
es: +---------------------+ +---------------------+ | un texto | | un texto | | un texto | | un texto | | un texto | | un texto | | un texto | zz --> | línea con el cursor | | un texto | | un texto | | un texto | | un texto | | línea con el cursor | | un texto | +---------------------+ +---------------------+

source: The "zt" command puts the cursor line at the top, "zb" at the bottom. There are a few more scrolling commands, see |Q_sc|. To always keep a few lines of context around the cursor, use the 'scrolloff' option.
es: La orden «zt» pone la línea del cursor arriba, «zb» la situa en la parte inferior. Hay algunas órdenes más de desplazamiento de texto, consulte |Q_sc|. Para mantener siempre contexto alrededor del cursor, use la opción 'scrolloff'.

source: *03.8* Simple searches
es: *03.8* Búsquedas simples

source: To search for a string, use the "/string" command. To find the word include, for example, use the command: >
es: Para buscar una cadena, use la orden «/cadena». Para encontrar la palabra «include», por ejemplo, use la orden: >

source: You will notice that when you type the "/" the cursor jumps to the last line of the Vim window, like with colon commands. That is where you type the word. You can press the backspace key (backarrow or <BS>) to make corrections. Use the <Left> and <Right> cursor keys when necessary. Pressing <Enter> executes the command.
es: Notará que cuando pulsa «/» el cursor salta a la última línea de la ventana Vim, como con la orden «:». Ahí es donde teclea la palabra. Puede pulsar la tecla de retroceso (flecha hacia atrás o <Retroceso>) para corregir. Use las teclas de cursor cuando sea necesario. Presione <Intro> para ejecutar la orden.

source: To find the next occurrence of the same string use the "n" command. Use this to find the first #include after the cursor: >
es: Para encontrar la próxima cadena use la orden «n». Use esto para encontrar el primer #include después del cursor: >

source: And then type "n" several times. You will move to each #include in the text. You can also use a count if you know which match you want. Thus "3n" finds the third match. Using a count with "/" doesn't work.
es: Ahora pulse «n» varias veces. Le llevará a cada #include en el texto. Puede también usar un multiplicador si sabe qué cadenas coincidentes quiere. Por lo tanto «3n» va a la tercera. No se puede usar con «/».

source: The "N" command repeats the last search the opposite direction. Thus using "N" after a "/" command search backwards, using "N" after "?" searches forward.
es: La orden «N» repite la última búsqueda en la dirección opuesta. Por lo tanto, usar «N» después de una orden «/» busca hacia atrás, usar «N» tras «?» busca hacia delante.

source: Normally you have to type exactly what you want to find. If you don't care about upper or lowercase in a word, set the 'ignorecase' option: >
es: Normalmente tiene que teclear exactamente lo que quieres encontrar. Si no le importa si los caracteres están en mayúscula/minúscula, active 'ignorecase': >

source: If you now search for "word", it will also match "Word" and "WORD". To match case again: >
es: Si ahora busca «palabra», también le identificará «Palabra» y «PALABRA». Para concordar con mayúsculas y minúsculas de nuevo: >

source: /one /two /three
es: /uno /dos /tres

source: Now let's start searching by typing a simple "/" without pressing <Enter>. If you press <Up> (the cursor key), Vim puts "/three" on the command line. Pressing <Enter> at this point searches for three. If you do not press <Enter>, but press <Up> instead, Vim changes the prompt to "/two". Another press of <Up> moves you to "/one". You can also use the <Down> cursor key to move through the history of search commands in the other direction.
es: Ahora comience a buscar tecleando un simple «/» sin presionar <Intro>. Si presiona <Arriba> (la tecla de cursor), Vim introduce «tres» en la línea de órdenes. Presionar <Intro> en este punto busca «tres». Si no pulsa <Intro> y presiona <Arriba>, Vim cambia el texto a «/dos». Si pulsa de nuevo <Arriba>, verá «/uno». Puede usar también la tecla de cursor <Abajo> para moverse por el historial de órdenes de búsqueda en la otra dirección.

source: If you know what a previously used pattern starts with, and you want to use it again, type that character before pressing <Up>. With the previous example, you can type "/o<Up>" and Vim will put "/one" on the command line.
es: Si sabe cómo comienza una de sus búsquedas anteriores y la quiere usar de nuevo, introduzca ese carácter antes de presionar <Arriba>. En el ejemplo anterior, teclea «/u<Arriba>» y Vim pondrá «/uno» en la línea de órdenes.

source: The commands starting with ":" also have a history. That allows you to recall a previous command and execute it again. These two histories are separate.
es: Las órdenes que comienzan con «:» también tienen un historial. Esto ayuda a reutilizar órdenes que ha usado antes. Estos dos historiales son independientes.

source: If you type "/the" it will also match "there". To only find words that end in "the" use: >
es: Si teclea «/el» también le identificará «ellos». Para buscar sólo palabras que terminen en «el», use: >

source: /the\>
es: /el\>

source: The "\>" item is a special marker that only matches at the end of a word. Similarly "\<" only matches at the begin of a word. Thus to search for the word "the" only: >
es: El elemento z\>» es un marcador especial que sólo identifica el final de una palabra. De igual modo, «\<» identifica el comienzo de una palabra. Por lo tanto para buscar únicamente la palabra completa: >

source: /\<the\>
es: /\<el\>

source: This does not match "there" or "soothe". Notice that the "*" and "#" commands use these start-of-word and end-of-word markers to only find whole words (you can use "g*" and "g#" to match partial words).
es: Esto no encontrará «ellos» o «mantel». Fíjese en que las órdenes «*» y «#» usan estos marcadores de comienzo y final de palabra para encontrar únicamente palabras completas (puede usar «g*» y «g#» para concordancias parciales).

source: While editing a program you see a variable called "nr". You want to check where it's used. You could move the cursor to "nr" and use the "*" command and press "n" to go along all the matches. There is another way. Type this command: >
es: Al editar un programa verá una variable llamada «nr». Quiere comprobar dónde se usa. Puede mover el cursor a «nr» y usar la orden «*» y presionar «n» para ir de cadena en cadena. Pero hay otro modo. Teclee la siguiente orden: >
