Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The end-of-line character depends on the system.
es: El carácter de fin de línea usado depende del sistema.

source: For Unix a single <NL> character is used.
es: En sistemas Unix se usa <NL>.

source: For MS-DOS, Windows, OS/2 and the like, <CR><LF> is used.
es: En MS-DOS, Windows, OS/2 y similares, se usa <CR><LF>.

source: This is important when using mappings that end in a <CR>.
es: Éste es un detalle importante a considerar al usar macros que terminan en <CR>.

source: See |:source_crnl|.
es: Consulte |:source_crnl|.

source: Leading whitespace characters (blanks and TABs) are always ignored.
es: Los espacios en blanco al principio de cada línea (espacios y tabulados) siempre se ignoran.

source: The whitespaces between parameters (e.g. between the 'set' and the 'cpoptions' in the example below) are reduced to one blank character and plays the role of a separator, the whitespaces after the last (visible) character may or may not be ignored depending on the situation, see below.
es: Los espacios en blanco entre parámetros (por ejemplo, entre 'set' y 'cpoptions' en el ejemplo a continuación) se reducen a un solo espacio blanco que actúa como separador, los espacios en blanco después del último carácter (visible) se pueden o no ignorar dependiendo del caso, véase a continuación.

source: the whitespace immediately before the "=" sign is ignored.
es: se ignora el espacio en blanco inmediatamente antes del símbolo «=».

source: But there can be no whitespace after the "=" sign!
es: ¡Pero no puede haber espacios a continuación del símbolo «=»!

source: :set tags=my\ nice\ file
es: :set tags=mi\ lindo\ archivo

source: :set tags=my nice file
es: :set tags=mi lindo archivo

source: :set tags=my :set nice :set file
es: :set tags=mi :set lindo :set archivo

source: The character " (the double quote mark) starts a comment.
es: El carácter " (comilla doble) marca el inicio de un comentario.

source: Everything after and including this character until the end-of-line is considered a comment and is ignored, except for commands that don't consider comments, as shown in examples below.
es: Todo lo que aparece a continuación de éste carácter hasta el fin de línea, e incluyéndola, se considera un comentario y es ignorado, a excepción de las órdenes que no tienen en cuenta los comentarios, como se puede ver en ejemplos de esta sección.

source: A comment can start on any character position on the line.
es: Un comentario puede empezar en cualquier punto de una línea de texto.

source: There is a little "catch" with comments for some commands.
es: Hay un pequeño «pero» con los comentarios y ciertas órdenes.

source: :abbrev dev development " shorthand :map <F3> o#include " insert include :execute cmd " do it :!ls *.c " list C files
es: :abbrev des desarrollo " abreviación :map <F3> o#include " insertar directiva include :execute orden " ejecutar :!ls *.c " listar archivos C

source: The abbreviation 'dev' will be expanded to 'development " shorthand'.
es: La abreviación 'dev' se expandirá a 'desarrollo " abreviación'.

source: The mapping of <F3> will actually be the whole line after the 'o# ....' including the '" insert include'.
es: La macro <F3> constará en realidad de toda la línea desde 'o# ....' incluyendo '" insertar directiva include'.

source: The "execute" command will give an error.
es: La orden «execute» provocará un error.

source: The "!" command will send everything after it to the shell, causing an error for an unmatched '"' character.
es: La orden «!» enviará todos los caracteres a continuación al intérprete de órdenes, provocando un error debido al carácter '"' sin la comilla de cierre correspondiente.

source: There can be no comment after ":map", ":abbreviate", ":execute" and "!" commands (there are a few more commands with this restriction).
es: No pueden existir comentarios a continuación de las órdenes «:map», «:abbreviate», «:execute», ni «!» (hay algunas órdenes más con esta restricción).

source: For the ":map", ":abbreviate" and ":execute" commands there is a trick: >
es: Para el caso de las órdenes «:map», «:abbreviate», y «:execute» hay un truco disponible: >

source: :abbrev dev development|" shorthand :map <F3> o#include|" insert include :execute cmd |" do it
es: :abbrev des desarrollo|" abreviación :map <F3> o#include|" insertar directiva include :execute orden |" ejecutar

source: With the '|' character the command is separated from the next one.
es: El carácter «|» permite separar órdenes.

source: And that next command is only a comment.
es: En este caso, la siguiente orden es simplemente un comentario.

source: For the last command you need to do two things: |:execute| and use '|': > :exe '!ls *.c' |" list C files
es: Para la última orden hay que hacer dos cosas: |:execute| y usar «|»: > :exe '!ls *.c' |" listar archivos C

source: Notice that there is no white space before the '|' in the abbreviation and mapping.
es: Observe que no hay espacios en blanco antes de «|» en la abreviación ni en la macro.

source: For these commands, any character until the end-of-line or '|' is included.
es: En estas órdenes, se incluye cualquier carácter hasta el fin de línea o hasta «|».

source: As a consequence of this behavior, you don't always see that trailing whitespace is included: >
es: Como consecuencia de este comportamiento, no siempre es visible cuándo se incluyen espacios en blanco al final del a línea: >

source: For Unix there is one special way to comment a line, that allows making a Vim script executable: > #!/usr/bin/env vim -S echo "this is a Vim script" quit
es: En Unix hay una forma especial de hacer un comentario, que permite hacer que un script de Vim sea ejecutable: > #!/usr/bin/env vim -S echo "este es un script de Vim" quit

source: The "#" command by itself lists a line with the line number.
es: Por sí misma, la orden «#» muestra una línea junto con su número de línea.

source: Adding an exclamation mark changes it into doing nothing, so that you can add the shell command to execute the rest of the file.
es: Al añadirle un símbolo de exclamación su comportamiento cambia y no tiene efecto, así que puede añadir la orden de intérprete de órdenes para ejecutar el resto del archivo.

source: Here the unmap command will not work, because it tries to unmap ",ab ".
es: Aquí la orden unmap no funcionará, porque trata de eliminar la macro «,ab ».

source: This does not exist as a mapped sequence.
es: Ésta no existe como secuencia de ninguna macro.

source: An error will be issued, which is very hard to identify, because the ending whitespace character in ":unmap ,ab " is not visible.
es: Se mostrará un error, que es muy difícil de identificar, porque el carácter de espacio final en «:unmap ,ab» no es visible.

source: :unmap ,ab " comment
es: :unmap ,ab " comentario

source: Here the comment part will be ignored.
es: La parte correspondiente al comentario será ignorada.

source: However, Vim will try to unmap ',ab ', which does not exist.
es: Sin embargo, Vim tratará de eliminar la macro ',ab ', que no existe.

source: Rewrite it as: >
es: Debe reescribir la orden como: >

source: :unmap ,ab| " comment
es: :unmap ,ab| " comentario

source: Sometimes you want to make a change and go back to where cursor was.
es: En ocasiones es deseable hacer un cambio y volver al sitio en que el cursor se encontraba inicialmente.

source: Restoring the relative position would also be nice, so that the same line appears at the top of the window.
es: Recuperar la posición relativa también sería agradable, de tal forma que la misma línea inicial aparezca al inicio de la ventana.

source: This example yanks the current line, puts it above the first line in the file and then restores the view: >
es: Este ejemplo copia la línea actual, la inserta antes de la primera línea en el archivo y después restaura la vista original: >

source: What this does: > ma"aYHmbgg"aP`bzt`a < ma set mark a at cursor position "aY yank current line into register a Hmb go to top line in window and set mark b there gg go to first line in file "aP put the yanked line above it `b go back to top line in display zt position the text in the window as before `a go back to saved cursor position
es: Esto es lo que hace: > ma"aYHmbgg"aP`bzt`a < ma pone una marca en la posición actual del cursor "aY copia la línea actual al registro a Hmb va hasta la primera línea que se ve en la ventana y pone la marca b allí gg va a la primera línea del archivo "aP pega la línea copiada por encima de la línea `b vuelve a la línea superior de la vista inicial zt ubica dicha línea como la primera de la ventana `a vuelve a la posición del cursor almacenada originalmente

source: To avoid your function names to interfere with functions that you get from others, use this scheme: - Prepend a unique string before each function name.
es: Para evitar que los nombres de funciones que defina interfieran con otras funciones, use el siguiente esquema: - Anteponga una cadena única a cada nombre de función.

source: I often use an abbreviation.
es: A menudo uso una abreviatura.

source: For example, "OW_" is used for the option window functions.
es: Por ejemplo, uso «OV» para las funciones relacionadas con opciones de ventana.

source: - Put the definition of your functions together in a file.
es: - Ponga todas las definiciones de sus funciones en un mismo archivo.

source: Set a global variable to indicate that the functions have been loaded.
es: Cree una variable global para indicar que las funciones ya fueron cargadas.

source: When sourcing the file again, first unload the functions.
es: Cuando cargue el archivo de nuevo, elimine antes las definiciones de las funciones.

source: " This is the XXX package
es: " Este es el paquete XXX

source: if exists("XXX_loaded") delfun XXX_one delfun XXX_two endif
es: if exists("XXX_cargado") delfun XXX_uno delfun XXX_dos endif

source: function XXX_one(a) ... body of function ...
es: function XXX_uno(a) ... cuerpo de la función ...

source: function XXX_two(b) ... body of function ...
es: function XXX_dos(b) ... cuerpo de la función ...

source: *41.11* Writing a plugin *write-plugin*
es: *41.11* Escribir extensiones *write-plugin*

source: You can write a Vim script in such a way that many people can use it.
es: Puede crear un script de Vim de tal forma que lo puedan usar varias personas.

source: This is called a plugin.
es: Esto se llama una extensión.

source: Vim users can drop your script in their plugin directory and use its features right away |add-plugin|.
es: Los usuarios de Vim pueden copiar el script en su directorio «plugin/», y utilizarlo en el momento con |add-plugin|.

source: In this section the first type is explained.
es: En esta sección se describirán las extensiones globales («global plugins»).

source: Most items are also relevant for writing filetype plugins.
es: La mayoría de elementos también son necesarios para escribir extensiones de tipo de archivo («filetype plugins»).

source: The specifics for filetype plugins are in the next section |write-filetype-plugin|.
es: La sección a continuación, |write-filetype-plugin|, detalla las extensiones de tipo de archivo.

source: First of all you must choose a name for your plugin.
es: Primero, debe elegir un nombre para su extensión.

source: The features provided by the plugin should be clear from its name.
es: El nombre debería mostrar las funcionalidades ofrecidas por la extensión.

source: And it should be unlikely that someone else writes a plugin with the same name but which does something different.
es: Así mismo, debería ser poco probable que alguien escriba una extensión con el mismo nombre pero otras funcionalidades.

source: And please limit the name to 8 characters, to avoid problems on old Windows systems.
es: Por último, limite el nombre a ocho caracteres para evitar problemas en antiguos sistemas de Windows.

source: A script that corrects typing mistakes could be called "typecorr.vim".
es: Un script que corrige errores tipográficos se podría llamar «correccort.vim».

source: We will use it here as an example.
es: Lo usaremos como ejemplo.

source: 14 iabbrev teh the 15 iabbrev otehr other 16 iabbrev wnat want 17 iabbrev synchronisation 18 \ synchronization 19 let s:count = 4
es: 14 iabbrev csaa casa 15 iabbrev ootr otro 16 iabbrev qeu que 17 iabbrev sicronizacion 18 \ sincronización 19 let s:cuenta = 4

source: You will probably add new corrections to the plugin and soon have several versions laying around.
es: Lo más probable es que añada nuevas correcciones a la extensión, y tenga en poco tiempo varias versiones de ésta.

source: And when distributing this file, people will want to know who wrote this wonderful plugin and where they can send remarks.
es: Cuando distribuya el archivo, la gente querrá saber quién escribió esta maravillosa extensión, y dónde pueden enviar comentarios.

source: Therefore, put a header at the top of your plugin: >
es: Por ello, incluya un encabezado al principio de su extensión: >

source: 1 " Vim global plugin for correcting typing mistakes 2 " Last Change: 2000 Oct 15 3 " Maintainer: Bram Moolenaar <Bram@vim.org>
es: 1 " Extensión global de Vim para la corrección de errores 2 " Último cambio: 15 de octubre de 2000 3 " Desarrollador: Bram Moolenaar <Bram@vim.org>

source: About copyright and licensing: Since plugins are very useful and it's hardly worth restricting their distribution, please consider making your plugin either public domain or use the Vim |license|.
es: Derechos de autor y licencias: Debido a que las extensiones son útiles, y que no merece la pena restringir su distribución, considere que su extensión sea de dominio público, o use la licencia de Vim (|license|).

source: A short note about this near the top of the plugin should be sufficient.
es: Una breve nota cerca del inicio de la extensión debería servir.

source: 4 " License: This file is placed in the public domain.
es: 4 " Licencia: Este fichero pertenece al dominio público.

source: LINE CONTINUATION, AVOIDING SIDE EFFECTS *use-cpo-save*
es: CONTINUACIÓN DE LÍNEA, EVITAR EFECTOS SECUNDARIOS *use-cpo-save*

source: In line 18 above, the line-continuation mechanism is used |line-continuation|.
es: En la línea 18 del ejemplo anterior se usa el mecanismo |line-continuation|, continuación de línea.

source: Users with 'compatible' set will run into trouble here, they will get an error message.
es: Los usuarios que definan 'compatible' pueden encontrar problemas con esto, y se les mostraría un mensaje de error.

source: We can't just reset 'compatible', because that has a lot of side effects.
es: No podemos simplemente reiniciar 'compatible' porque tiene muchos efectos secundarios.

source: To avoid this, we will set the 'cpoptions' option to its Vim default value and restore it later.
es: Para evitarlo, definimos la opción 'cpoptions' con el valor predeterminado de Vim para restaurarlo más tarde.

source: That will allow the use of line-continuation and make the script work for most people.
es: Esto permite el uso de «line-continuation» y que el script funcione en la mayoría de sistemas.

source: It is done like this: >
es: Se hace de la siguiente forma: >

source: We first store the old value of 'cpoptions' in the s:save_cpo variable.
es: Primero almacenamos el valor antiguo de 'cpoptions' en la variable «s:save_cpo».

source: At the end of the plugin this value is restored.
es: El valor se restaurará al final de la extensión.

source: Notice that a script-local variable is used |s:var|.
es: Tenga en cuenta que se usa una variable local de script, |s:var|.

source: A global variable could already be in use for something else.
es: Puede que se esté utilizando una variable global para otra cosa.

source: Always use script-local variables for things that are only used in the script.
es: Use siempre variables locales en el script para aquello que se usa sólo en el script.

source: It's possible that a user doesn't always want to load this plugin.
es: Es posible que el usuario no desee cargar la extensión en cada momento.

source: Or the system administrator has dropped it in the system-wide plugin directory, but a user has his own plugin he wants to use.
es: O que el administrador del sistema lo haya copiado al directorio de extensiones del sistema, pero el usuario quiere usar el suyo propio.

source: Then the user must have a chance to disable loading this specific plugin.
es: En ese caso, el usuario debe tener la posibilidad de desactivar cargar esta extensión en particular.

source: This will make it possible: >
es: Lo siguiente lo hace posible: >

source: 6 if exists("g:loaded_typecorr") 7 finish 8 endif 9 let g:loaded_typecorr = 1
es: 6 if exists("g:loaded_correccort") 7 finish 8 endif 9 let g:loaded_correccort = 1

source: The name is recommended to start with "loaded_" and then the file name of the plugin, literally.
es: Se recomienda que el nombre empiece con «loaded_» y, a continuación, el nombre literal de la extensión.

source: The "g:" is prepended just to avoid mistakes when using the variable in a function (without "g:" it would be a variable local to the function).
es: La «g:» se añade para evitar errores al usar la variable en una función (sin la «g:», sería una variable local a la función).

source: Now let's make the plugin more interesting: We will add a mapping that adds a correction for the word under the cursor.
es: Ahora, vamos a hacer que la extensión sea más interesante: vamos a añadir una macro que añade una corrección para la palabra bajo el cursor.

source: We could just pick a key sequence for this mapping, but the user might already use it for something else.
es: Podríamos escoger una secuencia de teclas para esta macro, pero puede que el usuario la esté usando para otra cosa.

source: To allow the user to define which keys a mapping in a plugin uses, the <Leader> item can be used: >
es: Puede usar el elemento <Leader> para permitir que el usuario pueda definir las teclas que utiliza la macro de una extensión: >

source: 22 map <unique> <Leader>a <Plug>TypecorrAdd
es: 22 map <unique> <Leader>a <Plug>CorreccortAñadir

source: The user can set the "mapleader" variable to the key sequence that he wants this mapping to start with.
es: El usuario puede definir la variable «mapleader» con la secuencia de teclas con la que desea iniciar esta macro.

source: Thus if the user has done: >
es: Por lo tanto, si el usuario define: >

source: the mapping will define "_a".
es: la macro se definirá como «_a».

source: If the user didn't do this, the default value will be used, which is a backslash.
es: En caso contrario se usará el valor predeterminado, que es una barra inversa.

source: Then a map for "\a" will be defined.
es: Por ello, se definiría una macro como «\a».

source: Note that <unique> is used, this will cause an error message if the mapping already happened to exist.
es: Tenga en cuenta se usa <unique>, lo que provocaría un mensaje de error si la macro ya existe.

source: 21 if !hasmapto('<Plug>TypecorrAdd') 22 map <unique> <Leader>a <Plug>TypecorrAdd 23 endif
es: 21 if !hasmapto('<Plug>CorreccortAñadir') 22 map <unique> <Leader>a <Plug>CorreccortAñadir 23 endif

source: This checks if a mapping to "<Plug>TypecorrAdd" already exists, and only defines the mapping from "<Leader>a" if it doesn't.
es: Esto comprueba si ya existe una macro para «<Plug>CorrecortAñadir», y sólo define la macro de «<Leader>a» si no existe.

source: The user then has a chance of putting this in his vimrc file: >
es: Así, el usuario tiene la posibilidad de insertar esto en su archivo «vimrc»: >

source: map ,c <Plug>TypecorrAdd
es: map ,c <Plug>CorreccortAñadir

source: 30 function s:Add(from, correct) 31 let to = input("type the correction for " . a:from .
es: 30 function s:Anadir(desde, correccion) 31 let a = input("Introduzca la corrección para " . a:desde .

source: ": ") 32 exe ":iabbrev " . a:from .
es: ": ") 32 exe ":iabbrev " . a:desde .

source: " " . to ..
es: " " . a ..

source: Now we can call the function s:Add() from within this script.
es: Ahora invocamos la función «s:Anadir()» desde el mismo script.

source: If another script also defines s:Add(), it will be local to that script and can only be called from the script it was defined in.
es: Si otro script también define «s:Anadir()», será local a ese script y solo se invocará desde el script en el que se define.

source: There can also be a global Add() function (without the "s:"), which is again another function.
es: También puede existir una función global «Anadir()» (sin la «s:»), que es otra función distinta.

source: <SID> can be used with mappings.
es: Puede usar <SID> en una macro.

source: It generates a script ID, which identifies the current script.
es: Genera un identificador de script, que identifica al script actual.

source: In our typing correction plugin we use it like this: >
es: En nuestra extensión de corrección usaremos algo similar a esto: >

source: 24 noremap <unique> <script> <Plug>TypecorrAdd <SID>Add ..
es: 24 noremap <unique> <script> <Plug>CorreccortAñadir <SID>Añadir ..

source: 28 noremap <SID>Add :call <SID>Add(expand("<cword>"), 1)<CR>
es: 28 noremap <SID>Añadir :call <SID>Anadir(expand("<cword>"), 1)<CR>

source: \a -> <Plug>TypecorrAdd -> <SID>Add -> :call <SID>Add()
es: \a -> <Plug>CorreccortAñadir -> <SID>Añadir -> :call <SID>Anadir()

source: Note that instead of s:Add() we use <SID>Add() here.
es: Tenga en cuenta que se usó «<SID>Anadir()» en lugar de «s:Anadir()» aquí.

source: That is because the mapping is typed by the user, thus outside of the script.
es: Eso es porque la macro es tecleada por el usuario, y por ello, se hace desde fuera del script.

source: The <SID> is translated to the script ID, so that Vim knows in which script to look for the Add() function.
es: <SID> se expande al identificador del script, de forma que Vim sabe en qué script buscar la función «Anadir()».

source: This is a bit complicated, but it's required for the plugin to work together with other plugins.
es: Es un poco complicado, pero es necesario para que la extensión funcione adecuadamente con otras.

source: The basic rule is that you use <SID>Add() in mappings and s:Add() in other places (the script itself, autocommands, user commands).
es: La norma básica es que debe usar <SID>Anadir() en las macros y s:Anadir() en otros sitios (el mismo script, órdenes automáticas, órdenes de usuario).

source: 26 noremenu <script> Plugin.Add\ Correction <SID>Add
es: 26 noremenu <script> Plugin.Añadir\ Corrección <SID>Añadir

source: The "Plugin" menu is recommended for adding menu items for plugins.
es: Se recomienda el menú «Plugin» para añadir elementos de menú de extensiones.

source: In this case only one item is used.
es: En este caso, sólo se usa un elemento.

source: When adding more items, creating a submenu is recommended.
es: Recomendamos crear un menú secundario si añade más elementos.

source: For example, "Plugin.CVS" could be used for a plugin that offers CVS operations "Plugin.CVS.checkin", "Plugin.CVS.checkout", etc.
es: Por ejemplo, podría usar «Plugin.CVS» para una extensión que ofrezca operaciones CVS como «Plugin.CVS.checkin», «Plugin.CVS.checkout», etc.

source: <SID> AND <Plug> *using-<Plug>*
es: <SID> Y <Plug> *using-<Plug>*

source: Both <SID> and <Plug> are used to avoid that mappings of typed keys interfere with mappings that are only to be used from other mappings.
es: <SID> y <Plug> se usan para evitar que las macros de las teclas pulsadas interfieran con macros sólo usadas desde otras macros.

source: Note the difference between using <SID> and <Plug>:
es: Note la diferencia entre <SID> y <Plug>:

source: <Plug> is visible outside of the script.
es: <Plug> es visible fuera del script.
