Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: |netrw-cr| o Horizontally split window and display file |netrw-o| v Vertically split window and display file |netrw-v| p Use the |preview-window| |netrw-p| P Edit in the previous window |netrw-P| t Open file in a new tab |netrw-t|
es: |netrw-cr| o Dividir la ventana horizontalmente y mostrar el archivo |netrw-o| v Dividir la ventana verticalmente y mostrar el archivo |netrw-v| p Usar la |preview-window| (ventana de previsualización) |netrw-p| P Editar en la ventana anterior |netrw-P| t Abrir el archivo en una nueva pestaña |netrw-t|

source: i Controls listing style (thin, long, wide, and tree).
es: i Control el formato de la lista (estrecho, largo, ancho, y árbol).

source: The long listing includes size and date information.
es: El formato de lista largo incluye información de tamaño y fecha.

source: s Repeatedly pressing s will change the way the files are sorted; one may sort on name, modification time, or size.
es: s Pulsar «s» repetidas veces modifica la manera en que se organizan los archivos; una para ordenar por nombre, fecha de modificación, o tamaño.

source: r Reverse the sorting order.
es: r Invertir el orden de presentación.

source: c Change Vim's notion of the current directory to be the same as the browser directory.
es: c Cambiar la noción de directorio actual de Vim, para coincidir con el directorio del navegador.

source: (see |g:netrw_keepdir| to control this, too) R Rename the file or directory under the cursor; a prompt will be issued for the new name.
es: (Véase |g:netrw_keepdir| para controlare esto también.) R Renombrar el archivo o directorio bajo el cursor; verá una ventana de dialogo para introducir el nombre nuevo.

source: D Delete the file or directory under the cursor; a confirmation request will be issued.
es: D Borrar el archivo o directorio bajo el cursor; un dialogo le pedirá confirmación.

source: mb gb Make bookmark/goto bookmark
es: mb gb Crear marcador/ir a bookmark

source: :Explore [directory] Browse specified/current directory :NetrwSettings A comprehensive list of your current netrw settings with help linkage.
es: :Explore [directory] Explorar el directorio actual o especificado :NetrwSettings Una completa lista de su configuración actual de netrw, con enlaces de ayuda.

source: The netrw browser is not limited to just your local machine; one may use urls such as: (that trailing / is important)
es: El explorador netrw no esta limitado al sistema local; puede usar direcciones url tales como: (espacio en blanco / es importante).

source: :Explore ftp://somehost/path/to/dir/ :e scp://somehost/path/to/dir/
es: :Explore ftp://sistema_anfitrión/ruta/al/directorio/ :e scp://sistema_anfitrión/ruta/al/directorio/

source: *22.2* The current directory
es: *22.2* El directorio actual

source: :edit VeryLongFileName/file1.txt :edit VeryLongFileName/file2.txt :edit VeryLongFileName/file3.txt
es: :edit Nombre_Largo_de_Directorio/archivo1.txt :edit Nombre_Largo_de_Directorio/archivo2.txt :edit Nombre_Largo_de_Directorio/archivo3.txt

source: :cd VeryLongFileName :edit file1.txt :edit file2.txt :edit file3.txt
es: :cd Nombre_Largo_de_Directorio :edit archivo1.txt :edit archivo2.txt :edit archivo3.txt

source: The ":cd" command changes the current directory.
es: La orden «:cd» le permite cambiar a otro directorio.

source: You can see what the current directory is with the ":pwd" command: >
es: Puede ver cual es el directorio actual con la orden «:pwd»: >

source: :pwd /home/Bram/VeryLongFileName
es: :pwd /home/Bram/Nombre_Largo_de_Directorio

source: Vim remembers the last directory that you used.
es: Vim recuerda el último directorio que usó.

source: Use "cd -" to go back to it.
es: Use «cd -» para volver a él.

source: :pwd /home/Bram/VeryLongFileName :cd /etc :pwd /etc :cd - :pwd /home/Bram/VeryLongFileName :cd - :pwd /etc
es: :pwd /home/Bram/Nombre_Largo_de_Directorio :cd /etc :pwd /etc :cd - :pwd /home/Bram/Nombre_Largo_de_Directorio :cd - :pwd /etc

source: When you split a window, both windows use the same current directory.
es: Cuando divide una ventana, ambas ventanas usan el mismo directorio actual.

source: When you want to edit a number of files somewhere else in the new window, you can make it use a different directory, without changing the current directory in the other window.
es: Cuando desea editar un nombre de archivos en otra ubicación en la ventana nueva, puede usar un directorio diferente, sin cambiar el directorio actual en la otra ventana.

source: This is called a local directory.
es: A esto se le llama el directorio local.

source: :pwd /home/Bram/VeryLongFileName :split :lcd /etc :pwd /etc CTRL-W w :pwd /home/Bram/VeryLongFileName
es: :pwd /home/Bram/Nombre_Largo_de_Archivo :split :lcd /etc :pwd /etc CTRL-W w :pwd /home/Bram/Nombre_Largo_de_Archivo

source: So long as no ":lcd" command has been used, all windows share the same current directory.
es: Mientras no use ninguna orden «:lcd», todas las ventanas comparten el directorio actual.

source: Doing a ":cd" command in one window will also change the current directory of the other window.
es: Ejecutar una orden «:cd» en una ventana cambiará también el directorio de la otra ventana.

source: For a window where ":lcd" has been used a different current directory is remembered.
es: Si se usa con «:lcd» con una ventana, se recordará otro directorio actual.

source: Using ":cd" or ":lcd" in other windows will not change it.
es: Usar «:cd» o «:lcd» en otras ventanas no modificará esta.

source: When using a ":cd" command in a window that uses a different current directory, it will go back to using the shared directory.
es: Cuando use la orden «:cd» en una ventana que usa un directorio actual diferente, esta volverá al directorio compartido.

source: *22.3* Finding a file
es: *22.3* Encontrar un archivo

source: You want to see what is in that "inits.h" file.
es: Desea ver el contenido del archivo «inits.h».

source: Move the cursor on the name of the file and type: >
es: Desplace el cursor al nombre del archivo y teclee: >

source: Vim will find the file and edit it.
es: Vim encontrará el archivo y lo editará.

source: What if the file is not in the current directory?
es: ¿Y en el caso de que el archivo no está en el directorio actual?

source: Vim will use the 'path' option to find the file.
es: Vim usará la opción 'path' (ruta) para encontrar el archivo.

source: This option is a list of directory names where to look for your file.
es: Esta opción es una lista de nombres de directorio donde buscar su archivo.

source: Suppose you have your include files located in "c:/prog/include".
es: Suponga que tiene sus archivos include en «c:/prog/include».

source: This command will add it to the 'path' option: >
es: Esta orden la añadiría a la opción 'path': >

source: This directory is an absolute path.
es: Este directorio es una ruta absoluta.

source: No matter where you are, it will be the same place.
es: No importa donde esté, tendrá la misma ubicación.

source: What if you have located files in a subdirectory, below where the file is?
es: ¿Y en el caso de que tiene archivos ubicados en un subdirectorio, debajo de donde está el archivo?

source: Then you can specify a relative path name.
es: Puede especificar en este caso un nombre de ruta relativo.

source: This starts with a dot: > :set path+=./proto
es: Esto empieza con un punto: > :set path+=./proto

source: This tells Vim to look in the directory "proto", below the directory where the file in which you use "gf" is.
es: Esto hace que Vim mire en el directorio «proto», debajo del directorio en el que está el archivo sobre el que usa «gf».

source: Thus using "gf" on "inits.h" will make Vim look for "proto/inits.h", starting in the directory of the file.
es: Por ello, usar «gf» con «inits.h» hace que Vim busque «proto/inits.h», empezando por el directorio del archivo.

source: Without the "./", thus "proto", Vim would look in the "proto" directory below the current directory.
es: Sin el «./», en este caso «proto», Vim buscará en el directorio «proto» por debajo del directorio actual.

source: And the current directory might not be where the file that you are editing is located.
es: Y puede que el directorio actual no sea en el que se ubica el archivo que está editando.

source: The 'path' option allows specifying the directories where to search for files in many more ways.
es: La opción 'path' permite especificar de muchas más maneras los directorios donde buscar los archivos.

source: See the help on the 'path' option.
es: Véase la ayuda de la opción 'path'.

source: The 'isfname' option is used to decide which characters are included in the file name, and which ones are not (e.g., the " character in the example above).
es: La opción 'isfname' se usa para decidir qué caracteres están incluidos en el nombre del archivo, y cuales no lo están (p. ej., el carácter «"» en el ejemplo anterior).

source: Vim will then use the 'path' option to try and locate the file.
es: Vim usará entonces la opción 'path' para buscar y ubicar el archivo.

source: This is the same as the ":edit" command, except for the use of 'path'.
es: Esto equivale a la orden «:edit», excepto por el uso de 'path'.

source: This finds the file "stdio.h" in your value of 'path'.
es: Esto encuentra el archivo «stdio.h» en su valor de 'path'.

source: The quotes are necessary to have one argument |-+c|.
es: Las comillas son necesarias para tener un argumento |-+c|.

source: *22.4* The buffer list
es: *22.4* La lista de búfers.

source: The Vim editor uses the term buffer to describe a file being edited.
es: El editor Vim usa el término búfer para describir un archivo en edición.

source: Actually, a buffer is a copy of the file that you edit.
es: En realidad, un búfer es una copia del archivo que edita.

source: When you finish changing the buffer, you write the contents of the buffer to the file.
es: Cuando termina de modificar el búfer, escribe los contenidos del búfer en el archivo.

source: Buffers not only contain file contents, but also all the marks, settings, and other stuff that goes with it.
es: Los búfers no solo contienen los contenidos de al archivo, sino también las marcas, configuraciones y otros elementos que lo acompañan.

source: :hide edit two.txt
es: :hide edit dos.txt

source: The buffer "one.txt" disappears from the screen, but Vim still knows that you are editing this buffer, so it keeps the modified text.
es: El búfer «uno.txt» desaparece de la pantalla, pero Vim sabe aún sabe que esté editando el búfer, así que guarda el texto modificado.

source: This is called a hidden buffer: The buffer contains text, but you can't see it.
es: A esto se le llama un búfer oculto: El búfer contiene texto, pero no puede verlo.

source: The argument of ":hide" is another command.
es: El argumento de «:hide» es otra orden.

source: ":hide" makes that command behave as if the 'hidden' option was set.
es: «:hide» hace que una orden se comporte como si la opción 'hidden' estuviese activada.

source: You could also set this option yourself.
es: También podría configurar usted mismo esta opción.

source: The effect is that when any buffer is abandoned, it becomes hidden.
es: El efecto que esto tiene es que cuando cualquier búfer, éste se ocultará.

source: Be careful!
es: ¡Cuidado!

source: When you have hidden buffers with changes, don't exit Vim without making sure you have saved all the buffers.
es: Cuando tenga búfers ocultos con cambios, no cierre Vim antes de asegurarse de haber guardado todos los búfers.

source: When a buffer has been used once, Vim remembers some information about it.
es: Si un búfer se ha usado una vez, Vim recordará alguna información del búfer.

source: When it is not displayed in a window and it is not hidden, it is still in the buffer list.
es: Cuando no está activa en una ventana y no oculta, aún se encontrará en la lista de búfers.

source: This is called an inactive buffer.
es: A esto se le llama un búfer inactivo.

source: Overview:
es: Vista general:

source: Active Appears in a window, text loaded.
es: Activo Aparece en una ventana, texto cargado.

source: Hidden Not in a window, text loaded.
es: Hidden No aparece en una ventana, texto cargado.

source: Inactive Not in a window, no text loaded.
es: Inactive No aparece en una ventana, texto no cargado.

source: 1 #h "help.txt" line 62 ~ 2 %a+ "usr_21.txt" line 1 ~ 3 "usr_toc.txt" line 1 ~
es: 1 #h "help.txt" línea 62 ~ 2 %a+ "usr_21.txt" línea 1 ~ 3 "usr_toc.txt" línea 1 ~

source: The first column contains the buffer number.
es: La primera columna contiene el número de búfer.

source: You can use this to edit the buffer without having to type the name, see below.
es: Puede usar esto para editar el búfer sin tener que introducir el nombre, explicado a continuación.

source: After the buffer number come the flags.
es: Después del número aparecen las opciones.

source: Then the name of the file and the line number where the cursor was the last time.
es: Por último, el nombre del archivo y el número de línea en el que estaba el cursor al última vez.

source: The flags that can appear are these (from left to right):
es: Se permiten las siguientes opciones (de izquierda a derecha):

source: u Buffer is unlisted |unlisted-buffer|.
es: u Buffer no está listado |unlisted-buffer|.

source: % Current buffer.
es: % Búfer actual.

source: # Alternate buffer.
es: # Búfer alternativo.

source: a Buffer is loaded and displayed.
es: a El búfer está cargado y visible.

source: h Buffer is loaded but hidden.
es: h El búfer está cargado pero oculto.

source: = Buffer is read-only.
es: = El búfer es de sólo lectura.

source: - Buffer is not modifiable, the 'modifiable' option is off.
es: - El búfer no es modificable, la opción 'modifiable' está desactivada.

source: + Buffer has been modified.
es: + El búfer se ha modificado.

source: You can edit a buffer by its number.
es: Puede editar un búfer por su número.

source: That avoids having to type the file name: >
es: Esto evita tener que introducir el nombre del archivo: >

source: But the only way to know the number is by looking in the buffer list.
es: Pero la única manera de saber el número es a través de la lista de de búfers.

source: You can use the name, or part of it, instead: >
es: En lugar de esto, puede usar el nombre, o parte de él: >

source: Vim will find the best match for the name you type.
es: Vim mostrará la coincidencia más cercana al nombre que introduzca.

source: If there is only one buffer that matches the name, it will be used.
es: De sólo haber un búfer que coincida con el nombre, este se usará.

source: In this case "help.txt".
es: En este caso, «help.txt».

source: To open a buffer in a new window: >
es: Use lo siguiente para abrir un búfer en una nueva ventana: >

source: :bnext go to next buffer :bprevious go to previous buffer :bfirst go to the first buffer :blast go to the last buffer
es: :bnext Ir al siguiente búfer :bprevious Ir al búfer anterior :bfirst Ir al primer búfer :blast Ir al último búfer

source: Again, this also works with a name.
es: Una vez más, esto también funciona con un nombre.

source: If you delete a buffer that was active (visible in a window), that window will be closed.
es: Si elimina un búfer que estaba activo (visible en una ventana), esa ventana se cerrará.

source: If you delete the current buffer, the current window will be closed.
es: Si elimina el búfer actual, se cerrará la ventana actual.

source: If it was the last window, Vim will find another buffer to edit.
es: Si era la última ventana, Vim encontrará otro búfer que editar.

source: You can't be editing nothing!
es: ¡No puede editar la nada!

source: Note: Even after removing the buffer with ":bdelete" Vim still remembers it.
es: Nota: Aún después de eliminar un búfer con «:bdelete», Vim aún lo recuerda.

source: It's actually made "unlisted", it no longer appears in the list from ":buffers".
es: En realidad, pasa a no «unlisted» (no listado), ya que no aparece en la lista de «:buffers».

source: The ":buffers!" command will list unlisted buffers (yes, Vim can do the impossible).
es: La orden «:buffers!» muestra los búfers no listados (sí, Vim es capaz de lo imposible).

source: To really make Vim forget about a buffer, use ":bwipe".
es: Para hacer que Vim olvide completamente un búfer, use «:bwipe».

source: Also see the 'buflisted' option.
es: Véase también la opción 'buflisted'.

source: *usr_90.txt* For Vim version 7.3.
es: *usr_90.esx* Para Vim versión 7.3.

source: Last change: 2008 Sep 10
es: Último cambio: 10/09/2008

source: Installing Vim
es: Instalar Vim

source: *install* Before you can use Vim you have to install it.
es: *instalar* *install* Antes de usar Vim, tiene que instalarlo.

source: Depending on your system it's simple or easy.
es: Es sencillo o fácil dependiendo de su sistema.

source: This chapter gives a few hints and also explains how upgrading to a new version is done.
es: Este capítulo ofrece algunas indicaciones y explica cómo se actualiza a una nueva versión.

source: |90.1| Unix |90.2| MS-Windows |90.3| Upgrading |90.4| Common installation issues |90.5| Uninstalling Vim
es: |90.1| Unix |90.2| MS-Windows |90.3| Actualizar |90.4| Problemas de instalación habituales |90.5| Desinstalar Vim

source: Previous chapter: |usr_45.txt| Select your language Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_45.esx| Seleccione su idioma Tabla de contenidos: |usr_toc.esx|

source: First you have to decide if you are going to install Vim system-wide or for a single user.
es: Primero debe decidir si va a instalar Vim para uno o todos los usuarios.

source: The installation is almost the same, but the directory where Vim is installed in differs.
es: La instalación es muy similar, pero difiere el directorio de instalación de Vim.

source: For a system-wide installation the base directory "/usr/local" is often used.
es: Para una instalación de sistema (todos los usuarios), a menudo se usa el directorio base «/usr/local».

source: But this may be different for your system.
es: Pero puede ser distinto en su sistema.

source: Try finding out where other packages are installed.
es: Intente averiguar dónde se instalan los otros paquetes.

source: When installing for a single user, you can use your home directory as the base.
es: Cuando realiza una instalación para un sólo usuario, puede usar su directorio personal como base.

source: The files will be placed in subdirectories like "bin" and "shared/vim".
es: Los ficheros se ubicarań en subdirectorios como «bin» y «shared/vim».

source: You can get precompiled binaries for many different UNIX systems.
es: Puede obtener binarios precompilados para muchos sistemas UNIX diferentes.

source: There is a long list with links on this page:
es: En esta página hay una larga lista con enlaces:

source: Volunteers maintain the binaries, so they are often out of date.
es: Los responsables de los binarios son voluntarios, por lo que a menudo están obsoletos.

source: It is a good idea to compile your own UNIX version from the source.
es: Es una buena idea compilar su propia versión UNIX desde las fuentes.

source: Also, creating the editor from the source allows you to control which features are compiled.
es: Así mismo, crear el editor desde las fuentes le permite controlar las características a compilar.

source: This does require a compiler though.
es: Por otra parte, esto requiere un compilador.

source: If you have a Linux distribution, the "vi" program is probably a minimal version of Vim.
es: Si tiene una distribución de Linux, el programa vi es probablemente una versión mínima de Vim.

source: It doesn't do syntax highlighting, for example.
es: No ejecuta el resaltado de sintaxis, por ejemplo.

source: Try finding another Vim package in your distribution, or search on the web site.
es: Intente buscar otro paquete de Vim en su distribución, o busque en la página web.

source: - A C compiler (GCC preferred) - The GZIP program (you can get it from www.gnu.org) - The Vim source and runtime archives
es: - Un compilador C (preferentemente GCC) - El programa GZIP (puede obtenerlo en www.gnu.org) - Los archivos de Vim fuente y de tiempo de ejecución

source: Go to the "unix" directory and you'll find a list of files there.
es: Vaya al directorio «unix», y encontrará una serie de archivos.

source: The version number is embedded in the file name.
es: El número de versión está integrado en el nombre del archivo.

source: You can get the files for Unix in two ways: One big archive that contains everything, or four smaller ones that each fit on a floppy disk.
es: Puede obtener los archivos para Unix de dos formas: Un único archivo grande que contiene todo, o cuatro más pequeños que caben en un disquete.

source: For version 6.1 the single big one is called:
es: El archivo de la versión 6.1 se llama:

source: You need the bzip2 program to uncompress it.
es: Necesita el programa bzip2 para descomprimirlo.

source: If you don't have it, get the four smaller files, which can be uncompressed with gzip.
es: Si no lo tiene, descargue los cuatro archivos más pequeños, que se pueden descomprimir con gzip.

source: For Vim 6.1 they are called:
es: Para Vim 6.1, se llaman:

source: Then unpack the archives there.
es: Descomprima los archivos en esa ubicación.

source: If you have the one big archive, you unpack it like this: >
es: Si tiene el archivo único grande, lo puede desempaquetar de la siguiente forma: >

source: bzip2 -d -c path/vim-6.1.tar.bz2 | tar xf -
es: bzip2 -d -c ruta/vim-6.1.tar.bz2 | tar xf -

source: gzip -d -c path/vim-6.1-src1.tar.gz | tar xf - gzip -d -c path/vim-6.1-src2.tar.gz | tar xf - gzip -d -c path/vim-6.1-rt1.tar.gz | tar xf - gzip -d -c path/vim-6.1-rt2.tar.gz | tar xf -
es: gzip -d -c ruta/vim-6.1-src1.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-src2.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-rt1.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-rt2.tar.gz | tar xf -

source: The make program will run configure and compile everything.
es: El programa «make» ejecutará «configure» y compilará todo.

source: Further on we will explain how to compile with different features.
es: Más adelante explicaremos como compilar con diferentes funcionalidades.

source: If there are errors while compiling, carefully look at the error messages.
es: Si detecta errores durante la compilación, mire con detenimiento los mensajes de error.

source: There should be a hint about what went wrong.
es: Debería haber una indicación de qué falló.

source: Hopefully you will be able to correct it.
es: Con suerte, podrá corregirlos.

source: You might have to disable some features to make Vim compile.
es: Puede que tenga que desactivar algunas funcionalidades para poder compilar Vim.

source: Look in the Makefile for specific hints for your system.
es: Consulte el archivo «Makefile» para ver indicaciones específicas a su sistema.

source: This will run a sequence of test scripts to verify that Vim works as expected.
es: Esto ejecutará una secuencia de scripts de prueba para comprobar que Vim funciona de la manera esperada.

source: Vim will be started many times and all kinds of text and messages flash by.
es: Se iniciará Vim varias veces, y aparecerán rápidamente todo tipo de texto y mensajes.

source: If it is alright you will finally see:
es: Si todo es correcto, verá:

source: If you get "TEST FAILURE" some test failed.
es: Si le devuelve «TEST FAILURE», es que ha fallado alguna prueba.

source: If there are one or two messages about failed tests, Vim might still work, but not perfectly.
es: Si existen uno o más mensajes de pruebas fallidas, puede que Vim funcione, pero no a la perfección.
