Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: matches "a", "aa", "aaa", etc. But also "" (the empty string), because zero times is included. The "*" only applies to the item directly before it. Thus "ab*" matches "a", "ab", "abb", "abbb", etc. To match a whole string multiple times, it must be grouped into one item. This is done by putting "\(" before it and "\)" after it. Thus this command: >
es: coincide con «a», «aa», «aaa», etc. Pero también « » (una cadena vacía), ya que se incluye por omisión cero veces. «*» sólo afecta al su elemento precedente. Por ello, «ab*» encuentra «a», «ab», «abb», «abbb», etc. Para encontrar varias apariciones de una cadena completa, ésta ha de estar agrupada bajo un mismo elemento. Esto se hace colocando «\(» antes de la cadena, y «\)» después. Por ello, la siguiente orden: >

source: Matches: "ab", "abab", "ababab", etc. And also "".
es: encuentra «ab», «abab», «ababab», etc. También « ».

source: To avoid matching the empty string, use "\+". This makes the previous item match one or more times. >
es: Para evitar que coincida con una cadena vacía, use «\+». Esto encuentra una o más apariciones del elemento precedente. >

source: Matches "ab", "abb", "abbb", etc. It does not match "a" when no "b" follows.
es: Encuentra «ab», «abb», «abbb», etc. No coincide con «a» si no va seguido de «b».

source: To match an optional item, use "\=". Example: >
es: Para hacer coincidir un elemento opcional, utilice «\=». Ejemplo:>

source: /folders\=
es: /directorio\=

source: To match a specific number of items use the form "\{n,m}". "n" and "m" are numbers. The item before it will be matched "n" to "m" times |inclusive|. Example: >
es: Use la forma «\{n,m}» para emparejar un número específico de elementos. «n» y «m» son números. El elemento anterior a éstos se emparejará con «n» un número «m» de veces |inclusive|. Ejemplo: >

source: matches "abbb", "abbbb" and "abbbbb". When "n" is omitted, it defaults to zero. When "m" is omitted it defaults to infinity. When ",m" is omitted, it matches exactly "n" times. Examples:
es: empareja «abbb», «abbbb» y «abbbbb». El valor predeterminado cero en ausencia de «n». El valor predeterminado es infinito en ausencia de «m». En ausencia de «m», se empareja exactamente «n» veces. Ejemplos:

source: pattern match count ~ \{,4} 0, 1, 2, 3 or 4 \{3,} 3, 4, 5, etc. \{0,1} 0 or 1, same as \= \{0,} 0 or more, same as * \{1,} 1 or more, same as \+ \{3} 3
es: patrón número de coincidencias ~ \{,4} 0, 1, 2, 3 o 4 \{3,} 3, 4, 5, etc. \{0,1} 0 o 1, igual que \= \{0,} 0 o más, igual que * \{1,} 1 o más, igual que \+ \{3} 3

source: Will match "ab" in "abbb". Actually, it will never match more than one b, because there is no reason to match more. It requires something else to force it to match more than the lower limit. The same rules apply to removing "n" and "m". It's even possible to remove both of the numbers, resulting in "\{-}". This matches the item before it zero or more times, as few as possible. The item by itself always matches zero times. It is useful when combined with something else. Example: >
es: Encontraría «ab» en «abbb». En realidad, nunca coincidirá con mas de una «b», ya que no hay razón para coincidir con más. Se precisa algo más para forzar un número de coincidencias mayor que el límite más bajo. Las mismas reglas están presentes al eliminar «n» y «m». También es posible eliminar ambos números, dejando «\{-}». Esto encuentra el elemento anterior a él cero o más veces, pero cuantas menos posibles. El elemento en sí siempre se empareja cero veces. Es de utilidad en combinación con algo más. Ejemplo: >

source: This matches "axb" in "axbxb". If this pattern would be used: >
es: Esto coincide con «axb» en «axbxb». De usar este patrón >

source: *27.5* Alternatives
es: *27.5* Alternativas

source: The "or" operator in a pattern is "\|". Example: >
es: El operador «or» dentro de un patrón es «\|». Ejemplo: >

source: This matches "foo" or "bar". More alternatives can be concatenated: >
es: Esto encuentra «foo» o «bar». Puede concatenar más alternativas: >

source: /one\|two\|three
es: /uno\|dos\|tres

source: Matches "one", "two" and "three". To match multiple times, the whole thing must be placed in "\(" and "\)": >
es: Coincide con «uno», «dos» y «tres». Para encontrar varias coincidencias debe insertar la cadena completa entre «\(» y «\)»: >

source: This matches "foo", "foobar", "foofoo", "barfoobar", etc. Another example: >
es: Esto encuentra «foo», «foobar», «foofoo», «barfoobar», etc. Otro ejemplo: >

source: A related item is "\&". This requires that both alternatives match in the same place. The resulting match uses the last alternative. Example: >
es: Un elemento relacionado es «\&». Esto requiere que ambas alternativas coincidan en el mismo lugar. La coincidencia resultante usa la última alternativa. Ejemplo: >

source: This matches "for" in "forever". It will not match "fortuin", for example.
es: Esto coincide on «for» en «forever». No coincide con «fortuin», por ejemplo.

source: *27.6* Character ranges
es: *27.6* Rangos de caracteres

source: To match "a", "b" or "c" you could use "/a\|b\|c". When you want to match all letters from "a" to "z" this gets very long. There is a shorter method: >
es: Puede usar «/a|b\|c» para encontrar «a», «b» o «c». Esto se extiende si desea encontrar todas las letras de la «a» a la «z». Existe una manera más corta: >

source: The [] construct matches a single character. Inside you specify which characters to match. You can include a list of characters, like this: >
es: La construcción [] encuentra un sólo carácter. Especifique dentro de este los caracteres a encontrar. Puede incluir una lista larga de caracteres, como esto: >

source: This will match any of the characters included. For consecutive characters you can specify the range. "0-3" stands for "0123". "w-z" stands for "wxyz". Thus the same command as above can be shortened to: >
es: Esto encuentra cualquier carácter incluido. Puede especificar un rango para encontrar caracteres consecutivos. «0-3» significa «01234». «w-z» significa «wxyz». Por ello, puede acortar la orden anterior: >

source: To match the "-" character itself make it the first or last one in the range. These special characters are accepted to make it easier to use them inside a [] range (they can actually be used anywhere in the search pattern):
es: Para encontrar el carácter «-», tiene que aparecer al principio o final del rango. Estos caracteres especiales se aceptan para facilitar su uso dentro de un rango [] (en realidad, puede usarlos en cualquier lugar dentro del patrón de búsqueda):

source: To avoid matching a specific character, use "^" at the start of the range. The [] item then matches everything but the characters included. Example: >
es: Use «^» al principio del rango para evitar emparejar un carácter en particular. El elemento [] emparejará todo menos los caracteres incluidos. Ejemplo: >

source: /"[^"]*" < " a double quote [^"] any character that is not a double quote * as many as possible " a double quote again
es: /"[^"]*" < " dobles comillas [^"] todo carácter que no es una comilla doble * tantos como sea posible " otras dobles comillas

source: A number of ranges are used very often. Vim provides a shortcut for these. For example: >
es: Existe un número de rangos usados a menudo. Vim ofrece accesos directos para esto. Por ejemplo: >

source: Finds alphabetic characters. This is equal to using "/[a-zA-Z]". Here are a few more of these:
es: Encuentra caracteres alfabéticos. Esto equivale a usar «/[a-zA-Z]». Aquí hay más ejemplos:

source: item matches equivalent ~ \d digit [0-9] \D non-digit [^0-9] \x hex digit [0-9a-fA-F] \X non-hex digit [^0-9a-fA-F] \s white space [ ] (<Tab> and <Space>) \S non-white characters [^ ] (not <Tab> and <Space>) \l lowercase alpha [a-z] \L non-lowercase alpha [^a-z] \u uppercase alpha [A-Z] \U non-uppercase alpha [^A-Z]
es: elemento coincidencias equivalente ~ \d dígito [0-9] \D no-dígito [^0-9] \x dígito hexadecimal [0-9a-fA-F] \X dígito no hexadecimal [^0-9a-fA-F] \s espacio vacío [ ] (<Tab> y <Space>) \S caracteres no vacíos [^ ] (no <Tab> y <Space>) \l alfa minúscula [a-z] \L alfa no mayúscula [^a-z] \u alfa mayúscula [A-Z] \U alfa no mayúscula [^A-Z]

source: Note: Using these predefined ranges works a lot faster than the character range it stands for. These items can not be used inside []. Thus "[\d\l]" does NOT work to match a digit or lowercase alpha. Use "\(\d\|\l\)" instead.
es: Nota: El uso de estos rangos predeterminados es más rápido que el rango de caracteres que simbolizan. Estos elementos no se pueden usar dentro de []. Así, «[\d\l]» NO funciona para encontrar un dígito o un alfa minúscula. En lugar de ello, use «\(\d\|\l\)».

source: *27.7* Character classes
es: *27.7* Clase de carácter

source: The character range matches a fixed set of characters. A character class is similar, but with an essential difference: The set of characters can be redefined without changing the search pattern. For example, search for this pattern: >
es: El rango de carácter empareja un conjunto específico de caracteres. Se parece una clase de carácter, pero con una importante diferencia: puede redefinir el conjunto de caracteres sin cambiar el patrón de búsqueda. Por ejemplo, busque este patrón: >

source: The "\f" items stands for file name characters. Thus this matches a sequence of characters that can be a file name. Which characters can be part of a file name depends on the system you are using. On MS-Windows, the backslash is included, on Unix it is not. This is specified with the 'isfname' option. The default value for Unix is: >
es: Los elementos «\f» simbolizan caracteres de nombre de archivo. Así, esto empareja una secuencia de caracteres que pueden ser un nombre de archivo. Qué caracteres pueden formar parte de un nombre de archivo dependen del sistema que esté usando. En MS-Windows, la barra inversa está incluida, pero no en Unix. Puede especificar esto con la opción 'isfname'. El valor por omisión en Unix es: >

source: For other systems the default value is different. Thus you can make a search pattern with "\f" to match a file name, and it will automatically adjust to the system you are using it on.
es: El valor predeterminado depende del sistema. Así, puede crear un patrón de búsqueda con «\f» para emparejar un nombre de archivo, y ajustarse automáticamente al sistema en el que lo está usando.

source: item matches option ~ \i identifier characters 'isident' \I like \i, excluding digits \k keyword characters 'iskeyword' \K like \k, excluding digits \p printable characters 'isprint' \P like \p, excluding digits \f file name characters 'isfname' \F like \f, excluding digits
es: elemento coinicidencias opción ~ \i caracteres de identificación 'isident' \I como \i, excluyendo dígitos \k carácter de palabra clave 'iskeyword' \K como \k, excluyendo dígitos \p caracteres imprimibles 'isprint' \P como \p, excluyendo dígitos \f caracteres de nombre de archivo 'isfname' \F como \f, excluyendo dígitos

source: *27.8* Matching a line break
es: *27.8* Coincidir con un salto de línea

source: Vim can find a pattern that includes a line break. You need to specify where the line break happens, because all items mentioned so far don't match a line break. To check for a line break in a specific place, use the "\n" item: >
es: Vim puede encontrar un patrón que incluye un salto de línea. Debe especificar la aparición del salto de línea, ya que todos los elementos mencionados hasta ahora no se emparejan con un salto de línea. Para comprobar si hay un salto de línea en un lugar específico, use el elemento «\n»: >

source: /the\nword
es: /la\npalabra

source: This will match at a line that ends in "the" and the next line starts with "word". To match "the word" as well, you need to match a space or a line break. The item to use for it is "\_s": >
es: Esto coincidiría en una línea que termina con «la», seguida de una que comienza con «palabra». Para encontrar también «la palabra», tendrá que emparejar el espacio o el salto de línea. Para ello, use el elemento «\_s»: >

source: /the\_sword
es: /la\_spalabra

source: /the\_s\+word
es: /la\_s\+palabra

source: This also matches when "the " is at the end of a line and " word" at the start of the next one.
es: Esto también coincide cuando «la » está al final de la línea, y «palabra» al inicio de la siguiente.

source: "\s" matches white space, "\_s" matches white space or a line break. Similarly, "\a" matches an alphabetic character, and "\_a" matches an alphabetic character or a line break. The other character classes and ranges can be modified in the same way by inserting a "_".
es: «\s» coincide con espacio en blanco, «\_s» coincide con espacio en blanco o un salto de línea. De forma parecida, «\a» coincide con un carácter alfabético o un salto de línea. Las otras clases de caracteres y rangos se pueden modificar de la misma forma insertando un «_».

source: Many other items can be made to match a line break by prepending "\_". For example: "\_." matches any character or a line break.
es: Puede hacer coincidir muchos otros elementos con un salto de línea prefijando «\_». Por ejemplo, «\_.» coincide con cualquier carácter o salto de línea.

source: Note: "\_.*" matches everything until the end of the file. Be careful with this, it can make a search command very slow.
es: Nota: «\_.*» empareja todo hasta el final del archivo. Use esto con cuidado, ya que puede reducir la velocidad de una orden de búsqueda.

source: *27.9* Examples
es: *27.9* Ejemplos

source: Here are a few search patterns you might find useful. This shows how the items mentioned above can be combined.
es: Aquí dispone de unos cuantos patrones de búsqueda que puede encontrar útiles. Esto muestra cómo combinar los elementos anteriormente mencionados.

source: A sample license plate number is "1MGU103". It has one digit, three uppercase letters and three digits. Directly putting this into a search pattern: >
es: Un ejemplo de un número de matrícula es «1MGU103». Tiene un dígito, tres letras mayúsculas y tres dígitos. Puede insertar esto en un patrón búsqueda de la siguiente manera: >

source: Which one of these you should use? Whichever one you can remember. The simple way you can remember is much faster than the fancy way that you can't. If you can remember them all, then avoid the last one, because it's both more typing and slower to execute.
es: ¿Cual debería usar? Él que recuerde. La manera sencilla que puede recordar es más rápida que la compleja que no puede. Si los puede recordar todos, evite el último, ya que es más lento de teclear y de ejecutar.

source: In C programs (and many other computer languages) an identifier starts with a letter and further consists of letters and digits. Underscores can be used too. This can be found with: >
es: En programas C (y muchos otros lenguajes de programación), un identificador empieza con una letra seguida de letras y dígitos. Puede usar subrayados. Puede encontrar esto con: >

source: Note: "\<" and "\>" depend on the 'iskeyword' option. If it includes "-", for example, then "ident-" is not matched. In this situation use: >
es: Nota: «\<» y «\>» dependen de la opción 'iskeyword'. De incluir un «-», por ejemplo, «ident-» no se encontrará. Use lo siguiente en esta situación: >

source: /\w\@<!\h\w*\w\@! < This checks if "\w" does not match before or after the identifier. See |/\@<!| and |/\@!|.
es: /\w\@<!\h\w*\w\@! < Esto revisa se «\w» no se empareja antes o después de un identificador. Consulte |/\@<!| and |/\@!|.

source: *usr_05.txt* For Vim version 7.3. Last change: 2009 Jun 04
es: *usr_05.esx* Para Vim versión 7.3. Último cambio: 4/6/2009

source: Set your settings
es: Configuración

source: |05.1| The vimrc file |05.2| The example vimrc file explained |05.3| Simple mappings |05.4| Adding a plugin |05.5| Adding a help file |05.6| The option window |05.7| Often used options
es: |05.1| El archivo vimrc |05.2| Explicación del archivo vimrc de ejemplo |05.3| Macros sencillas |05.4| Añadir una extensión |05.5| Añadir un archivo de ayuda |05.6| La ventana de opciones |05.7| Opciones más comunes

source: Next chapter: |usr_06.txt| Using syntax highlighting Previous chapter: |usr_04.txt| Making small changes Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_06.esx| Uso del resaltado de sintaxis Capítulo anterior: |usr_04.esx| Hacer cambios pequeños Tabla de contenidos: |usr_toc.esx|

source: *05.1* The vimrc file *vimrc-intro*
es: *05.1* El archivo «vimrc» *vimrc-intro*

source: You probably got tired of typing commands that you use very often. To start Vim with all your favorite option settings and mappings, you write them in what is called the vimrc file. Vim executes the commands in this file when it starts up.
es: Probablemente se haya cansado de introducir órdenes que usa muy a menudo. Para iniciar Vim con todas sus opciones y macros favoritas, defínalos en lo que se llama el archivo «vimrc». Vim ejecuta las órdenes en este archivo al inicio.

source: If you don't have a vimrc file yet, see |vimrc| to find out where you can create a vimrc file. Also, the ":version" command mentions the name of the "user vimrc file" Vim looks for.
es: Si todavía no tiene un archivo vimrc, consulte |vimrc| para saber dónde puede crear un archivo vimrc. La orden «:version» también menciona el nombre del «archivo vimrc de usuario» que Vim busca.

source: The vimrc file can contain all the commands that you type after a colon. The most simple ones are for setting options. For example, if you want Vim to always start with the 'incsearch' option on, add this line you your vimrc file: >
es: El archivo vimrc puede contener todas las órdenes que se pueden teclear tras «:». Los más sencillos son los que se usan para ajustar opciones. Por ejemplo, si quiere que Vim comience siempre con la opción 'incsearch' activada, añada la siguiente línea al archivo: >

source: For this new line to take effect you need to exit Vim and start it again. Later you will learn how to do this without exiting Vim.
es: Necesita salir de Vim e iniciarlo otra vez para que esta nueva línea tenga efecto. Luego verá cómo hacer esto sin salir de Vim.

source: This chapter only explains the most basic items. For more information on how to write a Vim script file: |usr_41.txt|.
es: Este capítulo sólo explica los elementos más básicos. Para más información sobre cómo escribir un archivo de script de Vim: |usr_41.txt|.

source: *05.2* The example vimrc file explained *vimrc_example.vim*
es: *05.2* El archivo vimrc de ejemplo, explicado *vimrc_example.vim*

source: In the first chapter was explained how the example vimrc (included in the Vim distribution) file can be used to make Vim startup in not-compatible mode (see |not-compatible|). The file can be found here:
es: En el primer capítulo se explicó como el archivo vimrc de ejemplo (incluido en la distribución de Vim) se puede emplear para iniciar Vim en modo no-compatible (ver |not-compatible|). Puede encontrar el archivo aquí:

source: In this section we will explain the various commands used in this file. This will give you hints about how to set up your own preferences. Not everything will be explained though. Use the ":help" command to find out more.
es: En esta sección explicaremos las diferentes órdenes empleadas en este archivo. Esto le dará pistas sobre cómo preparar su propia configuración. No todo se explicará, en cualquier caso. Use la orden ":help" e investigue.

source: As mentioned in the first chapter, these manuals explain Vim working in an improved way, thus not completely Vi compatible. Setting the 'compatible' option off, thus 'nocompatible' takes care of this.
es: Tal y como se mencionó en el primer capítulo, estos manuales explican un Vim funcionando en un modo mejorado, y por lo tanto no completamente Vi-compatible. Desactivar la opción 'compatible' o activar 'nocompatible' se encarga de esto.

source: This specifies where in Insert mode the <BS> is allowed to delete the character in front of the cursor. The three items, separated by commas, tell Vim to delete the white space at the start of the line, a line break and the character before where Insert mode started. >
es: Esto especifica que se permita en el modo Insertar que <Retroceso> pueda eliminar el carácter delante del cursor. Los tres elementos, separados por comas, le dicen a Vim que puede eliminar el espacio en blanco al comienzo de la línea, un salto de línea y el carácter anterior a donde inició el modo Insertar. >

source: This tells Vim to keep a backup copy of a file when overwriting it. But not on the VMS system, since it keeps old versions of files already. The backup file will have the same name as the original file with "~" added. See |07.4| >
es: Esto le dice a Vim que mantenga una copia de seguridad de un archivo cuando lo sobreescribe. Pero no en el sistema VMS, ya que éste mantiene versiones anteriores por su cuenta. El backup tendrá el mismo nombre con un «~» delante. Véase |07.4| >

source: Keep 50 commands and 50 search patterns in the history. Use another number if you want to remember fewer or more lines. >
es: Mantiene 50 órdenes y 50 patrones de búsqueda en el historial. Use otro número si quiere almacenar más o menos líneas. >

source: Display an incomplete command in the lower right corner of the Vim window, left of the ruler. For example, when you type "2f", Vim is waiting for you to type the character to find and "2f" is displayed. When you press "w" next, the "2fw" command is executed and the displayed "2f" is removed.
es: Muestra una orden incompleta en la esquina inferior derecha de la ventana de Vim, a la izquierda del «ruler» (regla). Por ejemplo, cuando pulsa «2f», Vim está esperando que introduzcas el carácter a encontrar y muestra «2f» es mostrado. Cuando pulse «w», la orden «2fw» es ejecutará y el «2f» se eliminará.

source: +-------------------------------------------------+ |text in the Vim window | |~ | |~ | |-- VISUAL -- 2f 43,8 17% | +-------------------------------------------------+ ^^^^^^^^^^^ ^^^^^^^^ ^^^^^^^^^^ 'showmode' 'showcmd' 'ruler'
es: +-------------------------------------------------+ |texto en la ventana de Vim | |~ | |~ | |-- VISUAL -- 2f 43,8 17% | +-------------------------------------------------+ ^^^^^^^^^^^ ^^^^^^^^ ^^^^^^^^^^ 'showmode' 'showcmd' 'ruler'

source: This mapping yanks the visually selected text and searches for it in C files. This is a complicated mapping. You can see that mappings can be used to do quite complicated things. Still, it is just a sequence of commands that are executed like you typed them.
es: Esta macro copia el texto seleccionado visualmente y lo busca en archivos C. Este es una macro complicado. Aquí puede ver que los macro se pueden emplear para hacer cosas realmente complicadas. En cualquier caso, es simplemente una secuencia de órdenes que se ejecutan justo como los tecleas.

source: This switches on syntax highlighting, but only if colors are available. And the 'hlsearch' option tells Vim to highlight matches with the last used search pattern. The "if" command is very useful to set options only when some condition is met. More about that in |usr_41.txt|.
es: Esto activa el resaltado de sintaxis, pero sólo si hay colores disponibles. Y la opción 'hlsearch' le dice a Vim que resalte las coincidencias con el último patrón de búsqueda empleado. La orden «if» es muy útil para activar opciones sólo cuando se cumple alguna condición. Véase |usr_41.txt|
