Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: *[quotex]* ["x] An optional register designation where text can be stored.
es: *quotex* ["x] Un destino opcional para un registro dónde guardar el texto.

source: See |registers|.
es: Consulte |registers|.

source: The x is a single character between 'a' and 'z' or 'A' and 'Z' or '"', and in some cases (with the put command) between '0' and '9', '%', '#', or others.
es: La x es un único carácter entre 'a' y 'z', o 'A' y 'Z' o '"', y en algunos casos (con la orden «put») entre '0' y '9', '%', '#', u otros.

source: The uppercase and lowercase letter designate the same register, but the lowercase letter is used to overwrite the previous register contents, while the uppercase letter is used to append to the previous register contents.
es: Las mayúsculas y y minúsculas designan el mismo registro, pero la minúscula se usa para eliminar los contenidos anteriores del registro, y la mayúscula para añadir contenido.

source: Without the ""x" or with """" the stored text is put into the unnamed register.
es: El texto se almacenará en un registro sin nombre en caso de no usar «"x» o «""».

source: *{}* {} Curly braces denote parts of the command which must appear, but which can take a number of different values.
es: *{}* {} Las llaves indican qué partes de una orden son obligatorios, pero que pueden tomar distintos valores.

source: The differences between Vim and Vi are also given in curly braces (this will be clear from the context).
es: Las diferencias entre Vim y Vi también se resaltan con llaves (el contexto aclarará esto).

source: *{char1-char2}* {char1-char2} A single character from the range char1 to char2.
es: *{car1-car2}* {car1-car2} Un único carácter entre el rango car1 y car2.

source: For example: {a-z} is a lowercase letter.
es: Por ejemplo: {a-z} simboliza un carácter en minúscula.

source: Multiple ranges may be concatenated.
es: Puede encadenar varios rangos.

source: For example, {a-zA-Z0-9} is any alphanumeric character.
es: Por ejemplo, {a,zA-Z0-9} es cualquier carácter alfanumérico.

source: *<character>* <character> A special character from the table below, optionally with modifiers, or a single ASCII character with modifiers.
es: *<carácter>* *<character>* <carácter> Un carácter especial de la tabla a continuación, que acepta modificadores opciones, o un único carácter ASCII sin modificadores.

source: *'character'* 'c' A single ASCII character.
es: *'character'* 'c' Un único carácter ASCII.

source: *'option'* 'option' An option, or parameter, that can be set to a value, is enclosed in single quotes.
es: *'option'* 'opción' Una opción o parámetro que puede definir con un valor aparecerá entre comillas simples.

source: See |options|.
es: Consulte |options|.

source: *quotecommandquote* "command" A reference to a command that you can type is enclosed in double quotes.
es: *quotecommandquote* "orden" Las referencias a una orden aparecerán entre comillas dobles.

source: *key-notation* *key-codes* *keycodes* These names for keys are used in the documentation.
es: *notación-teclas* *teclas-tabla* *leyendatabla* Éstos son los nombres de las teclas en la documentación.

source: They can also be used with the ":map" command (insert the key name by pressing CTRL-K and then the key you want the name for).
es: También puede usarlos con la orden «:map» (inserte el nombre de la tecla pulsando CTRL-K y la tecla cuyo nombre desea).

source: notation meaning equivalent decimal value(s) ~ -----------------------------------------------------------------------
es: notación significado equivalente valor(es) decimal ~ -----------------------------------------------------------------------

source: <Nul> zero CTRL-@ 0 (stored as 10) *<Nul>* <BS> backspace CTRL-H 8 *backspace* <Tab> tab CTRL-I 9 *tab* *Tab* *linefeed* <NL> linefeed CTRL-J 10 (used for <Nul>) <FF> formfeed CTRL-L 12 *formfeed* <CR> carriage return CTRL-M 13 *carriage-return* <Return> same as <CR> *<Return>* <Enter> same as <CR> *<Enter>* <Esc> escape CTRL-[ 27 *escape* *<Esc>* <Space> space 32 *space* <lt> less-than < 60 *<lt>* <Bslash> backslash \ 92 *backslash* *<Bslash>* <Bar> vertical bar | 124 *<Bar>* <Del> delete 127 <CSI> command sequence intro ALT-Esc 155 *<CSI>* <xCSI> CSI when typed in the GUI *<xCSI>*
es: <Nul> cero CTRL-@ 0 (stored as 10) *<Nul>* <BS> tecla de retroceso CTRL-H 8 *backspace* <Tab> tabulado CTRL-I 9 *tab* *Tab* *linefeed* <NL> avanzar una línea CTRL-J 10 (usado por <Nul>) <FF> formfeed CTRL-L 12 *formfeed* <CR> retorno de línea CTRL-M 13 *carriage-return* <Return> idéntico a <CR> *<Return>* <Enter> idéntico a <CR> *<Enter>* <Esc> escape CTRL-[ 27 *escape* *<Esc>* <Space> espacio 32 *space* <lt> menos que < 60 *<lt>* <Bslash> barra inversa \ 92 *backslash* *<Bslash>* <Bar> barra vertical | 124 *<Bar>* <Del> eliminar 127 <CSI> command sequence intro ALT-Esc 155 *<CSI>* <xCSI> CSI tecleado en la interfaz gráfica *<xCSI>*

source: <EOL> end-of-line (can be <CR>, <LF> or <CR><LF>, depends on system and 'fileformat') *<EOL>*
es: <EOL> «end-of-line» (fin de línea, puede ser <CR>, <LF> o <CR><LF>, dependiendo del sistema y de 'fileformat') <EOL>

source: Note: The shifted cursor keys, the help key, and the undo key are only available on a few terminals.
es: Nota: Las teclas de movimiento, la tecla de ayuda y la tecla deshacer combinados con la tecla shift sólo están disponibles en algunas terminales.

source: On the Amiga, shifted function key 10 produces a code (CSI) that is also used by key sequences.
es: En Amiga, la tecla función 10 con shift produce un código (CSI) también empleado en secuencias de teclas.

source: It will be recognized only after typing another key.
es: Sólo se reconocerá tras pulsar otra tecla.

source: Note: There are two codes for the delete key.
es: Nota: Hay dos códigos para la tecla suprimir.

source: 127 is the decimal ASCII value for the delete key, which is always recognized.
es: El valor decimal ASCII de la tecla suprime es 127, éste siempre se reconocerá.

source: Some delete keys send another value, in which case this value is obtained from the termcap entry "kD".
es: Algunas teclas suprimir envían otro valor, en cuyo caso el valor se obtiene de la entrada de termcap «kD».

source: Both values have the same effect.
es: Ambos valores tienen el mismo efecto.

source: Also see |:fixdel|.
es: Véase también |:fixdel|.

source: Note: The keypad keys are used in the same way as the corresponding "normal" keys.
es: Nota: El uso de las teclas del teclado numérico es idéntico a sus teclas «normales» correspondientes.

source: For example, <kHome> has the same effect as <Home>.
es: Por ejemplo, <kHome> tiene el mismo efecto que <Home>.

source: If a keypad key sends the same raw key code as its non-keypad equivalent, it will be recognized as the non-keypad code.
es: Si una tecla del bloque envía el mismo código que su equivalente externo al bloque numérico, será reconocido como un código que no pertenece al bloque.

source: For example, when <kHome> sends the same code as <Home>, when pressing <kHome> Vim will think <Home> was pressed.
es: Por ejemplo, cuando <kHome> envía el mismo código que <Home>, Vim creerá que pulsa <Home> cuando en realidad pulsa <kHome>.

source: Mapping <kHome> will not work then.
es: De ser así, las macros con <kHome> no funcionarán.

source: Examples for mapping CTRL-H to the six characters "<Home>": > :imap <C-H> \<Home> :imap <C-H> <lt>Home> The first one only works when the 'B' flag is not in 'cpoptions'.
es: Ejemplos para asignar CTRL-H a los seis caracteres «<Home>»: > :imap <C-H> \<Home> :imap <C-H> <lt>Home> El primero sólo funciona si la opción 'B' no está en 'cpoptions'.

source: The second one always works.
es: El segundo siempre funciona.

source: To get a literal "<lt>" in a mapping: > :map <C-L> <lt>lt>
es: Para obtener un <lt> en una macro: > :map <C-L> <lt>lt>

source: For mapping, abbreviation and menu commands you can then copy-paste the examples and use them directly.
es: Puede copiar y pegar los ejemplos directamente para las macros, abreviaturas y órdenes de menú.

source: Or type them literally, including the '<' and '>' characters.
es: O también introducirlos literalmente, incluyendo los caracteres «<» y «>».

source: This does NOT work for other commands, like ":set" and ":autocmd"!
es: ¡Esto NO funciona con otras órdenes, como «:set» y «:autocmd».!

source: Modes, introduction *vim-modes-intro* *vim-modes*
es: Introducción a los modos *modos-vim* *vim-modes-intro* *vim-modes*

source: Visual mode This is like Normal mode, but the movement commands extend a highlighted area.
es: Modo Visual Es similar al modo Normal, pero las órdenes de movimiento extienden un área resaltada.

source: When a non-movement command is used, it is executed for the highlighted area.
es: Cuando use una orden que no sea de moción, éste afectará a toda el área resaltada.

source: See |Visual-mode|.
es: Consulte |Visual-mode|.

source: If the 'showmode' option is on "-- VISUAL --" is shown at the bottom of the window.
es: Si la opción 'showmode' está activada, verá «-- VISUAL --» en la parte inferior de la ventana.

source: Select mode This looks most like the MS-Windows selection mode.
es: Modo seleccionar Similar al modo de selección de MS-Windows.

source: Typing a printable character deletes the selection and starts Insert mode.
es: Teclear un carácter imprimible elimina la selección e inicia el modo Insertar.

source: See |Select-mode|.
es: Consulte |Select-mode|.

source: If the 'showmode' option is on "-- SELECT --" is shown at the bottom of the window.
es: Si la opción 'showmode' esta activada, verá «-- SELECT --» en la parte inferior de la ventana.

source: Insert mode In Insert mode the text you type is inserted into the buffer.
es: Modo Insertar En el modo Insertar, el texto que teclee aparecerá en el búfer.

source: See |Insert-mode|.
es: Consulte |Insert-mode|.

source: If the 'showmode' option is on "-- INSERT --" is shown at the bottom of the window.
es: Si la opción 'showmode' esta activada, verá «-- INSERT --» en la parte inferior de la ventana.

source: Command-line mode In Command-line mode (also called Cmdline mode) you Cmdline mode can enter one line of text at the bottom of the window.
es: Modo Línea de órdenes En este modo (también llamado «Cmdline mode») Cmdline mode puede introducir una línea de texto en la parte inferior de la ventana.

source: This is for the Ex commands, ":", the pattern search commands, "?" and "/", and the filter command, "!".
es: Ésto es para las órdenes Ex, «:», las órdenes de búsqueda de patrón, «?» y «/», y la orden de filtrado, «!».

source: Ex mode Like Command-line mode, but after entering a command you remain in Ex mode.
es: Modo Ex Es similar al modo Línea de órdenes, pero permanecerá en modo Ex después de ejecutar la orden.

source: Very limited editing of the command line.
es: Ofrece una edición limitada de la línea de órdenes.

source: *Operator-pending* *Operator-pending-mode* Operator-pending mode This is like Normal mode, but after an operator command has started, and Vim is waiting for a {motion} to specify the text that the operator will work on.
es: *Operator-pending* *Operator-pending-mode* Modo Operator-pending Es similar al modo Normal, pero se inicia tras una orden de operador, tras el cual Vim esperará a un movimiento {motion} para especificar el texto afectado por el operador.

source: Replace mode Replace mode is a special case of Insert mode.
es: Modo Reemplazar El modo Reemplazar es un tipo especial del modo Insertar.

source: You can do the same things as in Insert mode, but for each character you enter, one character of the existing text is deleted.
es: Puede hacer las mismas cosas que en el modo Insertar, pero sustituirá un carácter existente por cada carácter que inserte.

source: See |Replace-mode|.
es: Consulte |Replace-mode|.

source: If the 'showmode' option is on "-- REPLACE --" is shown at the bottom of the window.
es: Si la opción 'showmode' está activada, verá «-- REPLACE --» en la base de la ventana.

source: Virtual Replace mode Virtual Replace mode is similar to Replace mode, but instead of file characters you are replacing screen real estate.
es: Modo Reemplazar Virtual El modo Reemplazar Virtual es similar al modo Reemplazar, pero en lugar de reemplazar caracteres, reemplaza el estado real de la pantalla.

source: See |Virtual-Replace-mode|.
es: Consulte |Virtual-Replace-mode|.

source: If the 'showmode' option is on "-- VREPLACE --" is shown at the bottom of the window.
es: Si la opción 'showmode' está activada, verá «-- VREPLACE --» en la base de la ventana.

source: Insert Select mode Entered when starting Select mode from Insert mode.
es: Modo Seleccionar Se inicia al ejecutar el modo Seleccionar a partir de inserción del modo Insertar.

source: E.g., by dragging the mouse or <S-Right>.
es: Por ejemplo, arrastrando el ratón o <S-Derecha>.

source: When the Select mode ends, Vim returns to Insert mode.
es: Vim le devolverá al modo Insertar al finalizar el modo Seleccionar.

source: If the 'showmode' option is on "-- (insert) SELECT --" is shown at the bottom of the window.
es: Si la opción 'showmode' está activada, verá «-- (insert) SELECT --» en la base de la ventana.

source: Switching from mode to mode *mode-switching*
es: Cambiar de modo *cambiar-modo* *mode-switching*

source: *i_esc* TO mode ~ Normal Visual Select Insert Replace Cmd-line Ex ~ FROM mode ~ Normal v V ^V *4 *1 R gR : / ?
es: *i_esc* DESDE el modo ~ Normal Visual Selección Insertar Reemplazar Línea Ex ~ de órdenes A el modo ~ Normal v V ^V *4 *1¿ R gR : / ?

source: Q Visual *2 ^G c C -- : -- Select *5 ^O ^G *6 -- -- -- Insert <Esc> -- -- <Insert> -- -- Replace <Esc> -- -- <Insert> -- -- Command-line *3 -- -- :start -- -- Ex :vi -- -- -- -- --
es: Q Visual *2 ^G c C -- : -- Seleccionar *5 ^O ^G *6 -- -- -- Insertar <Esc> -- -- <Insertar> -- -- Reemplazar <Esc> -- -- <Insertar> -- -- Línea de órdenes *3 -- -- :start -- -- Ex :vi -- -- -- -- --

source: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* Additionally the command CTRL-\ CTRL-N or <C-\><C-N> can be used to go to Normal mode from any other mode.
es: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* De forma adicional, puede usar CTRL-\ CTRL-N o <C-\><C-N> para pasar al modo Normal a partir de cualquier otro.

source: This can be used to make sure Vim is in Normal mode, without causing a beep like <Esc> would.
es: Puede usar esto para asegurarse de que Vim está en modo Normal, sin causar el pitido que <Esc> realiza.

source: However, this does not work in Ex mode.
es: Por otra parte, esto no funciona en modo Ex.

source: When used after a command that takes an argument, such as |f| or |m|, the timeout set with 'ttimeoutlen' applies.
es: Si usa esto después de una orden que toma un argumento, como |f| o |m|, se aplicará la cuenta atrás definida con 'ttimeoutlen'.

source: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* The command CTRL-\ CTRL-G or <C-\><C-G> can be used to go to Insert mode when 'insertmode' is set.
es: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* La orden CTRL-\ CTRL-G o <C-\><C-G> se puede usar para pasar al modo Insertar cuando 'insertmode' está definido.

source: Otherwise it goes to Normal mode.
es: En caso contrario, vuelve al modo Normal.

source: This can be used to make sure Vim is in the mode indicated by 'insertmode', without knowing in what mode Vim currently is.
es: Puede usar esto para asegurarse de que Vim está en el modo indicado por 'insertmode', sin conocer el modo actual en el que está Vim.

source: The window contents *window-contents*
es: El contenido de las ventanas *ventanas-contenido* *window-contents*

source: In Normal mode and Insert/Replace mode the screen window will show the current contents of the buffer: What You See Is What You Get.
es: La ventana muestra los contenidos actuales del búfer en modo Normal y modo Insertar/Reemplazar: lo que ve es lo que hay.

source: There are two exceptions: - When the 'cpoptions' option contains '$', and the change is within one line, the text is not directly deleted, but a '$' is put at the last deleted character.
es: Hay dos excepciones: - Si la opción 'cppoptions' contiene «$», y el cambio se realizará dentro de una línea, el texto no se eliminará directamente, sino que se insertará «$» en el último carácter eliminado.

source: - When inserting text in one window, other windows on the same text are not updated until the insert is finished.
es: - Si inserta texto en una ventana, otras ventanas mostrando el mismo contenido no se actualizarán hasta finalizar la inserción.

source: {Vi: The screen is not always updated on slow terminals}
es: {Vi: La pantalla no se refrescará siempre en terminales lentas}

source: Lines longer than the window width will wrap, unless the 'wrap' option is off (see below).
es: Las líneas más largas que el ancho de la ventana se justificarán a menos que la opción 'wrap' esté desactivada (consulte a continuación).

source: The 'linebreak' option can be set to wrap at a blank character.
es: La opción 'linebreak' se puede configurar para justificar a partir de un carácter vacío.

source: +-----------------------+ |some line | |last line | |~ | |~ | +-----------------------+
es: +-----------------------+ |alguna línea | |última línea | |~ | |~ | +-----------------------+

source: +-----------------------+ |first line | |second line | |@ | |@ | +-----------------------+
es: +-----------------------+ |primera línea | |segunda línea | |@ | |@ | +-----------------------+

source: +-----------------------+ |first line | |second line | |a very long line that d| |oesn't fit in the wi@@@| +-----------------------+
es: +-----------------------+ |primera línea | |segunda línea | |una línea muy larga que| |no encaja en la vent@@@| +-----------------------+

source: If there is a single line that is too long to fit in the window, this is a special situation.
es: Una situación particular es cuando existe una sola línea que no encaja en la ventana.

source: Vim will show only part of the line, around where the cursor is.
es: Vim mostrará solo la parte de la línea en torno al cursor.

source: There are no special characters shown, so that you can edit all parts of this line.
es: No verá caracteres especiales, para que así pueda editar esa parte de la línea.

source: {Vi: gives an "internal error" on lines that do not fit in the window}
es: {Vi: devuelve un «error interno» en las líneas que no encajan en la ventana.}

source: The '@' occasion in the 'highlight' option can be used to set special highlighting for the '@' and '~' characters.
es: La aparición de «@» en la opción 'highlight' (resaltar) se puede usar para dar un resaltado especial a los caracteres «@» y «~».

source: This makes it possible to distinguish them from real characters in the buffer.
es: Esto posibilita distinguirlos de aquellos caracteres reales en el búfer.

source: All normal ASCII characters are displayed directly on the screen.
es: Todos los caracteres normales ASCII aparecerán directamente en la pantalla.

source: The <Tab> is replaced with the number of spaces that it represents.
es: La tecla <Tab> será reemplazada por el número de espacios que representa.

source: Other non-printing characters are replaced with "^{char}", where {char} is the non-printing character with 64 added.
es: Otros caracteres no imprimibles se reemplazarán por «^{char}», donde {char} es el carácter no imprimible más la suma de 64.

source: Thus character 7 (bell) will be shown as "^G".
es: Por ello, el carácter 7 (campana) aparecerá como «^G».

source: Characters between 127 and 160 are replaced with "~{char}", where {char} is the character with 64 subtracted.
es: Los caracteres entre el 127 y el 160 serán reemplazados por «~{char}», donde {char} es el carácter menos la resta de 64.

source: These characters occupy more than one position on the screen.
es: Estos caracteres tomarán más de un espacio en la pantalla.

source: The cursor can only be positioned on the first one.
es: El cursor sólo aparecerá sobre el primero.

source: If you set the 'number' option, all lines will be preceded with their number.
es: Si activa la opción 'number', todas las líneas estarán precedidas por su número.

source: Tip: If you don't like wrapping lines to mix with the line numbers, set the 'showbreak' option to eight spaces: ":set showbreak=\ \ \ \ \ \ \ \ "
es: Consejo: Si no le gusta que el justificado de línea se mezcle con los números de línea, configure la opción 'showbreak' con 8 espacios: «:set showbreak=\ \ \ \ \ \ \ \ »

source: If you set the 'list' option, <Tab> characters will not be shown as several spaces, but as "^I".
es: Los caracteres <Tab> aparecerán como ^I, en lugar de como varios espacios, en caso de activar la opción 'list'.

source: A '$' will be placed at the end of the line, so you can find trailing blanks.
es: Se insertará un «$» al final de la línea para así poder encontrar caracteres en exceso al final de la línea.

source: In Command-line mode only the command-line itself is shown correctly.
es: En el modo Línea de órdenes, sólo la misma línea de órdenes se mostrará correctamente.

source: The display of the buffer contents is updated as soon as you go back to Command mode.
es: La vista de los contenidos del búfer se actualizarán tan pronto como vuelva al modo de órdenes.

source: The last line of the window is used for status and other messages.
es: La última línea de la ventana se usa para mostrar el estado y otros mensajes.

source: The status messages will only be used if an option is on:
es: Sólo se mostrarán los mensajes de estado si activa una opción:

source: The current mode is "-- INSERT --" or "-- REPLACE --", see |'showmode'|.
es: El modo actual es «-- INSERT --» o «-- REPLACE --», consulte |'showmode|.

source: The command characters are those that you typed but were not used yet.
es: Los caracteres de la orden son aquellos que tecleó pero que aún no ha ejectuado.

source: {Vi: does not show the characters you typed or the cursor position}
es: {Vi: no muestra los caracteres que ha introducido, o la posición del cursor.}

source: If you have a slow terminal you can switch off the status messages to speed up editing: :set nosc noru nosm
es: Puede desactivar los mensajes de estado para agilizar la edición si tiene una terminal lenta: :set nosc noru nosm

source: If there is an error, an error message will be shown for at least one second (in reverse video).
es: En caso de error, verá un mensaje de error durante al menos un segundo (en vídeo inverso).

source: {Vi: error messages may be overwritten with other messages before you have a chance to read them}
es: {Vi: puede que los mensajes de error sean sobreescritos antes de poder leerlos.}

source: Some commands show how many lines were affected.
es: Algunas órdenes muestran cuantas líneas fueron afectadas.

source: Above which threshold this happens can be controlled with the 'report' option (default 2).
es: Puede controlar el umbral a partir del cual esto ocurre con la opción 'report' (2 por omisión).

source: On the Amiga Vim will run in a CLI window.
es: Vim se ejecutará en una ventana CLI bajo Amiga.

source: The name Vim and the full name of the current file name will be shown in the title bar.
es: El nombre «Vim» y el nombre completo del archivo aparecerán en la barra de título.

source: When the window is resized, Vim will automatically redraw the window.
es: Vim redibujará la ventana en caso de redimensionarla.

source: You may make the window as small as you like, but if it gets too small not a single line will fit in it.
es: Puede reducir la ventana tanto como quiera, pero no cabrá ni una línea en caso de reducirla demasiado.
