Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: If you don't want this (e.g. when using gvim for a mail program that waits for gvim to exit), start gvim with "gvim -f", "vim -gf" or use ":gui -f".
es: Si no desea esto, (p. ej., cuando usa gvim para un programa de correo que espera a que gvim se cierre), inicie gvim con «gvim -f», «vim -gf» o use «:gui -f».

source: Don't use "vim -fg", because "-fg" specifies the foreground color.
es: No use «vim -fg» porque «-fg» especifica el color en primer plano.

source: When using "gvim -f" and then ":gui", Vim will run in the foreground.
es: Si usa «gvim -f», y después «:gui», Vim se ejectuará en primer plano.

source: The "-f" argument will be remembered.
es: El argumento «-f» se recordará.

source: To force running Vim in the background use ":gui -b".
es: Para forzar que Vim se inicie de fondo, use «gui -b».

source: If you want the GUI to run in the foreground always, include the 'f' flag in 'guioptions'.
es: Si desea que la IGU siempre se ejecute en primer plano, incluya la marca «f» en 'guioptions'.

source: GUI Resources *gui-resources* *.Xdefaults*
es: Recursos de la IGU *gui-resources* *.Xdefaults*

source: If using the Motif or Athena version of the GUI (not for the KDE, GTK+ or Win32 version), a number of X resources are available.
es: En caso de que este usando la versión Motif o Athena de la IGU (no la versión de KDE, GTK+ o Win32), no dispondrá de una serie de recursos.

source: You should use Vim's class "Vim" when setting these.
es: Debería usar la clase de Vim «Vim» cuando define esto.

source: They are as follows:
es: Son como sigue:

source: Resource name Meaning ~
es: Nombre del recurso Significado ~

source: reverseVideo Boolean: should reverse video be used?
es: reverseVideo Boolean: ¿Se debe usar el vídeo inverso?

source: background Color of background.
es: background Color del fondo.

source: foreground Color of normal text.
es: foreground Color del texto normal.

source: scrollBackground Color of trough portion of scrollbars.
es: scrollBackground Color de la porción pilón de las barras de desplazamiento.

source: scrollForeground Color of slider and arrow portions of scrollbars.
es: scrollForeground Color de la barra y las porciones de flecha de las barras desplazamiento.

source: menuBackground Color of menu backgrounds.
es: menuBackground Color de fondo del menú.

source: menuForeground Color of menu foregrounds.
es: menuForeground Color de primer plano del menú.

source: tooltipForeground Color of tooltip and balloon foreground.
es: tooltipForeground Color de primer plano de las sugerencias y de los globos.

source: tooltipBackground Color of tooltip and balloon background.
es: tooltipBackground Color de fondo de las sugerencias y de los globos.

source: *gui.txt* For Vim version 7.2.
es: *gui.txt* Para Vim version 7.2.

source: Starting the GUI |gui-start| 2.
es: Iniciar la GUI |gui-start| 2.

source: Scrollbars |gui-scrollbars| 3.
es: Barras de desplazamiento |gui-scrollbars| 3.

source: Mouse Control |gui-mouse| 4.
es: Control del ratón |gui-mouse| 4.

source: Making GUI Selections |gui-selections| 5.
es: Seleccionar en la GUI |gui-selections| 5.

source: Menus |menus| 6.
es: Menús |menus| 6.

source: Shell Commands |gui-shell|
es: Órdenes de consola |gui-shell|

source: Other GUI documentation: |gui_x11.txt| For specific items of the X11 GUI.
es: Más documentación de la GUI: |gui_x11.txt| Para elementos específicos de la GUI bajo X11.

source: |gui_w32.txt| For specific items of the Win32 GUI.
es: |gui_w32.txt| Para elementos específicos de la GUI bajo Win32.

source: Starting the GUI *gui-start* *E229* *E233*
es: Iniciar la GUI *gui-start* *E229* *E233*

source: First you must make sure you actually have a version of Vim with the GUI code included.
es: Asegúrese primero de que realmente tiene una versión de Vim con el código de la GUI integrado.

source: You can check this with the ":version" command, it says "with xxx GUI", where "xxx" is X11-Motif, X11-Athena, Photon, GTK, GTK2, etc., or "MS-Windows 32 bit GUI version".
es: Puede revisar esto con la orden :version, el cual devuelve «con GUI xxx», donde «xxx» puede ser X11-Motif, X11-Athena, Photon, GTK, GTK2, etc... o «versión GUI MS-Windows 32 bit».

source: How to start the GUI depends on the system used.
es: Como iniciar la interfaz gráfica depende del sistema que se usa.

source: Mostly you can run the GUI version of Vim with: gvim [options] [files...]
es: Generalmente, puede iniciar la versión GUI de Vim con: gvim [opciones] [archivos...]

source: The X11 version of Vim can run both in GUI and in non-GUI mode.
es: La versión X11 de Vim puede ejecutarse en modo gráfico o no.

source: See |gui-x11-start|.
es: Véase |gui-x11-start|.

source: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* The gvimrc file is where GUI-specific startup commands should be placed.
es: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* El archivo gvimrc es donde debe escribir las órdenes de inicio específicos de la GUI.

source: It is always sourced after the |vimrc| file.
es: Siempre se lee después del archivo |vimrc|.

source: If you have one then the $MYGVIMRC environment variable has its name.
es: Si tiene uno, la variable de entorno $MYGVIMRC llevará su tal nombre.

source: All this happens AFTER the normal Vim initializations, like reading your .vimrc file.
es: Todo esto ocurre despues de las órdenes de inicio de Vim, como si leyese el archivo «.vimrc».

source: See |initialization|.
es: Véase |initialization|.

source: But the GUI window is only opened after all the initializations have been carried out.
es: La ventana de la interfaz gráfica solo se abre después de llevar a cabo todas las órdenes de inicio.

source: If you want some commands to be executed just after opening the GUI window, use the |GUIEnter| autocommand event.
es: Si desea que alguna orden se ejecute justo después de abrir la ventana de la interfaz gráfica, use el evento de autorden |GUIEvent|.

source: Example: > :autocmd GUIEnter * winpos 100 50
es: Ejemplo: > :autocmd GUIEnter * winpos 100 50

source: There are a number of options which only have meaning in the GUI version of Vim.
es: Hay un número de opciones que solo tienen efecto en la versión GUI de Vim.

source: These are 'guicursor', 'guifont', 'guipty' and 'guioptions'.
es: Estos son 'guicursor', 'guifont', 'guipty' y 'guioptions'.

source: They are documented in |options.txt| with all the other options.
es: Están documentadas en |options.txt|, junto con el resto de opciones.

source: *usr_26.txt* For Vim version 7.3.
es: *usr_26.esx* Para Vim versión 7.3.

source: Repeating
es: Repetición

source: An editing task is hardly ever unstructured.
es: Rara vez, una tarea de edición carece de estructura.

source: A change often needs to be made several times.
es: A menudo tiene que realizar un cambio varias veces.

source: In this chapter a number of useful ways to repeat a change will be explained.
es: En este capítulo se muestran varias maneras útiles de repetir un cambio.

source: |26.1| Repeating with Visual mode |26.2| Add and subtract |26.3| Making a change in many files |26.4| Using Vim from a shell script
es: |26.1| Repetir en modo Visual |26.2| Sumar y restar |26.3| Realizar un cambio en varios archivos |26.4| Usar Vim desde un script de intérprete de órdenes

source: Next chapter: |usr_27.txt| Search commands and patterns Previous chapter: |usr_25.txt| Editing formatted text Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_27.esx| Órdenes y patrones de búsqueda Capitulo anterior: |usr_24.esx| Editar otros archivos Tabla de contenidos: |usr_toc.esx|

source: *26.1* Repeating with Visual mode
es: *26.1* Repetición en modo Visual

source: Visual mode is very handy for making a change in any sequence of lines.
es: El modo Visual es útil cuando desea modificar una secuencia de líneas.

source: You can see the highlighted text, thus you can check if the correct lines are changed.
es: Al poder ver el texto resaltado, puede revisar si las líneas a modificar lo han sido correctamente.

source: But making the selection takes some typing.
es: Pero hacer la selección conlleva teclear.

source: The "gv" command selects the same area again.
es: La orden «gv» selecciona la misma área otra vez.

source: This allows you to do another operation on the same text.
es: Esto le permite realizar otra acción sobre el texto seleccionado.

source: Suppose you have some lines where you want to change "2001" to "2002" and "2000" to "2001":
es: Suponga que tiene algunas líneas en las que desea cambiar «2001» a «2002» y «2000» a «2001»:

source: The financial results for 2001 are better ~ than for 2000.
es: Los resultados financieros de 2001 son mejores ~ que para el año 2000.

source: First change "2001" to "2002".
es: Primero cambie «2001» a ««2002».

source: Select the lines in Visual mode, and use: >
es: Seleccione las líneas en modo Visual y use: >

source: Now use "gv" to reselect the same text.
es: Use ahora «gv» para seleccionar otra vez el mismo texto.

source: It doesn't matter where the cursor is.
es: No importa donde está el cursor.

source: Then use ":s/2000/2001/g" to make the second change.
es: Use entonces «:s/2000/2001/g» para hacer el segundo cambio.

source: Obviously, you can repeat these changes several times.
es: Obviamente, puede repetir estos cambios varias veces.

source: *26.2* Add and subtract
es: *26.2* Sumar y restar

source: Now press CTRL-A.
es: Ahora pulse Ctrl-A.

source: The year will be increased by one:
es: El año se incrementará en uno:

source: The financial results for 2002 are better ~ than for 2000.
es: Los resultados financieros de 2002 son mejores ~ que para el año 2000.

source: Adding more than one can be done by prepending the number to CTRL-A.
es: Es posible añadir más de uno si prefija un número a CTRL-A.

source: Suppose you have this list:
es: Suponga que tiene esta lista:

source: item four ~ 2.
es: cuarto elemento ~ 2.

source: item five ~ 3.
es: quinto elemento ~ 3.

source: item six ~
es: sexto elemento ~

source: The "1." will change to "4.".
es: El «1.» pasará a ser «4.».

source: Again, you can use "." to repeat this on the other numbers.
es: Otra vez, puede usar «.» para repetir la misma acción sobre otros números.

source: 7 plus one is 10?
es: ¿7 más 1 igual a 10?

source: What happened here is that Vim recognized "007" as an octal number, because there is a leading zero.
es: Lo que ha ocurrido es que Vim reconoció 007 como un número octal, ya que hay un cero precediendo el número.

source: This notation is often used in C programs.
es: Esta notación se usa a menudo en programas C.

source: If you do not want a number with leading zeros to be handled as octal, use this: >
es: Si no desea que un número con ceros a la izquierda se considere un número octal, use lo siguiente: >

source: *26.3* Making a change in many files
es: *26.3* Realizar un cambio en varios archivos

source: :args *.c < This finds all C files and edits the first one.
es: :args *.c < Esto encuentra todos los archivos C y edita el primero.

source: Now you can perform a substitution command on all these files: >
es: Ahora puede realizar una orden de sustitución sobre todos estos archivos: >

source: The ":argdo" command takes an argument that is another command.
es: La orden «:argdo» toma otra orden como argumento.

source: That command will be executed on all files in the argument list.
es: Esta orden se ejecutará sobre todos los archivos en la lista de argumentos.

source: The "%s" substitute command that follows works on all lines.
es: La orden de sustitución «%s» a continuación afecta a todas las líneas.

source: It finds the word "x_cnt" with "\<x_cnt\>".
es: Busca la palabra «x_cnt» con «\<x_cnt\>».

source: The "\<" and "\>" are used to match the whole word only, and not "px_cnt" or "x_cnt2".
es: Los «\<» y «\>» se usan para encontrar sólo la palabra completa, y no «px_cnt» o «x_cnt2».

source: The flags for the substitute command include "g" to replace all occurrences of "x_cnt" in the same line.
es: Las opciones para la orden de sustitución incluyen «g» para reemplazar todas las apariciones de «x_cnt» en la misma línea.

source: The "e" flag is used to avoid an error message when "x_cnt" does not appear in the file.
es: La opción «e» se emplea para evitar un mensaje de error cuando «x_cnt» no está presente en el archivo.

source: Otherwise ":argdo" would abort on the first file where "x_cnt" was not found.
es: En caso contrar, «:argdo» se interrumpiría en el primer archivo en el que no se encontrase «x_cnt».

source: The "|" separates two commands.
es: La «|» separa dos órdenes.

source: The following "update" command writes the file only if it was changed.
es: La orden a continuación «update» escribe en el archivo sólo si éste cambió.

source: If no "x_cnt" was changed to "x_counter" nothing happens.
es: Si no se cambió ningún «x_cnt» a «x_counter» no ocurrirá nada.

source: There is also the ":windo" command, which executes its argument in all windows.
es: También dispone de la orden «:windo», que ejecuta su argumento en todas las ventanas.

source: And ":bufdo" executes its argument on all buffers.
es: «:bufdo» ejecuta su argumento en todos los búfers.

source: Be careful with this, because you might have more files in the buffer list than you think.
es: Sea cuidadoso con esto, porque puede que tenga más archivos de los que crea en su lista de búfers.

source: Check this with the ":buffers" command (or ":ls").
es: Revise esto con la orden «:buffers» (o «:ls»).

source: *26.4* Using Vim from a shell script
es: *26.4* Usar Vim desde un script de intérprete de órdenes

source: Suppose you have a lot of files in which you need to change the string "-person-" to "Jones" and then print it.
es: Suponga que tiene que cambiar la cadena «-persona-» a «Juan» en varios archivos, e imprimirlo después.

source: How do you do that?
es: ¿Como se hace?

source: One way is to do a lot of typing.
es: Una manera es teclear mucho.

source: The other is to write a shell script to do the work.
es: La otra es escribir un script de consola para hacer la tarea.

source: The Vim editor does a superb job as a screen-oriented editor when using Normal mode commands.
es: El editor Vim realiza un trabajo superlativo como un editor orientado a pantalla cuando usa las órdenes de modo Normal.

source: For batch processing, however, Normal mode commands do not result in clear, commented command files; so here you will use Ex mode instead.
es: Para un procesamiento en lotes, por otra parte, las órdenes de modo Normal no finalizan correctamente como archivos claros y comentados; para ello tiene que usar el modo Ex.

source: This mode gives you a nice command-line interface that makes it easy to put into a batch file.
es: Este modo ofrece una bonita interfaz de línea de órdenes que facilita su inserción en un archivo de lotes.

source: ("Ex command" is just another name for a command-line (:) command.) The Ex mode commands you need are as follows: >
es: («Orden Ex» es sólo otro nombre para una orden en la línea de órdenes («:»).) Las órdenes del modo Ex que necesita son las siguientes: >

source: %s/-person-/Jones/g write tempfile quit
es: %s/-persona-/Juan/g write archivo_temporal quit

source: You put these commands in the file "change.vim".
es: Ponga estas órdenes en el archivo «change.vim».

source: Now to run the editor in batch mode, use this shell script: >
es: Para ejecutar el editor en modo de lotes, ese este script de consola: >

source: for file in *.txt; do vim -e -s $file < change.vim lpr -r tempfile done
es: for file in *.txt; do vim -e -s $file < change.vim lpr -r archivo_temporal done

source: The for-done loop is a shell construct to repeat the two lines in between, while the $file variable is set to a different file name each time.
es: El bucle for-done es una construcción de consola para repetir las dos líneas entre ellas, mientras que la variable $file es definida con un nombre diferente cada vez.

source: The second line runs the Vim editor in Ex mode (-e argument) on the file $file and reads commands from the file "change.vim".
es: La segunda línea inicia Vim en modo Ex (argumento «-e») en el archivo $file y lee las órdenes del archivo «change.vim».

source: The -s argument tells Vim to operate in silent mode.
es: El argumento «-s» le dice a Vim que opere en modo silencioso.

source: In other words, do not keep outputting the :prompt, or any other prompt for that matter.
es: En otras palabras, no mostrar «:prompt» (cuadro de diálogo interactivo), o cualquier otro diálogo.

source: The "lpr -r tempfile" command prints the resulting "tempfile" and deletes it (that's what the -r argument does).
es: La orden «lpr -r archivo_temporal» muestra el «archivo_temporal» resultante y lo elimina (esto es lo que hace el argumento «-r»).

source: Vim can read text on standard input.
es: Vim puede leer texto desde la entrada estándar.

source: Since the normal way is to read commands there, you must tell Vim to read text instead.
es: Debido a que esta es la manera normal de leer órdenes, tendrá que decirle a Vim que lea texto.

source: This is done by passing the "-" argument in place of a file.
es: Esto se hace introduciendo el argumento «-» en lugar de un archivo.

source: This allows you to edit the output of the "ls" command, without first saving the text in a file.
es: Esto permite editar la salida de la orden «ls», sin guardar primero el texto en un archivo.

source: If you use the standard input to read text from, you can use the "-S" argument to read a script: >
es: Si usa la entrada estándar para leer texto, puede usar el argumento «-S» para leer un script: >

source: < Note: "-s" has a different meaning when it is used without "-e".
es: < Nota: «-s» tiene un significado diferente cuando se usa sin «-e».

source: Here it means to source the "script" as Normal mode commands.
es: Aquí significa que tiene que cargar el script como si fueran órdenes de modo Normal.

source: When used with "-e" it means to be silent, and doesn't use the next argument as a file name.
es: «-e» significa modo silencioso, y no usa el siguiente argumento como un nombre de archivo.

source: The commands in "script" are executed like you typed them.
es: Las órdenes en «script» se ejecutan como los introdujo.

source: Don't forget that a line break is interpreted as pressing <Enter>.
es: No olvide que un salto de línea se interpreta como <Intro>.

source: In Normal mode that moves the cursor to the next line.
es: En modo Normal, desplaza el cursor a la siguiente línea.

source: To create the script you can edit the script file and type the commands.
es: Para crear el script, puede editar el archivo de script y teclear las órdenes.

source: You need to imagine what the result would be, which can be a bit difficult.
es: Necesita imaginar el resultado final, lo cual es un poco difícil.

source: Another way is to record the commands while you perform them manually.
es: Otra manera es grabar las órdenes al ejecutarlas manualmente.

source: This is how you do that: >
es: Así es como se hace: >

source: *usr_01.txt* For Vim version 7.3.
es: *usr_01.esx* Para Vim versión 7.3.

source: Last change: 2008 May 07
es: Último cambio: 7/6/2008

source: About the manuals
es: Acerca de los manuales

source: This chapter introduces the manuals available with Vim.
es: Este capítulo le introduce a los manuales disponibles con Vim.

source: Read this to know the conditions under which the commands are explained.
es: Lea esto para conocer las condiciones bajo las cuales se explican las órdenes.

source: |01.1| Two manuals |01.2| Vim installed |01.3| Using the Vim tutor |01.4| Copyright
es: |01.1| Dos manuales |01.2| Vim instalado |01.3| Usar el tutor de Vim |01.4| Copyright

source: Next chapter: |usr_02.txt| The first steps in Vim Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_02.esx| Primeros pasos en Vim Tabla de contenidos: |usr_toc.esx|

source: *01.1* Two manuals
es: *01.1* Dos manuales

source: The User manual Task oriented explanations, from simple to complex.
es: El manual de usuario Explicaciones orientadas a tareas, de las simples a las más complejas.

source: Reads from start to end like a book.
es: Se puede leer de principio a fin, como un libro.

source: The Reference manual Precise description of how everything in Vim works.
es: El manual de referencia Una precisa descripción del funcionamiento de cada elemento dentro de Vim.

source: The text contains hyperlinks between the two parts, allowing you to quickly jump between the description of an editing task and a precise explanation of the commands and options used for it.
es: El texto contiene hiperenlaces entre las dos partes, lo cual le permite saltar rápidamente de la descripción de una tarea de edición a una precisa explicación de las órdenes y opciones que se emplean.

source: Use these two commands:
es: Use estas dos órdenes:

source: Press CTRL-] to jump to a subject under the cursor.
es: Pulse «CTRL-]» para saltar al tema bajo el cursor.

source: Press CTRL-O to jump back (repeat to go further back).
es: Pulse «CTRL-O» para saltar atrás (repita para volver más allá de ese punto).

source: Many links are in vertical bars, like this: |bars|.
es: Hay varios enlaces entre barras verticales, como este: |bars|.

source: An option name, like 'number', a command in double quotes like ":write" and any other word can also be used as a link.
es: También puede usar como enlace un nombre de opción, como 'number', una orden entrecomillada, como «:write», o cualquier otra palabra.

source: Try it out: Move the cursor to CTRL-] and press CTRL-] on it.
es: Pruebelo: mueva el cursor a «CTRL-]» y pulse «CTRL-]» sobre él.

source: *01.2* Vim installed
es: *01.2* Vim instalado

source: If you start Vim now, the 'compatible' option should be off.
es: Si inicia ahora Vim, la opción 'compatible' debería estar desactivada.

source: You can check it with this command: >
es: Puede asegurarse con esta orden: >

source: If it responds with "nocompatible" you are doing well.
es: Si devuelve "nocompatible", es que todo va bien.

source: If the response is "compatible" you are in trouble.
es: Si la respuesta es «compatible», tiene un problema.

source: You will have to find out why the option is still set.
es: Tendrá que encontrar porqué esta opción está aún definida.

source: Perhaps the file you wrote above is not found.
es: Puede que no se encontrase el archivo que copió antes.

source: Use this command to find out: >
es: Use esta orden para ver el problema: >

source: If your file is not in the list, check its location and name.
es: Si su archivo no se encuentra en la lista, revise su nombre y ubicación.

source: If it is in the list, there must be some other place where the 'compatible' option is switched back on.
es: Si está en la lista, debe haber algún otro sitio en el que se reactiva la opción 'compatible'.

source: Note: This manual is about using Vim in the normal way.
es: Nota: Este manual trata acerca del uso de Vim de la manera normal.

source: There is an alternative called "evim" (easy Vim).
es: Existe una alternativa llamada «evim» (easy Vim).

source: This is still Vim, but used in a way that resembles a click-and-type editor like Notepad.
es: Sigue siendo Vim, pero se usa de una manera parecida a un editor como Notepad.

source: It always stays in Insert mode, thus it feels very different.
es: Permanece siempre en el modo Insertar, y por ello parece muy distinto.

source: It is not explained in the user manual, since it should be mostly self explanatory.
es: No se explica en el manual de usuario, ya que es bastante sencillo.

source: See |evim-keys| for details.
es: Véase |evim-keys| para más detalles.

source: *01.3* Using the Vim tutor *tutor* *vimtutor*
es: *01.3* Usar el tutor de Vim *tutor* *vimtutor*
