Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Note: The digraphs depend on the character set that Vim assumes you are using. On MS-DOS they are different from MS-Windows. Always use ":digraphs" to find out which digraphs are currently available.
es: Nota: Los dígrafos dependen del juego de caracteres que Vim asume que está usando. En MS-DOS difieren con los de MS-Windows. Use siempre «:digraphs» para ver de qué dígrafos dispone.

source: You can define your own digraphs. Example: >
es: Puede configurar sus propios dígrafos. Ejemplo: >

source: More information about digraphs here: |digraphs| Another way to insert special characters is with a keymap. More about that here: |45.5|
es: Para más información acerca de los dígrafos, consulte: |digraphs| Otra manera de insertar caracteres especiales es un «keymap». Puede leer más acerca de esto aquí: |45.5|

source: *24.10* Normal mode commands
es: *24.10* Órdenes del modo Normal

source: Insert mode offers a limited number of commands. In Normal mode you have many more. When you want to use one, you usually leave Insert mode with <Esc>, execute the Normal mode command, and re-enter Insert mode with "i" or "a". There is a quicker way. With CTRL-O {command} you can execute any Normal mode command from Insert mode. For example, to delete from the cursor to the end of the line: >
es: El modo Insertar ofrece un limitado número de órdenes. Dispone de muchas más en el modo normal. Si desea usar uno, abandone el modo Insertar con <Esc>, ejecuto la orden en modo Normal, y vuelva al modo Insertar con «i» o «a». Hay una manera más rápida. Con CTRL-O {orden} puede ejecutar cualquier orden de modo Normal en el modo Insertar. Por ejemplo, para eliminar desde el cursor hasta el final de la línea: >

source: You can execute only one Normal mode command this way. But you can specify a register or a count. A more complicated example: >
es: Sólo puede ejecutar una orden de modo Normal de esta manera. Pero puede especificar un registro o cuenta. Aquí tiene una manera más complicada: >

source: VIM USER MANUAL - by Bram Moolenaar
es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: *usr_10.txt* For Vim version 7.3.
es: *usr_10.esx* Para Vim versión 7.3.

source: Last change: 2006 Nov 05
es: Último cambio: 5/11/2006

source: Making big changes
es: Realizar grandes cambios

source: In chapter 4 several ways to make small changes were explained.
es: En el capítulo 4 se explicaron algunas formas de hacer cambios pequeños.

source: This chapter goes into making changes that are repeated or can affect a large amount of text.
es: Este capítulo tratará de cambios que se repiten o que afectan a grandes porciones del texto.

source: The Visual mode allows doing various things with blocks of text.
es: El modo Visual permite hacer varias cosas con bloques de texto.

source: Use an external program to do really complicated things.
es: Use un programa externo para hacer las cosas más complicadas.

source: |10.1| Record and playback commands |10.2| Substitution |10.3| Command ranges |10.4| The global command |10.5| Visual block mode |10.6| Reading and writing part of a file |10.7| Formatting text |10.8| Changing case |10.9| Using an external program
es: |10.1| Órdenes de grabación y reproducción |10.2| Sustitución |10.3| Rangos de aplicación |10.4| Las órdenes globales |10.5| El modo de bloque Visual |10.6| Leer y escribir parte de un archivo |10.7| Formatear texto |10.8| Cambiar mayúsculas y minúsculas |10.9| Uso de un programa externo

source: Next chapter: |usr_11.txt| Recovering from a crash Previous chapter: |usr_09.txt| Using the GUI Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_11.esx| Recuperarse de un fallo Capítulo anterior: |usr_09.esx| Uso de la interfaz gráfica Tabla de contenidos: |usr_toc.esx|

source: *10.1* Record and playback commands
es: *10.1* Órdenes de grabación y reproducción

source: The "." command repeats the preceding change.
es: La orden «.» repite el cambio precedente.

source: But what if you want to do something more complex than a single change?
es: ¿Pero qué ocurre si quiere hacer algo más complicado que un simple cambio?

source: That's where command recording comes in.
es: Para eso tenemos la orden de grabación («:recording»).

source: There are three steps:
es: Hay que seguir tres pasos:

source: The "q{register}" command starts recording keystrokes into the register named {register}.
es: La orden «q{registro}» inicia la grabación de teclas pulsadas en un registro llamado{registro}.

source: The register name must be between a and z. 2.
es: El nombre del registro debe estar en el rango (a-z). 2.

source: Type your commands. 3.
es: Introduzca sus órdenes. 3.

source: To finish recording, press q (without any extra character).
es: Pulse q para detener la grabación (sin ningún carácter adicional).

source: Take a look at how to use these commands in practice.
es: Vamos a echarle un vistazo a cómo se usan las órdenes en la práctica.

source: You have a list of filenames that look like this:
es: Tiene una lista de nombres de archivo como esta:

source: You start by moving to the first character of the first line.
es: Comienza desplazándose al primer carácter de la primera línea.

source: Next you execute the following commands:
es: A continuación ejecute la siguiente orden:

source: qa Start recording a macro in register a.
es: qa Comenzar a grabar la macro en el registro «a».

source: ^ Move to the beginning of the line.
es: ^ Ir al comienzo de la línea.

source: i#include "<Esc> Insert the string #include " at the beginning of the line.
es: i#include "<Esc> Insertar el #include " al comienzo de cada línea.

source: $ Move to the end of the line.
es: $ Ir al final de la línea.

source: a"<Esc> Append the character double quotation mark (") to the end of the line.
es: a"<Esc> Añadir el carácter de comillas dobles (") al final de la línea.

source: j Go to the next line.
es: j Ir a la próxima línea.

source: q Stop recording the macro.
es: q Detener la grabación de la macro.

source: Now that you have done the work once, you can repeat the change by typing the command "@a" three times.
es: Ahora que ha realizado el trabajo una vez, puede repetir el cambio tecleando la orden «@a» tres veces.

source: The "@a" command can be preceded by a count, which will cause the macro to be executed that number of times.
es: La orden «@a» puede venir precedido de un multiplicador, el cuál causará que la macro se ejecute ese número determinado de veces.

source: In this case you would type: >
es: En este caso: >

source: You might have the lines you want to change in various places.
es: Tal vez tenga las líneas que quiere cambiar en varios lugares.

source: Just move the cursor to each location and use the "@a" command.
es: Simplemente mueva el cursor a cada ubicación y use la orden «@a».

source: If you have done that once, you can do it again with "@@".
es: Si ha hecho eso una vez, puede repetirlo con «@@».

source: That's a bit easier to type.
es: Es un poco más sencillo de teclear.

source: If you now execute register b with "@b", the next "@@" will use register b.
es: Si ejecuta el registro b con «@b», el próximo «@@» usará el registro b.

source: If you compare the playback method with using ".", there are several differences.
es: Si compara esto con el método «.», hay varias diferencias.

source: First of all, "." can only repeat one change.
es: Lo primero, «.x sólo puede repetir un cambio.

source: As seen in the example above, "@a" can do several changes, and move around as well.
es: Como ha podido ver en el ejemplo de arriba, «@a» puede llevar a cabo varios cambios, incluyendo movimientos.

source: Secondly, "." can only remember the last change.
es: Por otro lado, «.» sólo puede recordar el último cambio.

source: Executing a register allows you to make any changes and then still use "@a" to replay the recorded commands.
es: Ejecutar un registro le permite hacer algunos cambios en el texto y poder usar todavía las órdenes grabadas.

source: Finally, you can use 26 different registers.
es: Por último, puede usar 26 registros distintos.

source: Thus you can remember 26 different command sequences to execute.
es: De este modo puede reusar 26 secuencias diferentes.

source: The registers used for recording are the same ones you used for yank and delete commands.
es: Los registros que se usan para grabar son los mismos que se usan para las órdenes de copiar y eliminar.

source: This allows you to mix recording with other commands to manipulate the registers.
es: Esto le permite mezclar la grabación con otras órdenes para manipular los registros.

source: Suppose you have recorded a few commands in register n.
es: Suponga que ha grabado algunas órdenes en el registro n.

source: When you execute this with "@n" you notice you did something wrong.
es: Cuando lo ejecuta con «@n», se da cuenta de que algo no va bien.

source: You could try recording again, but perhaps you will make another mistake.
es: Podría intentar grabarlo de nuevo, pero quizá cometa otro error.

source: Instead, use this trick:
es: Mejor usar este truco:

source: Now you can execute the corrected commands with "@n".
es: Ahora puede ejecutar las órdenes corregidas con «@n».

source: (If your recorded commands include line breaks, adjust the last two items in the example to include all the lines.)
es: (Si las órdenes grabadas incluyen saltos de línea, ajuste los dos últimos puntos explicados anteriormente para incluir todas las líneas.)

source: So far we have used a lowercase letter for the register name.
es: Hasta el momento hemos usado letras en minúscula para el nombre del registro.

source: To append to a register, use an uppercase letter.
es: Para añadir a un registro, use una letra en mayúscula.

source: Suppose you have recorded a command to change a word to register c.
es: Suponga por un momento que ha grabado una orden para cambiar una palabra en el registro c.

source: It works properly, but you would like to add a search for the next word to change.
es: Funciona correctamente, pero quisiera añadir una búsqueda para la siguiente palabra a cambiar.

source: This can be done with: >
es: Esto se puede hacer así: >

source: qC/word<Enter>q
es: qC/palabra<Entrar>q

source: You start with "qC", which records to the c register and appends.
es: Comience con «qC», que añadirá al registro c.

source: Thus writing to an uppercase register name means to append to the register with the same letter, but lowercase.
es: De este modo siempre podrá escribir el registro al que quieras añadir nuevos pasos mediante la misma de letra de identificación, pero en mayúscula.

source: This works both with recording and with yank and delete commands.
es: Esto funciona tanto grabando como y con las órdenes de copiar y eliminar.

source: For example, you want to collect a sequence of lines into the a register.
es: Por ejemplo, quieres reunir una secuencia de líneas en un registro.

source: Yank the first line with: >
es: Copie la primera línea con: >

source: Repeat this command for all lines.
es: Repita la orden para todas las líneas.

source: The a register now contains all those lines, in the order you yanked them.
es: El registro «a» contiene ahora todas estas líneas, en el orden en el que las ha copiado.

source: *10.2* Substitution *find-replace*
es: *10.2* Sustitución

source: The ":substitute" command enables you to perform string replacements on a whole range of lines.
es: La orden «:substitute» le permite ejecutar sustituciones de cadenas de caracteres en un rango de líneas.

source: The general form of this command is as follows: >
es: La forma general es la siguiente: >

source: :[range]substitute/from/to/[flags]
es: :[rango]substitute/de/a/[opciones]

source: This command changes the "from" string to the "to" string in the lines specified with [range].
es: Esta orden cambia la cadena «de» por la cadena «a» en las líneas especificadas con [rango].

source: For example, you can change "Professor" to "Teacher" in all lines with the following command: >
es: Por ejemplo, puede cambiar «profesor» por «maestro» en todas las líneas con la siguiente orden: >

source: :%substitute/Professor/Teacher/ < Note: The ":substitute" command is almost never spelled out completely.
es: :%substitute/profesor/maestro/ < Nota: La orden «:substitute» casi nunca se escribe completamente.

source: Most of the time, people use the abbreviated version ":s".
es: La mayoría de las veces la gente escribe la versión abreviada ":s".

source: From here on the abbreviation will be used.
es: A partir de ahora, se empleará la abreviatura.

source: The "%" before the command specifies the command works on all lines.
es: El «%» antes de la orden especifica que se ejecuta en todas las líneas.

source: Without a range, ":s" only works on the current line.
es: Sin rango, «:s» sólo funciona en la línea actual.

source: More about ranges in the next section |10.3|.
es: Más sobre los rangos en la próxima sección |10.3|.

source: By default, the ":substitute" command changes only the first occurrence on each line.
es: Por omisión, la orden «:substitute» cambia sólo la primera palabra encontrada en cada línea.

source: For example, the preceding command changes the line:
es: Por ejemplo, la orden anterior cambia esta línea:

source: Professor Smith criticized Professor Johnson today.
es: El profesor Pinilla ha criticado hoy al profesor Burgos.

source: Teacher Smith criticized Professor Johnson today.
es: El maestro Pinilla ha criticado hoy al profesor Burgos.

source: To change every occurrence on the line, you need to add the g (global) flag.
es: Para cambiar todas palabras que aparezcan en la línea deberá usar la opción g (global).

source: :%s/Professor/Teacher/g
es: :%s/profesor/maestro/g

source: Teacher Smith criticized Teacher Johnson today.
es: El maestro Pinilla ha criticado hoy al maestro Burgos.

source: Other flags include p (print), which causes the ":substitute" command to print out the last line it changes.
es: Otras opciones incluyen p (print = imprimir), que hace la orden «:s» muestre en pantalla la última línea que cambió.

source: The c (confirm) flag tells ":substitute" to ask you for confirmation before it performs each substitution.
es: La «c» (confirm = confirmar) le dice a «:s» que pida confirmación antes que se ejecute cada sustitución.

source: Enter the following: >
es: Introduzca lo siguiente: >

source: :%s/Professor/Teacher/c
es: :%s/profesor/maestro/c

source: Vim finds the first occurrence of "Professor" and displays the text it is about to change.
es: Vim encuentra la primera aparición de «profesor» y muestra el texto que está a punto de cambiar.

source: You get the following prompt: >
es: Le aparecerá la siguiente pregunta: >

source: replace with Teacher (y/n/a/q/l/^E/^Y)?
es: replace with maestro (y/n/a/q/l/^E/^Y)?

source: y Yes; make this change.
es: y Si; hacer el cambio.

source: n No; skip this match.
es: n No; omitir esta coincidenci.

source: a All; make this change and all remaining ones without further confirmation.
es: a Todo; hacer este cambio y todos los restantes sin pedir más confirmación.

source: q Quit; don't make any more changes.
es: q Quit; no hacer más cambios.

source: l Last; make this change and then quit.
es: l Último; hacer este cambio y salir.

source: CTRL-E Scroll the text one line up.
es: CTRL-E Desplazar el texto hacia arriba.

source: CTRL-Y Scroll the text one line down.
es: CTRL-Y Desplazar el texto hacia abajo.

source: :s/^the/these/
es: :s/^Eso/Aquello/

source: If you are substituting with a "from" or "to" part that includes a slash, you need to put a backslash before it.
es: Si sustituye con una parte «de» o «a» que incluyan una barra inclinada, tendrá que poner una barra inversa antes de él.

source: A simpler way is to use another character instead of the slash.
es: Una forma más sencilla es usar otro carácter como separador en lugar de la barra.

source: A plus, for example: >
es: Un «+», por ejemplo: >

source: :s+one/two+one or two+
es: :s+uno/dos+uno o dos+

source: *10.3* Command ranges
es: *10.3* Rangos de aplicación

source: The ":substitute" command, and many other : commands, can be applied to a selection of lines.
es: La orden «:substitute» y muchas otras órdenes «:» se pueden aplicar a una selección de líneas.

source: This is called a range.
es: A esto se le llama rango.

source: The simple form of a range is {number},{number}.
es: La forma más simple de un rango es {n},{n} (n es un número entero).

source: :1,5s/this/that/g
es: :1,5s/esto/aquello/g

source: Executes the substitute command on the lines 1 to 5.
es: Ejecuta la orden sustituir desde la línea 1 a la 5.

source: Line 5 is included.
es: La línea 5 queda incluida.

source: The range is always placed before the command.
es: El rango se sitúa justo antes de la orden.

source: :54s/President/Fool/
es: :54s/Político/Demagogo/

source: Some commands work on the whole file when you do not specify a range.
es: Algunas órdenes funcionan sobre un archivo completo cuando no le especifica un rango.

source: To make them work on the current line the "." address is used.
es: Para hacerlos funcionar en la línea actual, use «.».

source: The ":write" command works like that.
es: La orden «:write» funciona de ese modo.

source: Without a range, it writes the whole file.
es: Sin un rango, escribe el archivo completo.

source: To make it write only the current line into a file: >
es: Para hacer que sólo escriba una línea a un archivo: >

source: :.write otherfile
es: :.write otroarchivo

source: The first line always has number one.
es: La primera línea siempre tiene como numeración el 1.

source: How about the last line?
es: ¿Pero qué ocurre con la última línea?

source: The "$" character is used for this.
es: Puede usar el carácter «$» ppara esto.

source: For example, to substitute in the lines from the cursor to the end: >
es: Por ejemplo, para sustituir en las líneas desde la del cursor hasta el final: >

source: :.,$s/yes/no/
es: :.,$s/si/no/

source: Suppose you are editing a chapter in a book, and want to replace all occurrences of "grey" with "gray".
es: Suponga que está editado un capítulo de un libro y que desea reemplazar todas las palabras «grisx con «blanco».

source: But only in this chapter, not in the next one.
es: Pero sólo en ese capítulo, no en el siguiente.

source: You know that only chapter boundaries have the word "Chapter" in the first column.
es: Sabe que los límites entre capítulos tienen la palabra «Capítulo» en la primera columna.

source: This command will work then: >
es: Esta orden funcionaría aquí: >

source: :?^Chapter?,/^Chapter/s=grey=gray=g
es: :?^Capítulo?,/^Capítulo/s=gris=azul=g

source: You can see a search pattern is used twice.
es: Puede observar que un patrón se ha usado en dos ocasiones.

source: The first "?^Chapter?" finds the line above the current position that matches this pattern.
es: La primera «?^Chapter?» busca el patrón en sentido inverso.

source: Thus the ?pattern? range is used to search backwards.
es: Por lo tanto «?patrón?» buscará encima de la línea actual.

source: Similarly, "/^Chapter/" is used to search forward for the start of the next chapter.
es: De forma similar, «/^Capítulo/» se usa para buscar hacia delante el comienzo del nuevo capítulo.

source: To avoid confusion with the slashes, the "=" character was used in the substitute command here.
es: Para evitar confusión con las barras, el carácter «=» se ha empleado en la orden sustituir.

source: A slash or another character would have worked as well.
es: Una barra o cualquier otro carácter habría funcionado igual de bien.

source: There is a slight error in the above command: If the title of the next chapter had included "grey" it would be replaced as well.
es: Hay un pequeño error en la orden de arriba: Si el título del siguiente capítulo hubiese incluido «grisx habría sido reemplazado igualmente.

source: Maybe that's what you wanted, but what if you didn't?
es: Quizá quería eso, ¿pero qué ocurre si no?

source: Then you can specify an offset.
es: Puede especificar un «offset».

source: To search for a pattern and then use the line above it: >
es: Para buscar un patrón e indicar la línea anterior: >

source: /Chapter/-1
es: /Capítulo/-1

source: You can use any number instead of the 1.
es: Puede usar cualquier número en lugar de 1.

source: To address the second line below the match: >
es: Para indicar la segunda línea por debajo de la cadena encontrada: >

source: /Chapter/+2
es: /Capítulo/+2

source: The offsets can also be used with the other items in a range.
es: El desplazamiento se puede emplear también con otros elementos en un rango.

source: Look at this one: >
es: Observe esto: >

source: Instead of figuring out the line numbers of certain positions, remembering them and typing them in a range, you can use marks.
es: En lugar de adivinar el número de algunas líneas en determinadas posiciones, e introducirlas en un rango, puede usar marcadores.

source: Place the marks as mentioned in chapter 3.
es: Ponga marcas como se explica en el capítulo 3.

source: For example, use "mt" to mark the top of an area and "mb" to mark the bottom.
es: Por ejemplo, usa «ms» para marcar la parte superior de un área y «mi» para marcar la parte inferior".

source: Then you can use this range to specify the lines between the marks (including the lines with the marks): >
es: Puede usar el rango para especificar las líneas entre las marcas (inclusive): >

source: You can select text with Visual mode.
es: Puede seleccionar texto con el modo Visual.

source: If you then press ":" to start a colon command, you will see this: >
es: Si pulsa «:» para iniciar una orden, verá lo siguiente: >

source: Note: When using Visual mode to select part of a line, or using CTRL-V to select a block of text, the colon commands will still apply to whole lines.
es: Nota: Cuando use el modo Visual para seleccionar parte de una línea, o use CTRL-V para seleccionar un bloque de texto, las órdenes se aplicarán a líneas completas.

source: This might change in a future version of Vim.
es: Puede que esto cambie en una futura versión.

source: The '< and '> are actually marks, placed at the start and end of the Visual selection.
es: Los «'<» y «'>» son marcadores que se sitúan al principio y al final de la selección.

source: The marks remain at their position until another Visual selection is made.
es: Estos marcadores mantienen estas posiciones hasta que aparece una nueva selección Visual.

source: Thus you can use the "'<" command to jump to position where the Visual area started.
es: Por lo tanto, puede usar la orden «"'<"» para saltar al lugar donde el área Visual comenzaba.

source: And you can mix the marks with other items: >
es: También puede mezclarlas: >

source: When you know how many lines you want to change, you can type the number and then ":".
es: Cuando sepa cuántas líneas quieres cambiar, puede teclear el número y luego «:».

source: For example, when you type "5:", you will get: >
es: Si, por ejemplo, escribe «5:» obtendrá: >

source: Now you can type the command you want to use.
es: Ahora puedes ejecutar la orden que quiera usar.

source: It will use the range "." (current line) until ".+4" (four lines down).
es: Usará el rango «.» (línea actual) hasta «.+4» (cuatro líneas más).

source: Thus it spans five lines.
es: Esto hará un total de cinco líneas.

source: *10.4* The global command
es: *10.4* Las órdenes globales

source: The ":global" command is one of the more powerful features of Vim.
es: La orden «:global» es una de las características más potentes de Vim.

source: It allows you to find a match for a pattern and execute a command there.
es: Permite que encuentre una cadena con un patrón y ejecute una orden en esa ubicación.
