Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The general form is: >
es: El formato habitual es: >

source: :[range]global/{pattern}/{command}
es: :[rango]global/{patrón}/{orden}

source: This is similar to the ":substitute" command.
es: Esto es similar a la orden «:substitute».

source: But, instead of replacing the matched text with other text, the command {command} is executed.
es: Pero en lugar de reemplazar el texto concordado con otro texto, la orden {orden} se ejecutará.

source: Note: The command executed for ":global" must be one that starts with a colon.
es: Nota: La orden ejecutada con «:global» debe ser uno que comience con un punto y coma.

source: Normal mode commands can not be used directly.
es: Las órdenes para el modo Normal no se pueden emplear de forma directa.

source: The |:normal| command can do this for you.
es: De esto se encargará |:normal|.

source: Suppose you want to change "foobar" to "barfoo", but only in C++ style comments.
es: Suponga que quiere cambiar «foobar» por «barfoo», pero solamente en los comentarios de C++.

source: These comments start with "//".
es: Estos comentarios empiezan por «//».

source: Just like with ":substitute", any pattern can be used.
es: Tal y como ocurre con «:substitute», puede emplear cualquier patrón.

source: When you learn more complicated patterns later, you can use them here.
es: Cuando aprenda patrones más complicados, podrá usarlos aquí.

source: *10.5* Visual block mode
es: *10.5* El modo de bloque Visual

source: With CTRL-V you can start selection of a rectangular area of text.
es: Con CTRL-V puede seleccionar un área rectangular de texto.

source: There are a few commands that do something special with the text block.
es: Hay algunas órdenes que hacen algo especial con los bloques de texto.

source: include one ~ include two ~ include three ~ include four ~
es: include uno ~ include dos ~ include tres ~ include cuatro ~

source: Move the cursor to the "o" of "one" and press CTRL-V.
es: Mueva el cursor a la «u» de «uno» y presione CTRL-V.

source: Move it down with "3j" to "four".
es: Desplácese hacia abajo con «3j» hasta«"cuatro».

source: You now have a block selection that spans four lines.
es: Tiene una selección que abarca cuatro líneas.

source: include main.one ~ include main.two ~ include main.three ~ include main.four ~
es: include main.uno ~ include main.dos ~ include main.tres ~ include main.cuatro ~

source: If the block spans short lines that do not extend into the block, the text is not inserted in that line.
es: Si el bloque abarca líneas que no caben dentro del área del bloque, el texto no se insertará en esa línea.

source: For example, make a Visual block selection that includes the word "long" in the first and last line of this text, and thus has no text selected in the second line:
es: Por ejemplo, haga un bloque Visual que no incluya la palabra «larga» en la primera y última línea de este texto, de manera que no se seleccione texto en la segunda línea:

source: This is a long line ~ short ~ Any other long line ~
es: Esto es una línea larga ~ corta ~ Cualquier es una línea larga ~

source: ^^^^ selected block
es: ^^^^^ bloque seleccionado

source: Now use the command "Ivery <Esc>".
es: Ahora usa la orden «Imuy <Esc>».

source: This is a very long line ~ short ~ Any other very long line ~
es: Esto es una línea muy larga ~ corta ~ Esto es una línea muy larga ~

source: The "A" command works the same way, except that it appends after the right side of the block.
es: La orden «A» funciona de la misma manera, excepto que se añade a la derecha del bloque.

source: And it does insert text in a short line.
es: En este caso sí se añade al final de la línea corta.

source: Thus you can make a choice whether you do or don't want to append text to a short line.
es: De este modo puede elegir si quieres añadir o no un texto a la línea corta.

source: There is one special case for "A": Select a Visual block and then use "$" to make the block extend to the end of each line.
es: Hay un caso especial para «Ax: seleccione un bloque Visual y pulsw «$» para hacer que el bloque se extienda al final de cada línea.

source: Using "A" now will append the text to the end of each line.
es: Usar «A» añadirá el texto al final de cada línea.

source: Using the same example from above, and then typing "$A XXX<Esc>, you get this result:
es: De usar el mismo ejemplo que arriba y teclear «$A XXX<Esc>» obtendría el siguiente resultado:

source: This is a long line XXX ~ short XXX ~ Any other long line XXX ~
es: Esto es una línea larga XXX~ corta XXX~ Esto es una línea larga XXX~

source: This really requires using the "$" command.
es: Esto requiere el uso de la orden «$».

source: Vim remembers that it was used.
es: Vim recordará que los ha usado.

source: Making the same selection by moving the cursor to the end of the longest line with other movement commands will not have the same result.
es: Hacer la misma selección con el cursor hasta el final de la línea más larga con otras órdenes no te dará el mismo resultado.

source: The Visual block "c" command deletes the block and then throws you into Insert mode to enable you to type in a string.
es: La orden de bloque Visual «c» elimina el bloque y le devuelve al modo Insertar para que escriba en una cadena de caracteres.

source: The string will be inserted in each line in the block.
es: La cadena se insertará en cada línea del bloque.

source: Starting with the same selection of the "long" words as above, then typing "c_LONG_<Esc>", you get this:
es: Comenzando con la misma selección que las palabras zlarga» de arriba, y teclear después «c_LARGA_<Esc>», le daría esto:

source: This is a _LONG_ line ~ short ~ Any other _LONG_ line ~
es: Esto es una línea _LARGA_ ~ corta ~ Esto es una línea _LARGA_ ~

source: Just like with "I" the short line is not changed.
es: Tal y como ocurre con «Ix, la línea corta no cambia.

source: Also, you can't enter a newline in the new text.
es: Del mismo modo, no podrá introducir una nueva línea en el texto.

source: This is a new text ~ short ~ Any other new text ~
es: Esto es un texto nuevo ~ corta ~ Esto es un texto nuevo ~

source: Notice that, even though only the "long" word was selected, the text after it is deleted as well.
es: Observe que aunque sólo se seleccionó la palabra «larga», el texto tras ella fue eliminado igualmente.

source: Thus only the location of the left edge of the visual block really matters.
es: Por lo tanto sólo la posición del borde izquierdo del eje izquierdo importa realmente.

source: Again, short lines that do not reach into the block are excluded.
es: Una vez más, las palabras que no forman parte del bloque se excluyen.

source: To fill the whole block with one character, use the "r" command.
es: Para rellenar un bloque completo con un sólo carácter, usw la orden «r».

source: Again, starting with the same example text from above, and then typing "rx":
es: Pruébelo de nuevo con el texto de antes, pulsando «rx»:

source: This is a xxxx line ~ short ~ Any other xxxx line ~
es: Esto es una línea larga ~ corta ~ Cualquier es una línea larga ~

source: Note: If you want to include characters beyond the end of the line in the block, check out the 'virtualedit' feature in chapter 25.
es: Nota: Si desea incluir los caracteres más allá del final de línea en el bloque, consulte la opción 'virtualedit' en el capítulo 25.

source: The command ">" shifts the selected text to the right one shift amount, inserting whitespace.
es: La orden «>» empuja el texto hacia la derecha un espacio determinado, insertando espacios en blanco.

source: The starting point for this shift is the left edge of the visual block.
es: El punto base empleado para esta operación es el borde izquierdo del bloque visual.

source: With the same example again, ">" gives this result:
es: Con el mismo ejemplo de nuevo, «>» le da el resultado:

source: This is a long line ~ short ~ Any other long line ~
es: Esto es una línea larga ~ corta ~ Esto es una línea larga ~

source: The shift amount is specified with the 'shiftwidth' option.
es: El espacio del desplazamiento se especifica con la opción 'shiftwidth".

source: To change it to use 4 spaces: >
es: Para cambiarlo a cuatro espacios: >

source: The "<" command removes one shift amount of whitespace at the left edge of the block.
es: La orden «<» desplaza por cada empuje la misma cantidad de espacios en blanco hacia la izquierda.

source: This command is limited by the amount of text that is there; so if there is less than a shift amount of whitespace available, it removes what it can.
es: Esta orden se limita al texto que se encuentre, de manera que eliminará la cantidad de espacio en blanco disponible sin sobreescribir texto.

source: This is a long line short Any other long line ~
es: Esto es una línea larga corta Esto es una línea larga ~

source: The "J" command doesn't require a blockwise selection.
es: La orden «J» no requiere selección de bloques.

source: It works with "v" and "V" selection in exactly the same way.
es: Funciona de igual modo con la selección «v» y «V».

source: *10.6* Reading and writing part of a file
es: *10.6* Leer y escribir parte de un archivo

source: Hi John, ~ Here is the diff that fixes the bug: ~ Bye, Pierre.
es: Hola Juan, ~ Aquí tienes el parche que arregla el problema: ~ Un saludo, Pedro.

source: :read patch
es: :read parche

source: Hi John, ~ Here is the diff that fixes the bug: ~ 2c2 ~ < for (i = 0; i <= length; ++i) ~ --- ~ > for (i = 0; i < length; ++i) ~ Bye, Pierre.
es: Hola Juan, ~ Aquí tienes el parche que arregla el problema: ~ 2c2 ~ < for (i = 0; i <= length; ++i) ~ --- ~ > for (i = 0; i < length; ++i) ~ Un saludo, Pedro.

source: The ":read" command accepts a range.
es: La orden «:read» acepta un rango.

source: The file will be put below the last line number of this range.
es: El archivo será colocado justo debajo de la última línea de este rango.

source: Thus ":$r patch" appends the file "patch" at the end of the file.
es: Por lo tanto, «:$r parche» añadirá el archivo «parche» al final del actual.

source: What if you want to read the file above the first line?
es: ¿Qué ocurre si quiere pegar el archivo encima de la primera línea?

source: This can be done with the line number zero.
es: Esto se puede realizar con el número de línea cero.

source: This line doesn't really exist, you will get an error message when using it with most commands.
es: Este número de línea en realidad no existe, lo cuál hará que con muchas órdenes reciba un error.

source: But this command is allowed: > :0read patch
es: > > :0read parche

source: To write a range of lines to a file, the ":write" command can be used.
es: Para guardar un rango de líneas en un archivo puede usar la orden «:write».

source: Without a range it writes the whole file.
es: Sin el rango esto guardará el archivo completo.

source: With a range only the specified lines are written: >
es: Pero con un rango especificado únicamente las líneas que se especifiquen se escribirán: >

source: This writes the lines from the cursor until the end of the file into the file "tempo".
es: Esto guardará las líneas desde el cursor hasta el final del texto en el archivo «tempo».

source: If this file already exists you will get an error message.
es: Si este archivo existe actualmente obtendrá un mensaje de error.

source: Vim protects you from accidentally overwriting an existing file.
es: Vim le protege de que sobreescriba un archivo preexistente.

source: If you know what you are doing and want to overwrite the file, append !: >
es: Si sabe lo que hace y quiere sobreescribirlo, añada «!»: >

source: CAREFUL: The ! must follow the ":write" command immediately, without white space.
es: CUIDADO: El «!» debe ponerse justo después de la orden «:write», sin el espacio en blanco.

source: Otherwise it becomes a filter command, which is explained later in this chapter.
es: En caso contrario, se convierte en una orden de filtro, el cuál se explica en el capítulo siguiente.

source: In the first section of this chapter was explained how to collect a number of lines into a register.
es: En la primera sección de este capítulo se explicó cómo reunir una serie de líneas en un registro.

source: The same can be done to collect lines in a file.
es: Se puede hacer lo mismo para reunir líneas en un archivo.

source: Write the first line with this command: >
es: Escriba una primera línea con esta orden: >

source: :.write collection
es: :.write archivo

source: :.write >>collection
es: :.write >>archivo

source: The ">>" tells Vim the "collection" file is not to be written as a new file, but the line must be appended at the end.
es: El «>>» le dice a Vim que «archivo» no se debe escribir como un nuevo archivo sino que la línea se deba añadir al final.

source: You can repeat this as many times as you like.
es: Puede repetir esto tantas veces como desee.

source: *10.7* Formatting text
es: *10.7* Formatear texto

source: When you are typing plain text, it's nice if the length of each line is automatically trimmed to fit in the window.
es: Cuando introducza texto, tal vez le resulta útil que, si la longitud de cada línea supera un número, sea automáticamente partida.

source: To make this happen while inserting text, set the 'textwidth' option: >
es: Para hacer esto posible, active la opción 'textwidth': >

source: You might remember that in the example vimrc file this command was used for every text file.
es: Quizá se acuerde de que en el ejemplo de archivo «vimrc» esta orden era empleada para cualquier tipo de archivo.

source: Thus if you are using that vimrc file, you were already using it.
es: Por lo tanto, si está usando ese archivo «vimrc», ya lo tiene activado.

source: To check the current value of 'textwidth': >
es: Para comprobar el valor actual: >

source: Note: A blank line, which contains white space, does NOT separate paragraphs.
es: Nota: Una línea que contiene espacios en blanco NO separa párrafos.

source: This is hard to notice!
es: Esto suele ser difícil de notar.

source: Instead of "ap" you could use any motion or text object.
es: En lugar de «ap» puede usar cualquier movimiento u objeto de texto.

source: If your paragraphs are properly separated, you can use this command to format the whole file: >
es: Si sus párrafos están adecuadamente separados, puede usar esto para formatear todo: >

source: *10.8* Changing case
es: *10.8* Cambiar mayúsculas y minúsculas

source: You have text with section headers in lowercase.
es: Suponga que tiene texto con las cabeceras de sección en minúscula.

source: You want to make the word "section" all uppercase.
es: Quiere que la palabra «sección» esté en mayúsculas.

source: Do this with the "gU" operator.
es: Puede hacerlo con el operador «gU».

source: Start with the cursor in the first column: >
es: Comience con el cursor en la primera columna: >

source: gUw < section header ----> SECTION header
es: gUw < cabecera de sección ----> cabecera de SECCIÓN

source: guw < SECTION header ----> section header
es: guw cabecera de SECCIÓN ----> cabecera de sección

source: g~~ < Some GIRLS have Fun ----> sOME girls HAVE fUN ~
es: g~~ Algunas CHICAS se divierten ----> aLGUNAS chicas SE DIVIERTEN ~

source: *10.9* Using an external program
es: *10.9* Uso de un programa externo

source: Vim has a very powerful set of commands, it can do anything.
es: Vim tiene un conjunto de órdenes muy potente para hacer cualquier cosa.

source: But there may still be something that an external command can do better or faster.
es: Pero siempre hay un programa externo que es mejor para una tarea específica.

source: The command "!{motion}{program}" takes a block of text and filters it through an external program.
es: La orden «!{movimiento}{programa}» recoge un bloque de un texto y lo filtra a través de un programa externo.

source: In other words, it runs the system command represented by {program}, giving it the block of text represented by {motion} as input.
es: En otras palabras, ejecuta la orden de sistema {programa}, dándole el bloque de texto representado por {movimiento} como entrada.

source: The output of this command then replaces the selected block.
es: La salida de la orden sustituirá la selección.

source: Because this summarizes badly if you are unfamiliar with UNIX filters, take a look at an example.
es: Ya que esto requiere más explicación si no usa los filtros UNIX habitualmente, veamos un ejemplo.

source: The sort command sorts a file.
es: La orden «sort» ordena un archivo.

source: If you execute the following command, the unsorted file input.txt will be sorted and written to output.txt.
es: Si ejecuta lo siguiente, el archivo desordenado entrada.txt será ordenado y guardado en output.txt.

source: (This works on both UNIX and Microsoft Windows.) >
es: (Esto funciona en UNIX y en Windows.) >

source: Now do the same thing in Vim.
es: Ahora haga lo mismo en Vim.

source: You want to sort lines 1 through 5 of a file.
es: Desea ordenar las líneas de la 1 a la 5.

source: You start by putting the cursor on line 1.
es: Para comenzar, ponga el cursor en la línea 1.

source: Next you execute the following command: >
es: A continuación ejecute la siguiente orden: >

source: The "!" tells Vim that you are performing a filter operation.
es: El «!» le dice a Vim que está realizando una operación filtro.

source: The Vim editor expects a motion command to follow, indicating which part of the file to filter.
es: El editor Vim espera que introduzca a continuación un orden de movimiento para saber qué filtrar.

source: The "5G" command tells Vim to go to line 5, so it now knows that it is to filter lines 1 (the current line) through 5.
es: La orden «5G» le dice a Vim que vaya a la línea 5, de forma que sepa que tiene que filtrar desde la línea 1 (la actual) hasta la 5.

source: In anticipation of the filtering, the cursor drops to the bottom of the screen and a ! prompt displays.
es: Antes de filtrar nada, la línea de órdenes se activa y muestra un «!».

source: You can now type in the name of the filter program, in this case "sort".
es: Ahora es el momento de que escriba el filtro, en este caso «sort».

source: Therefore, your full command is as follows: >
es: Por lo tanto, la orden completo sería: >

source: !5Gsort<Enter>
es: !5Gsort<Entrar>

source: The result is that the sort program is run on the first 5 lines.
es: El resultado es que se ejecuta el programa «sort» sobre las 5 primeras líneas.

source: The output of the program replaces these lines.
es: La salida del programa reemplaza estas líneas.

source: line 55 line 11 line 33 line 22 line 11 --> line 33 line 22 line 44 line 44 line 55 last line last line
es: línea 55 línea 11 línea 33 línea 22 línea 11 --> línea 33 línea 22 línea 44 línea 44 línea 55 última línea última línea

source: The "!!" command filters the current line through a filter.
es: La orden «!!» filtra la línea actual.

source: In Unix the "date" command prints the current time and date.
es: En Unix, la orden »date» imprime la hora y fecha actuales.

source: "!!date<Enter>" replaces the current line with the output of "date".
es: «!!date<Entrar>» reemplaza la línea actual con la salida de «date».

source: This is useful to add a timestamp to a file.
es: Esto es útil para añadir una marca de tiempo al archivo.

source: Starting a shell, sending it text and capturing the output requires that Vim knows how the shell works exactly.
es: Iniciar la consola, enviarle texto y capturar la salida requiere que Vim sepa exactamente cómo funciona la consola de forma precisa.

source: When you have problems with filtering, check the values of these options:
es: Cuando tenga problemas con el filtrado, comprueba los valores de las siguientes opciones:

source: 'shell' specifies the program that Vim uses to execute external programs.
es: 'shell' especifica el programa que Vim empleará para ejecutar programas externos.

source: 'shellcmdflag' argument to pass a command to the shell 'shellquote' quote to be used around the command 'shellxquote' quote to be used around the command and redirection 'shelltype' kind of shell (only for the Amiga) 'shellslash' use forward slashes in the command (only for MS-Windows and alikes) 'shellredir' string used to write the command output into a file
es: 'shellcmdflag' argumento para pasar un orden a la consola 'shellquote' comillas a usar alrededor de la orden 'shellxquote' comillas a usar alrededor de la orden y redirección 'shelltype' tipo de consola (sólo para Amiga) 'shellslash' usar barras inclinadas en la orden (sólo para Windows y similares) 'shellredir' cadena para escribir la salida a un archivo

source: On Unix this is hardly ever a problem, because there are two kinds of shells: "sh" like and "csh" like.
es: En Unix esto es raramente un problema, porque hay dos tipos de consola: «sh» y «csh».

source: Vim checks the 'shell' option and sets related options automatically, depending on whether it sees "csh" somewhere in 'shell'.
es: Vim comprueba la opción 'shell' y configura todo automáticamente, dependiendo de si ve «cshx en algún lugar de 'shell'.

source: On MS-Windows, however, there are many different shells and you might have to tune the options to make filtering work.
es: Sin embargo, en Windows, hay muchos tipos de consolas y quizá tenga que ajustar las opciones para hacer que el filtrado funcione correctamente.

source: Check the help for the options for more information.
es: Busque en la ayuda más información sobre las opciones de configuración de la consola para poder solucionarlo.

source: on Unix: > :read !ls on MS-Windows: > :read !dir
es: en Unix: > :read !ls en MS-Windows: > :read !dir

source: The output of the "ls" or "dir" command is captured and inserted in the text, below the cursor.
es: La salida de las órdenes «ls» o «dir» se puede capturar e insertar en el texto, debajo del cursor.

source: This is similar to reading a file, except that the "!" is used to tell Vim that a command follows.
es: Esto es similar a leer un archivo, excepto que el «!» se emplea para decirle a Vim que hay una orden a continuación.

source: The command may have arguments.
es: Puede que la orden tenga argumentos.

source: And a range can be used to tell where Vim should put the lines: >
es: Puede emplear un rango para decirle a Vim dónde debería poner las líneas: >

source: This inserts the current time and date in UTC format at the top of the file.
es: Esto inserta la hora y fecha actuales en formato UTC en la primera línea del archivo.

source: (Well, if you have a date command that accepts the "-u" argument.) Note the difference with using "!!date": that replaced a line, while ":read !date" will insert a line.
es: (Bueno, si tienes una orden «date» que acepta el argumento «-u».) Tenga en cuenta la diferencia de usar «!!date»; esto reemplazó una línea, mientras que «:read !date» insertó una línea.

source: The Unix command "wc" counts words.
es: La orden Unix «wc» cuenta palabras.

source: To count the words in the current file: >
es: Para contar las del archivo actual: >

source: This is the same write command as before, but instead of a file name the "!" character is used and the name of an external command.
es: Esta es la misma orden «write» vista que anteriormente, pero en lugar de un nombre de archivo, se emplean el carácter «!» y una orden externa.

source: The written text will be passed to the specified command as its standard input.
es: El texto guardado será pasado al orden especificado como entrada estándar.

source: The "wc" command isn't verbose.
es: La orden «wc» no es muy informativa.

source: This means you have 4 lines, 47 words and 249 characters.
es: Esto significa que tiene 4 líneas, 47 palabras y 249 caracteres.
