Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: There are two basic ways to use views.
es: Hay dos maneras básicas de usar las vistas.

source: The first is to let Vim pick a name for the view file.
es: La primera es dejar que Vim escoja el nombre para el archivo de la vista.

source: You can restore the view when you later edit the same file.
es: Puede restaurar la vista posteriormente cuando edite el mismo archivo.

source: To store the view for the current window: >
es: Para guardar la vista de la ventana actual: >

source: Vim will decide where to store the view.
es: Vim decidirá donde guardar la vista.

source: When you later edit the same file you get the view back with this command: >
es: Cuando más tarde edite el mismo archivo puede recuperar la vista con esta orden: >

source: That's easy, isn't it?
es: Fácil, ¿no?

source: Now you want to view the file without the 'number' option on, or with all folds open, you can set the options to make the window look that way.
es: Cuando quiere ver el archivo sin la opción 'number' activada, o con todos los plegados abiertos, puede definir las opciones para que la ventana presente ese aspecto.

source: Then store this view with: >
es: Una vez hecho ésto, guarde ésta vista con: >

source: Now you can switch between the two views on the file by using ":loadview" with and without the "1" argument.
es: Ahora puede pasar de una vista a otra del archivo usando «:loadview» con y sin el argumento «1».

source: You can store up to ten views for the same file this way, one unnumbered and nine numbered 1 to 9.
es: De esta forma, puede guardar hasta diez vistas para el mismo archivo, uno sin numerar y nueve numerados del 1 al 9.

source: The second basic way to use views is by storing the view in a file with a name you chose.
es: La segunda manera básica de usar las vistas se puede hacer guardando la vista en un archivo con un nombre de su elección.

source: This view can be loaded while editing another file.
es: Puede cargar esta vista mientras edita un archivo distinto.

source: Vim will then switch to editing the file specified in the view.
es: Entonces, Vim pasará a editar el archivo especificado en la vista.

source: Thus you can use this to quickly switch to editing another file, with all its options set as you saved them.
es: Por ello, puede usar ésto para pasar rápidamente a editar otro archivo, con todas las opciones definidas tal y como las guardó.

source: For example, to save the view of the current file: >
es: Por ejemplo, para guardar la vista del archivo actual: >

source: :mkview ~/.vim/main.vim
es: :mkview ~/.vim/principal.vim

source: :source ~/.vim/main.vim
es: :source ~/.vim/principal.vim

source: When editing a specific file, you might set options specifically for that file.
es: Al editar un archivo en particular, puede que defina opciones específicas para ese archivo.

source: Typing these commands each time is boring.
es: Teclear estas órdenes es aburrido.

source: Using a session or view for editing a file doesn't work when sharing the file between several people.
es: Usar una sesión o vista para editar un archivo no funciona cuando comparte el archivo con varias personas.

source: The solution for this situation is adding a modeline to the file.
es: La solución para esta situación es añadir un «modeline» al archivo.

source: This is a line of text that tells Vim the values of options, to be used in this file only.
es: Éste es una línea de texto que le dice a Vim los valores de las opciones para su uso con este archivo en particular.

source: A typical example is a C program where you make indents by a multiple of 4 spaces.
es: Un ejemplo típico es un programa en C en el que introduce los tabulados como múltiplos de 4.

source: This requires setting the 'shiftwidth' option to 4.
es: Esto requiere que configure la opción 'shiftwidth' a 4.

source: This modeline will do that:
es: Este «modeline» hará esta función:

source: Put this line as one of the first or last five lines in the file.
es: Ponga esta línea como uno de las primeras o cinco últimas líneas en el archivo.

source: When editing the file, you will notice that 'shiftwidth' will have been set to four.
es: Cuando edite el archivo, notará que 'shiftwidth' se ha definido con valor de cuatro.

source: When editing another file, it's set back to the default value of eight.
es: Cuando edite otro archivo, esta opción será devuelta a su valor predeterminado de ocho.

source: For some files the modeline fits well in the header, thus it can be put at the top of the file.
es: Para algunas líneas, el «modeline» encaja en la cabecera, y por ello puede ponerlo al inicio del archivo.

source: For text files and other files where the modeline gets in the way of the normal contents, put it at the end of the file.
es: Para los archivos de texto y otros archivos en los que el «modeline» se interpone en el camino de los contenidos normales, póngala al final del archivo.

source: The 'modelines' option specifies how many lines at the start and end of the file are inspected for containing a modeline.
es: La opción «modelines» especifica cuantas líneas son inspeccionadas al inicio y final del archivo en busca de un «modeline».

source: To inspect ten lines: >
es: Para inspeccionar diez líneas: >

source: The 'modeline' option can be used to switch this off.
es: Puede usar la opción 'modeline' para desactivar ésto.

source: Do this when you are working as root on Unix or Administrator on MS-Windows, or when you don't trust the files you are editing: >
es: Haga ésto cuando trabaje como «root» en Unix, o administrador en MS-Windows; o cuando no confía en los archivos que está editando: >

source: any-text vim:set {option}={value} ...
es: any-text vim:set {opción}={valor} ...

source: The "any-text" indicates that you can put any text before and after the part that Vim will use.
es: «any-text» indica que puede introducir texto antes y después de la parte que Vim usará.

source: This allows making it look like a comment, like what was done above with /* and */.
es: Esto permite que presente el aspecto de un comentario, de la manera en que se hizo antes con /* y */.

source: The " vim:" part is what makes Vim recognize this line.
es: La parte de «vim:» es lo que hace que Vim reconozca esta línea.

source: There must be white space before "vim", or "vim" must be at the start of the line.
es: Debe haber un espacio en blanco antes de «vim», o «vim» ha de estar al inicio de la línea.

source: Thus using something like "gvim:" will not work.
es: Por ello, usar algo como «gvim» no funcionaría.

source: The part between the colons is a ":set" command.
es: La parte entre los dos puntos es una orden «:set».

source: It works the same way as typing the ":set" command, except that you need to insert a backslash before a colon (otherwise it would be seen as the end of the modeline).
es: Funciona de la misma manera que teclear la orden «:set», con la excepción de que tiene que introducir una barra inversa antes de un colon (en caso contrario, se vería como el final de un «modeline»).

source: There is an extra backslash before the first colon, so that it's included in the ":set" command.
es: Hay una barra inversa extra antes del primer colon, y por ello se incluye en la orden «:set».

source: The text after the second colon is ignored, thus a remark can be placed there.
es: Se ignora el texto antes del segundo colon, y por ello puede introducir aquí un comentario.

source: *usr_29.txt* For Vim version 7.3.
es: *usr_29.esx* Para Vim versión 7.3.

source: Last change: 2008 Jun 28
es: Último cambio: 8/6/2008

source: Moving through programs
es: Moverse a través de programas

source: The creator of Vim is a computer programmer.
es: El creador de Vim es un programador informático.

source: It's no surprise that Vim contains many features to aid in writing programs.
es: Por ello, no sorprende que Vim integre tantas características que facilitan la edición de programas.

source: Jump around to find where identifiers are defined and used.
es: Salte de un punto a otro para ver dónde se definen y usan los identificadores.

source: Preview declarations in a separate window.
es: Previsualize declaraciones en una ventana distinta.

source: There is more in the next chapter.
es: Hay aún más en el siguiente capítulo.

source: |29.1| Using tags |29.2| The preview window |29.3| Moving through a program |29.4| Finding global identifiers |29.5| Finding local identifiers
es: |29.1| Usar etiquetas |29.2| La ventana de vista previa |29.3| Moverse a través de un programa |29.4| Buscar identificadores globales |29.5| Buscar identificadores locales

source: Next chapter: |usr_30.txt| Editing programs Previous chapter: |usr_28.txt| Folding Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_30.txt| Editar programas Capítulo anterior: |usr_28.esx| Plegado Tabla de contenidos: |usr_toc.esx|

source: *29.1* Using tags
es: *29.1* Usar etiquetas

source: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Now to go back.
es: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Vuelva atrás ahora.

source: The CTRL-T command goes to the preceding tag.
es: La orden «CTRL-T» se desplaza a la etiqueta precedente.

source: In the example above you get back to the "write_line" function, in the call to "write_char".
es: En el ejemplo anterior, vuelve a la función «write_line» al invocar «write_char».

source: This command takes a count argument that indicates how many tags to jump back.
es: Esta orden toma un argumento numérico que indica el número de etiquetas que se desplazará hacia atrás.

source: You have gone forward, and now back.
es: Ahora que ha ido hacia delante, vuelva atrás.

source: Let's go forward again.
es: Vayamos otra vez hacia delante.

source: The following command goes to the tag on top of the list: >
es: La siguiente orden se desplaza a la etiqueta al principio de la lista: >

source: You can prefix it with a count and jump forward that many tags.
es: Puede precederlo de un número para saltar hacia delante ese número d etiquetas.

source: For example: ":3tag".
es: Por ejemplo: «:3tag».

source: CTRL-T also can be preceded with a count.
es: También puede preceder «CTRL-T» con un número.

source: These commands thus allow you to go down a call tree with CTRL-] and back up again with CTRL-T.
es: Por ello, estas órdenes permiten desplazarse hacia delante con «CTRL-]», y hacia atrás con «CTRL-T».

source: Use ":tags" to find out where you are.
es: Use «:tags» conocer dónde se encuentra.

source: The ":tag" command replaces the file in the current window with the one containing the new function.
es: La orden «:tag» reemplaza el fichero en la ventana actual con el que contiene la nueva función.

source: But suppose you want to see not only the old function but also the new one?
es: Pero suponga que desea ver no sólo la función antigua, y no sólo la nueva.

source: You can split the window using the ":split" command followed by the ":tag" command.
es: Para ello, puede dividir la ventana usando la orden «:split», seguida de la orden «:tag».

source: Vim has a shorthand command that does both: > :stag tagname
es: Vim tiene una orden corta que realiza ambas funciones: > :stag tagname

source: When you have files in many directories, you can create a tags file in each of them.
es: Cuando tiene varios ficheros en muchos directorios, puede crear un fichero de etiquetas en cada uno de ellos.

source: Vim will then only be able to jump to tags within that directory.
es: Vim sólo podrá saltar a etiquetas dentro de ese directorio.

source: To find more tags files, set the 'tags' option to include all the relevant tags files.
es: Para encontrar más ficheros de etiquetas, defina la opción 'tags' para incluir todos los ficheros de etiquetas relevantes.

source: This finds a tags file in the same directory as the current file, one directory level higher and in all subdirectories.
es: Esto encuentra un fichero de etiquetas en el mismo directorio que el fichero actual, un nivel de directorios superiores y en todos los subdirectorios.

source: This is quite a number of tags files, but it may still not be enough.
es: Este es un alto número de ficheros de etiquetas, pero puede que no lo suficiente.

source: For example, when editing a file in "~/proj/src", you will not find the tags file "~/proj/sub/tags".
es: Por ejemplo, al editar un fichero en «~/proj/src», no encontraría el fichero de etiquetas «~/proj/sub/tags».

source: For this situation Vim offers to search a whole directory tree for tags files.
es: Por ello, Vim ofrece buscar ficheros de etiquetas en todo el árbol de directorios.

source: The nice thing about this is that Exuberant ctags recognizes various file types.
es: Lo mejor de esto es que Exuberant ctags reconoce varios tipos de fichero.

source: Thus this doesn't work just for C and C++ programs, also for Eiffel and even Vim scripts.
es: Por ello, no sólo funciona con programas de C y C++, sino también para Eiffel e incluso scripts de Vim.

source: See the ctags documentation to tune this.
es: Consulte la documentación de ctags para información de configuración.

source: Now you only need to tell Vim where your big tags file is: >
es: Ahora sólo tiene que decir a Vim dónde está su fichero grande de etiquetas: >

source: When a function is defined multiple times (or a method in several classes), the ":tag" command will jump to the first one.
es: Cuando una función se define varias veces (o un mismo método en varias clases), la orden «:tag» saltaría a la primera aparición.

source: If there is a match in the current file, that one is used first.
es: De haber una coincidencia en el fichero actual, se usará éste en primer lugar.

source: You can now jump to other matches for the same tag with: >
es: Ahora puede saltar a otras coincidencias de la misma etiqueta con: >

source: Repeat this to find further matches.
es: Repita para encontrar más coincidencias.

source: If there are many, you can select which one to jump to: >
es: De haber varias, puede seleccionar a cuál saltar: >

source: :tselect tagname
es: :tselect etiqueta

source: You can now enter the number (in the first column) of the match that you would like to jump to.
es: Ahora puede introducir el número (en la primera columna) de la coincidencia a la que desea saltar.

source: The information in the other columns give you a good idea of where the match is defined.
es: La información en las otras columnas le dan un buena idea de dónde se define la coincidencia.

source: :tfirst go to first match :[count]tprevious go to [count] previous match :[count]tnext go to [count] next match :tlast go to last match
es: :tfirst Primera coincidencia :[número]tprevious Ir a la [número] coincidencia anterior :[count]tnext Ir a la [número] coincidencia siguiente :tlast Ir a la última coincidencia

source: Command line completion is a good way to avoid typing a long tag name.
es: El autocompletado de línea de órdenes es una buena manera de evitar escribir un nombre de etiqueta largo.

source: Just type the first bit and press <Tab>: >
es: Simplemente escriba la primera parte y pulse <Tab>: >

source: Now use command line completion: press <Tab>.
es: Use ahora el autocompletado de línea de órdenes pulsando <Tab>.

source: Vim will find all tags that contain "block" and use the first match.
es: Vim encontrará todas las etiquetas que contienen «block», y usará la primera coincidencia.

source: The "/" before a tag name tells Vim that what follows is not a literal tag name, but a pattern.
es: La «/» antes del nombre de una etiqueta le dice a Vim que lo hay a continuación no es un nombre de etiqueta, sino un patrón.

source: You can use all the items for search patterns here.
es: Puede usar todos los elementos de patrones de búsqueda.

source: For example, suppose you want to select a tag that starts with "write_": >
es: Por ejemplo, supongo que desea seleccionar una etiqueta que empieza con «write»: >

source: The "^" specifies that the tag starts with "write_".
es: La «^» especifica que la etiqueta empieza con «write_».

source: Otherwise it would also be found halfway a tag name.
es: En caso contrario, se detectaría también de estar en medio de un nombre de etiqueta.

source: Similarly "$" at the end makes sure the pattern matches until the end of a tag.
es: De forma similar, el signo «$» al final asegura que el patrón sólo coincida con el final de una etiqueta.

source: Since CTRL-] takes you to the definition of the identifier under the cursor, you can use a list of identifier names as a table of contents.
es: Ya que «CTRL-]» le lleva a la definición del identificador bajo el cursor, puede usar un alista de nombres identificadores como una tabla de contenidos.

source: Here is an example.
es: Aquí tiene un ejemplo.

source: First create a list of identifiers (this requires Exuberant ctags): >
es: Primero cree una lista de identificadores (require Exuberant ctags): >

source: The window contains a list of all the functions.
es: Esta ventana contiene todas una lista de todas las funciones.

source: There is some more stuff, but you can ignore that.
es: También hay más elementos, pero los puede ignorar.

source: Do ":setlocal ts=99" to clean it up a bit.
es: Ejecute «setlocal ts=99» para organizarlo un poco.

source: In this window, define a mapping: >
es: Defina una macro en esta ventana: >

source: The 'tagbsearch' option tells if the tags file is sorted or not.
es: La opción 'tagbsearch' indica si el archivo de etiquetas está ordenado o no.

source: The default is to assume a sorted tags file, which makes a tags search a lot faster, but doesn't work if the tags file isn't sorted.
es: El valor predeterminado es suponer un archivo de etiquetas ordenado, que agiliza la búsqueda de etiquetas, pero no funciona si el archivo de etiquetas no está ordenado.

source: When you use the SNiFF+ program, you can use the Vim interface to it |sniff|.
es: Cuando usa el programa SNiFF+, puede usar la interfaz de Vim |sniff|.

source: SNiFF+ is a commercial program.
es: SNiFF+ es un programa comercial.

source: Cscope is a free program.
es: Cscope es un programa libre.

source: It does not only find places where an identifier is declared, but also where it is used.
es: No sólo encuentra los lugares dónde se declara un identificador. sino también dónde se usa.

source: See |cscope|.
es: Consulte |cscope|.

source: *29.2* The preview window
es: *29.2* La ventana de previsualización

source: When you edit code that contains a function call, you need to use the correct arguments.
es: Cuando edita código que contiene una llamada a una función, necesitará los argumentos correctos.

source: To know what values to pass you can look at how the function is defined.
es: Para conocer los valores que puede introducir, puede ver cómo se define la función.

source: The tags mechanism works very well for this.
es: El mecanismo de etiquetas es adecuado para esto.

source: Preferably the definition is displayed in another window.
es: Preferentemente, la definición se muestra en otra ventana.

source: For this the preview window can be used.
es: Puede usar la ventana de previsualización para esto.

source: To open a preview window to display the function "write_char": >
es: Use lo siguiente para abrir una ventana de previsualización que muestre la función «write_char»: >

source: Vim will open a window, and jumps to the tag "write_char".
es: Vim abrirá una ventana, y saltará a la etiqueta «write_char».

source: Then it takes you back to the original position.
es: A continuación, vuelve a la posición original.

source: Thus you can continue typing without the need to use a CTRL-W command.
es: Así, puede seguir escribiendo sin necesidad de usar la orden «CTRL-W».

source: If the name of a function appears in the text, you can get its definition in the preview window with: >
es: Si el nombre de una función aparece en el texto, puede obtener su definición en la ventana de previsualización con lo siguiente: >

source: There is a script that automatically displays the text where the word under the cursor was defined.
es: Hay un script que muestra el texto automáticamente dónde se definió la palabra bajo el cursor.

source: See |CursorHold-example|.
es: Consulte |CursorHold-example|.

source: To edit a specific file in the preview window, use ":pedit".
es: Para editar un fichero específico en la ventana de previsualización, use «_pedit».

source: This can be useful to edit a header file, for example: >
es: Esto puede ser útil para editar la cabecera de un archivo, por ejemplo: >

source: Finally, ":psearch" can be used to find a word in the current file and any included files and display the match in the preview window.
es: Por último, «:psearch» se puede utilizar para buscar una palabra en el archivo actual y cualquier archivo incluido («include») y mostrar la coincidencia en la ventana de previsualización.

source: This is especially useful when using library functions, for which you do not have a tags file.
es: Esto es especialmente útil cuando se utilizan las funciones de la biblioteca para el que no tiene un archivo de etiquetas.

source: *29.3* Moving through a program
es: *29.3* Moverse a través de un programa

source: Since a program is structured, Vim can recognize items in it.
es: Debido a que un programa está estructurado, Vim puede reconocer elementos en él.

source: Specific commands can be used to move around.
es: Puede usar órdenes específicas para desplazarse.

source: C programs often contain constructs like this:
es: Los programas en C habitualmente contienen construcciones como esta:

source: But then much longer, and possibly nested.
es: Pero también más largo, y posiblemente anidado.

source: Position the cursor on the "#ifdef" and press %.
es: Posicione el cursor sobre «#ifdef» y pulse «%».

source: Vim will jump to the "#else".
es: Vim saltará al siguiente «#else».

source: Pressing % again takes you to the "#endif".
es: Pulsar «%» otra vez le devuelve a «#endif».

source: Another % takes you to the "#ifdef" again.
es: Otro «%» le llevaría a «#ifdef» otra vez.

source: When the construct is nested, Vim will find the matching items.
es: Cuando una construcción está anidada, Vim encontrará los elementos coincidentes.

source: This is a good way to check if you didn't forget an "#endif".
es: Esta es una buena forma de comprobar si se ha olvidado de insertar un «#endif».

source: When you are somewhere inside a "#if" - "#endif", you can jump to the start of it with: >
es: Cuando está en algún punto dentro de un «#if - #endif», puede saltar al principio con lo siguiente: >

source: If you are not after a "#if" or "#ifdef" Vim will beep.
es: Si no está después de un «#if» o «#ifdef» Vim emitirá un sonido.

source: To jump forward to the next "#else" or "#endif" use: >
es: Para saltar hacia adelante al siguiente «#else» o «#endif» use lo siguiente: >

source: These two commands skip any "#if" - "#endif" blocks that they encounter.
es: Estas dos órdenes omiten cualquier bloque «#if - #endif» que se encuentran.

source: With the cursor in the last line, "[#" moves to the first line.
es: Con el cursor en la última línea, «[#» le lleva a la primera línea.

source: The "#ifdef" - "#endif" block in the middle is skipped.
es: El bloque «#ifdef - #endif» en el centro se omite.

source: In C code blocks are enclosed in {}.
es: Los bloques de código C están limitados por {}.

source: These can get pretty long.
es: Esto puede ser muy largo.

source: To move to the start of the outer block use the "[[" command.
es: Para saltar al principio del bloque exterior use la orden «[[».

source: Use "][" to find the end.
es: Use «][» para encontrar el final.
