Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Instead of reading the text (boring!) you can use the vimtutor to learn your first Vim commands.
es: En lugar de leer el texto (¡aburre!), puede usar vimtutor para aprender sus primeras órdenes con Vim.

source: This is a 30 minute tutorial that teaches the most basic Vim functionality hands-on.
es: Éste es un tutorial de treinta minutos que enseña las funcionalidades básicas de Vim a través de la práctica.

source: On Unix, if Vim has been properly installed, you can start it from the shell: > vimtutor
es: En Unix, si Vim se instaló adecuadamente, puede iniciar Vim desde la consola: > vimtutor

source: On MS-Windows you can find it in the Program/Vim menu.
es: En MS-Windows, lo encontrará en el menú Programas/Vim.

source: Or execute vimtutor.bat in the $VIMRUNTIME directory.
es: O puede ejecutar «vimtutor.bat» en el directorio $VIMRUNTIME.

source: This will make a copy of the tutor file, so that you can edit it without the risk of damaging the original.
es: Esto crea una copia del archivo del tutor, para que así pueda editarlo sin peligro de dañar el original.

source: There are a few translated versions of the tutor.
es: Existen unas cuantas versiones traducidas del tutor.

source: To find out if yours is available, use the two-letter language code.
es: Para ver si el suyo está disponible, use el código de idioma de dos letras.

source: For French: >
es: Para el francés: >

source: Copy the tutor file.
es: Copie el archivo del tutor.

source: You can do this with Vim (it knows where to find it): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w!
es: Puede hacer esto con Vim (sabe donde encontrarlo): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w!

source: TUTORCOPY' -c 'q' < This will write the file "TUTORCOPY" in the current directory.
es: TUTORCOPY' -c 'q' < Esto copia el archivo «TUTORCOPY» al directorio actual.

source: To use a translated version of the tutor, append the two-letter language code to the filename.
es: Para usar una versión traducida del tutor, afije el código de idioma al nombre del archivo.

source: For French: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w!
es: Para francés: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w!

source: Edit the copied file with Vim: > vim -u NONE -c "set nocp" TUTORCOPY < The extra arguments make sure Vim is started in a good mood.
es: Edite la copia del archivo con Vim: > vim -u NONE -c "set nocp" TUTORCOPY < Los argumentos extra se aseguran de que Vim se inicie adecuadamente:

source: Delete the copied file when you are finished with it: > del TUTORCOPY < ==============================================================================
es: Borrar el archivo copiado cuando haya acabado con él: > del TUTORCOPY ==============================================================================

source: The Vim user manual and reference manual are Copyright (c) 1988-2003 by Bram Moolenaar.
es: El manual de usuario y el manual de referencia están bajo el Copyright (c) 1988-2003 por Bram Moolenaar.

source: This material may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later.
es: Este material se distribuirá sólo bajo estos términos de licencia y condiciones expuestas en la Open Publication License, versión 1.0 o posterior.

source: The latest version is presently available at: http://www.opencontent.org/openpub/
es: La versión más actual está ahora disponible en: http://www.opencontent.org/openpub/

source: People who contribute to the manuals must agree with the above copyright notice.
es: Las personas que contribuyan al manual también tienen que aceptar el copyright expuesto anteriormente.

source: *frombook* Parts of the user manual come from the book "Vi IMproved - Vim" by Steve Oualline (published by New Riders Publishing, ISBN: 0735710015).
es: *frombook* Hay partes del manual de usuario que proceden del libro «Vi IMproved - Vim», por Steve Oualline (publicado por New Riders Publishing, ISBN: 0735710015).

source: The Open Publication License applies to this book.
es: La Open Publication License también cubre a este libro.

source: Only selected parts are included and these have been modified (e.g., by removing the pictures, updating the text for Vim 6.0 and later, fixing mistakes).
es: Sólo se incluyen partes seleccionadas, y estas se han modificado (p. ej. se eliminaron las fotos, se actualizó el texto para Vim 6.0 y posteriores, corrección de errata).

source: The omission of the |frombook| tag does not mean that the text does not come from the book.
es: La omisión de la etiqueta |frombook| no significa que el texto no proceda del libro.

source: Many thanks to Steve Oualline and New Riders for creating this book and publishing it under the OPL!
es: ¡Muchas gracias a Steve Oualline y a New Riders por crear este libro, y publicarlo bajo la licencia OPL!

source: It has been a great help while writing the user manual.
es: Ha servido de gran ayuda a la hora de escribir este manual.

source: Not only by providing literal text, but also by setting the tone and style.
es: No sólo por el texto literal, sino también al definir el tono y estilo.

source: If you make money through selling the manuals, you are strongly encouraged to donate part of the profit to help AIDS victims in Uganda.
es: Si obtiene beneficios mediante la venta de los manuales, le animamos a que done parte de los beneficios para ayudar a las victimas del SIDA en Uganda.

source: See |iccf|.
es: Véase |iccf|.

source: *usr_07.txt* For Vim version 7.3.
es: *usr_07.esx* Para Vim version 7.3.

source: Editing more than one file
es: Editar más de un archivo

source: No matter how many files you have, you can edit them without leaving Vim.
es: No importa cuántos archivos tenga, puede editarlos todos sin salir de Vim.

source: Define a list of files to work on and jump from one to the other.
es: Defina una lista de archivos de trabajo y pase de uno a otro.

source: Copy text from one file and put it in another one.
es: Copie texto de un archivo a otro.

source: |07.1| Edit another file |07.2| A list of files |07.3| Jumping from file to file |07.4| Backup files |07.5| Copy text between files |07.6| Viewing a file |07.7| Changing the file name
es: |07.1| Editar otro archivo |07.2| Una lista de archivos |07.3| Pasar de archivo a archivo |07.4| Copias de seguridad |07.5| Copiar texto entre archivos |07.6| Ver un archivo |07.7| Cambiar el nombre de archivo

source: Next chapter: |usr_08.txt| Splitting windows Previous chapter: |usr_06.txt| Using syntax highlighting Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_08.esx| Dividir en ventanas Capítulo anterior: |usr_06.esx| Uso del coloreado de sintaxis Tabla de contenidos: |usr_toc.esx|

source: *07.1* Edit another file
es: *07.1* Editar otro archivo

source: You can use any file name instead of "foo.txt".
es: Puede usar cualquier nombre de archivo en lugar de «foo.txt».

source: Vim will close the current file and open the new one.
es: Vim cerrará el archivo actual y abrirá uno nuevo.

source: If the current file has unsaved changes, however, Vim displays an error message and does not open the new file:
es: Sin embargo, si el archivo actual tiene cambios no guardados, Vim mostrará un error y no abrirá el archivo nuevo:

source: Note: Vim puts an error ID at the start of each error message.
es: Nota: Vim coloca una ID de error al comienzo de cada mensaje de error.

source: If you do not understand the message or what caused it, look in the help system for this ID.
es: Si no entiende el mensaje o su causa, puedes buscar ayuda para esta ID.

source: In this case: >
es: En este caso: >

source: At this point, you have a number of alternatives.
es: En este punto, dispone de una serie de alternativas.

source: You can write the file using this command: >
es: Puede escribir el archivo usando esta orden: >

source: The text with changes is still there, but you can't see it.
es: El texto con los cambios está todavía aquí, pero no lo puede ver.

source: This is further explained in section |22.4|: The buffer list.
es: Esto se explica con más detalle en la sección |22.4|: La lista de búfers.

source: *07.2* A list of files
es: *07.2* Una lista de archivos

source: You can start Vim to edit a sequence of files.
es: Puede iniciar Vim para editar una secuencia de archivos.

source: vim one.c two.c three.c
es: vim uno.c dos.c tres.c

source: This command starts Vim and tells it that you will be editing three files.
es: Esta orden inicia Vim y le dice que va a editar tres archivos.

source: Vim displays just the first file.
es: Vim muestra solamente el primero.

source: After you have done your thing in this file, to edit the next file you use this command: >
es: Tras haber terminado con el primero, puede editar el siguiente con esta orden: >

source: If you have unsaved changes in the current file, you will get an error message and the ":next" will not work.
es: Si tiene cambios sin guardar en el archivo actual, obtendrá un mensaje de error y «:next» no funcionará.

source: This is the same problem as with ":edit" mentioned in the previous section.
es: Este es el mismo problema mencionado con «:edit» en la sección anterior.

source: To abandon the changes: >
es: Para abandonar los cambios: >

source: But mostly you want to save the changes and move on to the next file.
es: Pero habitualmente querrá guardar los cambios e ir al siguiente archivo.

source: There is a special command for this: >
es: Hay una orden especial para esto: >

source: To see which file in the argument list you are editing, look in the window title.
es: Para ver qué archivo de la lista de argumentos está editando, mire en el título de la ventana.

source: It should show something like "(2 of 3)".
es: Debería mostrar algo como «(2 de 3)».

source: This means you are editing the second file out of three files.
es: Esto significa que está editando un segundo archivo de una lista de tres.

source: If you want to see the list of files, use this command: >
es: Si quieres ver la lista de archivos, use esta orden: >

source: This is short for "arguments".
es: Esta es la abreviatura de «argumentos».

source: The output might look like this:
es: La salida será algo así:

source: one.c [two.c] three.c ~
es: uno.c [dos.c] tres.c ~

source: These are the files you started Vim with.
es: Estos son los archivos con los que ha iniciado Vim.

source: The one you are currently editing, "two.c", is in square brackets.
es: El que está editando actualmente, «dos.c», se encuentra entre corchetes.

source: This is just like the ":next" command, except that it moves in the other direction.
es: Esto es justo como la orden «:next», excepto que va en la otra dirección.

source: Again, there is a shortcut command for when you want to write the file first: >
es: Una vez más, existe una orden para cuando quiera escribir el archivo primero: >

source: You can use a count for ":next" and ":previous".
es: Puede usar un multiplicador para «:next» y «:previous».

source: To skip two files forward: >
es: Para saltar dos archivos: >

source: When moving around the files and making changes, you have to remember to use ":write".
es: Cuando se mueva por los archivos y haga cambios, tiene que recordar usar «:write».

source: Otherwise you will get an error message.
es: En caso contrario, obtendrá mensajes de error.

source: If you are sure you always want to write modified files, you can tell Vim to automatically write them: >
es: Si está seguro de que siempre va a escribir los archivos modificados, puede decirle a Vim que los escriba automáticamente: >

source: You can redefine the list of files without the need to exit Vim and start it again.
es: Puede redefinir la lista de archivos sin la necesidad de salir de Vim y arrancarlo de nuevo.

source: Use this command to edit three other files: >
es: Emplee esta orden para editar otros tres archivos: >

source: :args five.c six.c seven.h
es: :args cinco.c seis.c siete.h

source: Vim will take you to the first file in the list.
es: Vim le llevará al primer archivo en la lista.

source: Again, if the current file has changes, you can either write the file first, or use ":args!" (with ! added) to abandon the changes.
es: De nuevo, si el archivo actual cambia, puede tanto guardar el archivo antes como usar «:args!» (con el ! añadido) para abandonar los cambios.

source: DID YOU EDIT THE LAST FILE?
es: ¿HA EDITADO EL HASTA EL ÚLTIMO ARCHIVO?

source: *arglist-quit* When you use a list of files, Vim assumes you want to edit them all.
es: *arglist-quit* Cuando usa una lista de archivos, Vim asume que quiere editarlos todos.

source: To protect you from exiting too early, you will get this error when you didn't edit the last file in the list yet:
es: Para evitar cerrar antes de tiempo, obtendrá un error cuando no haya editado el último archivo en la lista e intentes salir.

source: If you really want to exit, just do it again.
es: Si realmente desea salir, simplemente inténtelo de nuevo.

source: Then it will work (but not when you did other commands in between).
es: Entonces funcionará (pero no si ejecuta otras órdenes durante).

source: *07.3* Jumping from file to file
es: *07.3* Pasar de un archivo a otro

source: To quickly jump between two files, press CTRL-^ (on English-US keyboards the ^ is above the 6 key).
es: Para saltar rápidamente entre dos archivos, pulse CTRL-^ (en teclados Inglés-EEUU el ^ se encuentra encima de la tecla 6).

source: :args one.c two.c three.c
es: :args uno.c dos.c tres.c

source: Now you are in two.c.
es: Ahora está en two.c.

source: Now use CTRL-^ to go back to one.c.
es: Use CTRL-^ para volver a uno.c.

source: Another CTRL-^ and you are back in two.c.
es: Use CTRL-^ otra vez y estará de vuelta en dos.c.

source: Another CTRL-^ and you are in one.c again.
es: Otro CTRL-^ y estará en uno.c de nuevo.

source: If you now do: >
es: Si ahora hace: >

source: You are in three.c.
es: Está en tres.c.

source: Notice that the CTRL-^ command does not change the idea of where you are in the list of files.
es: Observe que la orden CTRL-^ no cambia la idea de dónde está en la lista de archivos.

source: Only commands like ":next" and ":previous" do that.
es: Sólo órdenes como «:next» y «:previous» lo hacen.

source: The file you were previously editing is called the "alternate" file.
es: El archivo que haya estado editando anteriormente se llama el archivo «alterno».

source: When you just started Vim CTRL-^ will not work, since there isn't a previous file.
es: Hasta que no haya un archivo anterior, CTRL-^ no funcionará.

source: This takes you to the position where the cursor was when you left the file.
es: Esto le lleva a la posición en la que estaba el cursor cuando salió del archivo.

source: Another mark that is remembered is the position where you made the last change: >
es: Otra marca que se recuerda es la posición donde hizo el último cambio: >

source: Suppose you are editing the file "one.txt".
es: Suponga que está editando el archivo «uno».

source: Somewhere halfway the file you use "x" to delete a character.
es: En algún lugar a mitad de camino en el archivo, use «x» para eliminar un carácter.

source: Then you go to the last line with "G" and write the file with ":w".
es: Vaya ahora a la última línea con «G» y escriba el archivo con «:w».

source: You edit several other files, and then use ":edit one.txt" to come back to "one.txt".
es: Edite otros archivos y use «:edit uno.txt» para volver a «uno.txt».

source: If you now use `" Vim jumps to the last line of the file.
es: Si ahora usa `", Vim saltará a la última línea del archivo.

source: Using `. takes you to the position where you deleted the character.
es: Usar `. le llevará a la posición donde eliminó el carácter.

source: Even when you move around in the file `" and `. will take you to the remembered position.
es: Incluso cuando se mueva por el archivo, `" y `. le llevará a la posición recordada.

source: At least until you make another change or leave the file.
es: Al menos hasta que realice otro cambio o salga del archivo.

source: Now edit the file "bar.txt" and place the B mark (B for bar) at its last line: > GmB
es: Edite ahora el archivo «bar.txt» y coloque el marcador B en su última línea: > GmB

source: Now you can use the "'F" command to jump back to halfway foo.txt.
es: Ahora puede usar la orden «'F» para saltar al punto marcado de foo.txt.

source: Or edit yet another file, type "'B" and you are at the end of bar.txt again.
es: O edite otro archivo, escriba «'B» y estará en el final de bar.txt de nuevo.

source: The file marks are remembered until they are placed somewhere else.
es: Estas marcas de archivo se recordarán hasta que se coloquen en algún otro lugar.

source: Thus you can place the mark, do hours of editing and still be able to jump back to that mark.
es: Así podrás colocar los marcadores, trabajar durante horas y aún tendrá la posibilidad de volver al punto marcado.

source: It's often useful to think of a simple connection between the mark letter and where it is placed.
es: Es útil pensar en una conexión sencilla entre la letra del marcador y el lugar donde se coloca.

source: For example, use the H mark in a header file, M in a Makefile and C in a C code file.
es: Por ejemplo, use la letra H para un archivo de cabecera (*.h), M para un Makefile y C para código C.

source: *07.4* Backup files
es: *07.4* Copias de seguridad

source: Usually Vim does not produce a backup file.
es: Habitualmente, Vim no produce copias de seguridad.

source: If you want to have one, all you need to do is execute the following command: >
es: Si desea que lo haga,lo único que tiene que hacer es ejecutar la siguiente orden: >

source: The name of the backup file is the original file with a ~ added to the end.
es: El nombre del archivo de seguridad es el original con un ~ añadido al final.

source: If your file is named data.txt, for example, the backup file name is data.txt~.
es: Si su archivo se llama datos.txt, por ejemplo, el archivo de seguridad será datos.txt~.

source: If you do not like the fact that the backup files end with ~, you can change the extension: >
es: Si no le gusta el hecho de que las copias de seguridad terminen con ~, puedes cambiar la extensión: >

source: This will use data.txt.bak instead of data.txt~.
es: Esto hará que Vim use datos.txt.bak en lugar de datos.txt~.

source: Another option that matters here is 'backupdir'.
es: Otra opción que resulta importante aquí es 'backupdir'.

source: It specifies where the backup file is written.
es: Especifica dónde se guardará el archivo de seguridad.

source: The default, to write the backup in the same directory as the original file, will mostly be the right thing.
es: La opción por omisión, escribir la copia de seguridad en el mismo directorio, es habitualmente la mejor.

source: Note: When the 'backup' option isn't set but the 'writebackup' is, Vim will still create a backup file.
es: Nota: Cuando la opción 'backup' no está activada pero 'writebackup' lo está, Vim creará igualmente la copia de seguridad.

source: However, it is deleted as soon as writing the file was completed successfully.
es: Sin embargo, se eliminará tan pronto como se escriba el archivo con éxito.

source: This functions as a safety against losing your original file when writing fails in some way (disk full is the most common cause; being hit by lightning might be another, although less common).
es: Esto funciona como seguridad ante la pérdida de su archivo original cuando la escritura falla por algún motivo (un disco lleno es el más habitual, un rayo puede ser otra causa aunque menos común).

source: If you are editing source files, you might want to keep the file before you make any changes.
es: Si está editando archivos fuente, quizá desee mantener el archivo antes de hacer ningún cambio.

source: But the backup file will be overwritten each time you write the file.
es: Pero la copia de seguridad se sobreescribirá cada vez que escriba el archivo.

source: Thus it only contains the previous version, not the first one.
es: Así sólo contendrá la versión previa y no la original.

source: To make Vim keep the original file, set the 'patchmode' option.
es: Para hacer que Vim mantenga el archivo original, activa la opción 'patchmode'.

source: This specifies the extension used for the first backup of a changed file.
es: Esto especifica la extensión usada para la primera copia de seguridad de un archivo modificado.

source: Usually you would do this: >
es: Habitualmente harás esto: >

source: When you now edit the file data.txt for the first time, make changes and write the file, Vim will keep a copy of the unchanged file under the name "data.txt.orig".
es: Cuando edite el archivo datos.txt por primera vez, haga cambios y guarde el archivo, Vim mantendrá una copia del archivo sin cambios bajo el nombre «datos.txt.orig».

source: If you make further changes to the file, Vim will notice that "data.txt.orig" already exists and leave it alone.
es: Si hace más cambios, Vim notará que «datos.txt.orig» ya existe y lo dejará en paz.

source: Further backup files will then be called "data.txt~" (or whatever you specified with 'backupext').
es: El resto de copias de seguridad se llamarán «datos.txt~» (o lo que haya especificado con 'backupext').

source: If you leave 'patchmode' empty (that is the default), the original file will not be kept.
es: Si deja 'patchmode' vacío (la opción por defecto), el archivo original no se guardará.

source: *07.5* Copy text between files
es: *07.5* Copiar texto entre archivos

source: :edit thisfile /This vjjjj$y
es: :edit estearchivo /Este vjjjj$y

source: Now edit the file you want to put the text in.
es: Edite ahora el archivo donde desea poner el texto.

source: Move the cursor to the character where you want the text to appear after.
es: Mueva el cursor al caracter donde quiera que el texto se coloque a continuación.

source: Use "p" to put the text there.
es: Use «p» para poner el texto allí.

source: > :edit otherfile /There p
es: > :edit otroarchivo /Allí p

source: Of course you can use many other commands to yank the text.
es: Naturalmente, podrás usar cualquiera otra orden de copia.

source: For example, to select whole lines start Visual mode with "V".
es: Por ejemplo, para seleccionar líneas completas, inicie el modo Visual con «V».

source: Or use CTRL-V to select a rectangular block.
es: O pulse CTRL-V para seleccionar bloques rectangulares.

source: Or use "Y" to yank a single line, "yaw" to yank-a-word, etc.
es: Puede usar «Y» para simplemente copiar una línea, «yaw» para pegar una palabra (yank-a-word).

source: The "p" command puts the text after the cursor.
es: La orden «p» pone el texto después del cursor.

source: Use "P" to put the text before the cursor.
es: Use «P» para pegarlo antes del cursor.

source: Notice that Vim remembers if you yanked a whole line or a block, and puts it back that way.
es: Repare en el hecho de que Vim recuerda si ha copiado una línea completa o un bloque y lo pondrá del mismo modo.

source: When you want to copy several pieces of text from one file to another, having to switch between the files and writing the target file takes a lot of time.
es: Cuando quiera copiar diversas porciones de un texto de un archivo a otro, tener que cambiar entre los archivos y guardarlos lleva mucho tiempo.

source: To avoid this, copy each piece of text to its own register.
es: Para evitar esto, copie cada porción en un registro independiente.

source: A register is a place where Vim stores text.
es: Un registro es un lugar donde Vim guarda texto.

source: Here we will use the registers named a to z (later you will find out there are others).
es: Aquí usaremos los registros nombrados desde la «a» a la «z» (más tarde se percatará de que hay otros).
