Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: This matches the item before it zero or more times, as few as possible.
es: Esto encuentra el elemento anterior a él cero o más veces, pero cuantas menos posibles.

source: The item by itself always matches zero times.
es: El elemento en sí siempre se empareja cero veces.

source: It is useful when combined with something else.
es: Es de utilidad en combinación con algo más.

source: This matches "axb" in "axbxb".
es: Esto coincide con «axb» en «axbxb».

source: If this pattern would be used: >
es: De usar este patrón >

source: *27.5* Alternatives
es: *27.5* Alternativas

source: The "or" operator in a pattern is "\|".
es: El operador «or» dentro de un patrón es «\|».

source: This matches "foo" or "bar".
es: Esto encuentra «foo» o «bar».

source: More alternatives can be concatenated: >
es: Puede concatenar más alternativas: >

source: /one\|two\|three
es: /uno\|dos\|tres

source: Matches "one", "two" and "three".
es: Coincide con «uno», «dos» y «tres».

source: To match multiple times, the whole thing must be placed in "\(" and "\)": >
es: Para encontrar varias coincidencias debe insertar la cadena completa entre «\(» y «\)»: >

source: This matches "foo", "foobar", "foofoo", "barfoobar", etc.
es: Esto encuentra «foo», «foobar», «foofoo», «barfoobar», etc.

source: A related item is "\&".
es: Un elemento relacionado es «\&».

source: This requires that both alternatives match in the same place.
es: Esto requiere que ambas alternativas coincidan en el mismo lugar.

source: The resulting match uses the last alternative.
es: La coincidencia resultante usa la última alternativa.

source: This matches "for" in "forever".
es: Esto coincide on «for» en «forever».

source: It will not match "fortuin", for example.
es: No coincide con «fortuin», por ejemplo.

source: *27.6* Character ranges
es: *27.6* Rangos de caracteres

source: To match "a", "b" or "c" you could use "/a\|b\|c".
es: Puede usar «/a|b\|c» para encontrar «a», «b» o «c».

source: When you want to match all letters from "a" to "z" this gets very long.
es: Esto se extiende si desea encontrar todas las letras de la «a» a la «z».

source: There is a shorter method: >
es: Existe una manera más corta: >

source: The [] construct matches a single character.
es: La construcción [] encuentra un sólo carácter.

source: Inside you specify which characters to match.
es: Especifique dentro de este los caracteres a encontrar.

source: You can include a list of characters, like this: >
es: Puede incluir una lista larga de caracteres, como esto: >

source: This will match any of the characters included.
es: Esto encuentra cualquier carácter incluido.

source: For consecutive characters you can specify the range.
es: Puede especificar un rango para encontrar caracteres consecutivos.

source: "0-3" stands for "0123".
es: «0-3» significa «01234».

source: "w-z" stands for "wxyz".
es: «w-z» significa «wxyz».

source: Thus the same command as above can be shortened to: >
es: Por ello, puede acortar la orden anterior: >

source: To match the "-" character itself make it the first or last one in the range.
es: Para encontrar el carácter «-», tiene que aparecer al principio o final del rango.

source: These special characters are accepted to make it easier to use them inside a [] range (they can actually be used anywhere in the search pattern):
es: Estos caracteres especiales se aceptan para facilitar su uso dentro de un rango [] (en realidad, puede usarlos en cualquier lugar dentro del patrón de búsqueda):

source: To avoid matching a specific character, use "^" at the start of the range.
es: Use «^» al principio del rango para evitar emparejar un carácter en particular.

source: The [] item then matches everything but the characters included.
es: El elemento [] emparejará todo menos los caracteres incluidos.

source: /"[^"]*" < " a double quote [^"] any character that is not a double quote * as many as possible " a double quote again
es: /"[^"]*" < " dobles comillas [^"] todo carácter que no es una comilla doble * tantos como sea posible " otras dobles comillas

source: A number of ranges are used very often.
es: Existe un número de rangos usados a menudo.

source: Vim provides a shortcut for these.
es: Vim ofrece accesos directos para esto.

source: Finds alphabetic characters.
es: Encuentra caracteres alfabéticos.

source: This is equal to using "/[a-zA-Z]".
es: Esto equivale a usar «/[a-zA-Z]».

source: Here are a few more of these:
es: Aquí hay más ejemplos:

source: item matches equivalent ~ \d digit [0-9] \D non-digit [^0-9] \x hex digit [0-9a-fA-F] \X non-hex digit [^0-9a-fA-F] \s white space [ ] (<Tab> and <Space>) \S non-white characters [^ ] (not <Tab> and <Space>) \l lowercase alpha [a-z] \L non-lowercase alpha [^a-z] \u uppercase alpha [A-Z] \U non-uppercase alpha [^A-Z]
es: elemento coincidencias equivalente ~ \d dígito [0-9] \D no-dígito [^0-9] \x dígito hexadecimal [0-9a-fA-F] \X dígito no hexadecimal [^0-9a-fA-F] \s espacio vacío [ ] (<Tab> y <Space>) \S caracteres no vacíos [^ ] (no <Tab> y <Space>) \l alfa minúscula [a-z] \L alfa no mayúscula [^a-z] \u alfa mayúscula [A-Z] \U alfa no mayúscula [^A-Z]

source: Note: Using these predefined ranges works a lot faster than the character range it stands for.
es: Nota: El uso de estos rangos predeterminados es más rápido que el rango de caracteres que simbolizan.

source: These items can not be used inside [].
es: Estos elementos no se pueden usar dentro de [].

source: Thus "[\d\l]" does NOT work to match a digit or lowercase alpha.
es: Así, «[\d\l]» NO funciona para encontrar un dígito o un alfa minúscula.

source: Use "\(\d\|\l\)" instead.
es: En lugar de ello, use «\(\d\|\l\)».

source: *27.7* Character classes
es: *27.7* Clase de carácter

source: The character range matches a fixed set of characters.
es: El rango de carácter empareja un conjunto específico de caracteres.

source: A character class is similar, but with an essential difference: The set of characters can be redefined without changing the search pattern.
es: Se parece una clase de carácter, pero con una importante diferencia: puede redefinir el conjunto de caracteres sin cambiar el patrón de búsqueda.

source: For example, search for this pattern: >
es: Por ejemplo, busque este patrón: >

source: The "\f" items stands for file name characters.
es: Los elementos «\f» simbolizan caracteres de nombre de archivo.

source: Thus this matches a sequence of characters that can be a file name.
es: Así, esto empareja una secuencia de caracteres que pueden ser un nombre de archivo.

source: Which characters can be part of a file name depends on the system you are using.
es: Qué caracteres pueden formar parte de un nombre de archivo dependen del sistema que esté usando.

source: On MS-Windows, the backslash is included, on Unix it is not.
es: En MS-Windows, la barra inversa está incluida, pero no en Unix.

source: This is specified with the 'isfname' option.
es: Puede especificar esto con la opción 'isfname'.

source: The default value for Unix is: >
es: El valor por omisión en Unix es: >

source: For other systems the default value is different.
es: El valor predeterminado depende del sistema.

source: Thus you can make a search pattern with "\f" to match a file name, and it will automatically adjust to the system you are using it on.
es: Así, puede crear un patrón de búsqueda con «\f» para emparejar un nombre de archivo, y ajustarse automáticamente al sistema en el que lo está usando.

source: item matches option ~ \i identifier characters 'isident' \I like \i, excluding digits \k keyword characters 'iskeyword' \K like \k, excluding digits \p printable characters 'isprint' \P like \p, excluding digits \f file name characters 'isfname' \F like \f, excluding digits
es: elemento coinicidencias opción ~ \i caracteres de identificación 'isident' \I como \i, excluyendo dígitos \k carácter de palabra clave 'iskeyword' \K como \k, excluyendo dígitos \p caracteres imprimibles 'isprint' \P como \p, excluyendo dígitos \f caracteres de nombre de archivo 'isfname' \F como \f, excluyendo dígitos

source: *27.8* Matching a line break
es: *27.8* Coincidir con un salto de línea

source: Vim can find a pattern that includes a line break.
es: Vim puede encontrar un patrón que incluye un salto de línea.

source: You need to specify where the line break happens, because all items mentioned so far don't match a line break.
es: Debe especificar la aparición del salto de línea, ya que todos los elementos mencionados hasta ahora no se emparejan con un salto de línea.

source: To check for a line break in a specific place, use the "\n" item: >
es: Para comprobar si hay un salto de línea en un lugar específico, use el elemento «\n»: >

source: /the\nword
es: /la\npalabra

source: This will match at a line that ends in "the" and the next line starts with "word".
es: Esto coincidiría en una línea que termina con «la», seguida de una que comienza con «palabra».

source: To match "the word" as well, you need to match a space or a line break.
es: Para encontrar también «la palabra», tendrá que emparejar el espacio o el salto de línea.

source: The item to use for it is "\_s": >
es: Para ello, use el elemento «\_s»: >

source: /the\_sword
es: /la\_spalabra

source: /the\_s\+word
es: /la\_s\+palabra

source: This also matches when "the " is at the end of a line and " word" at the start of the next one.
es: Esto también coincide cuando «la » está al final de la línea, y «palabra» al inicio de la siguiente.

source: "\s" matches white space, "\_s" matches white space or a line break.
es: «\s» coincide con espacio en blanco, «\_s» coincide con espacio en blanco o un salto de línea.

source: Similarly, "\a" matches an alphabetic character, and "\_a" matches an alphabetic character or a line break.
es: De forma parecida, «\a» coincide con un carácter alfabético o un salto de línea.

source: The other character classes and ranges can be modified in the same way by inserting a "_".
es: Las otras clases de caracteres y rangos se pueden modificar de la misma forma insertando un «_».

source: Many other items can be made to match a line break by prepending "\_".
es: Puede hacer coincidir muchos otros elementos con un salto de línea prefijando «\_».

source: For example: "\_." matches any character or a line break.
es: Por ejemplo, «\_.» coincide con cualquier carácter o salto de línea.

source: Note: "\_.*" matches everything until the end of the file.
es: Nota: «\_.*» empareja todo hasta el final del archivo.

source: Be careful with this, it can make a search command very slow.
es: Use esto con cuidado, ya que puede reducir la velocidad de una orden de búsqueda.

source: *27.9* Examples
es: *27.9* Ejemplos

source: Here are a few search patterns you might find useful.
es: Aquí dispone de unos cuantos patrones de búsqueda que puede encontrar útiles.

source: This shows how the items mentioned above can be combined.
es: Esto muestra cómo combinar los elementos anteriormente mencionados.

source: A sample license plate number is "1MGU103".
es: Un ejemplo de un número de matrícula es «1MGU103».

source: It has one digit, three uppercase letters and three digits.
es: Tiene un dígito, tres letras mayúsculas y tres dígitos.

source: Directly putting this into a search pattern: >
es: Puede insertar esto en un patrón búsqueda de la siguiente manera: >

source: Which one of these you should use?
es: ¿Cual debería usar?

source: Whichever one you can remember.
es: Él que recuerde.

source: The simple way you can remember is much faster than the fancy way that you can't.
es: La manera sencilla que puede recordar es más rápida que la compleja que no puede.

source: If you can remember them all, then avoid the last one, because it's both more typing and slower to execute.
es: Si los puede recordar todos, evite el último, ya que es más lento de teclear y de ejecutar.

source: In C programs (and many other computer languages) an identifier starts with a letter and further consists of letters and digits.
es: En programas C (y muchos otros lenguajes de programación), un identificador empieza con una letra seguida de letras y dígitos.

source: Underscores can be used too.
es: Puede usar subrayados.

source: This can be found with: >
es: Puede encontrar esto con: >

source: Note: "\<" and "\>" depend on the 'iskeyword' option.
es: Nota: «\<» y «\>» dependen de la opción 'iskeyword'.

source: If it includes "-", for example, then "ident-" is not matched.
es: De incluir un «-», por ejemplo, «ident-» no se encontrará.

source: In this situation use: >
es: Use lo siguiente en esta situación: >

source: < This checks if "\w" does not match before or after the identifier.
es: < Esto revisa se «\w» no se empareja antes o después de un identificador.

source: See |/\@<!| and |/\@!|.
es: Consulte |/\@<!| and |/\@!|.

source: *usr_05.txt* For Vim version 7.3.
es: *usr_05.esx* Para Vim versión 7.3.

source: Last change: 2009 Jun 04
es: Último cambio: 4/6/2009

source: Set your settings
es: Configuración

source: |05.1| The vimrc file |05.2| The example vimrc file explained |05.3| Simple mappings |05.4| Adding a plugin |05.5| Adding a help file |05.6| The option window |05.7| Often used options
es: |05.1| El archivo vimrc |05.2| Explicación del archivo vimrc de ejemplo |05.3| Macros sencillas |05.4| Añadir una extensión |05.5| Añadir un archivo de ayuda |05.6| La ventana de opciones |05.7| Opciones más comunes

source: Next chapter: |usr_06.txt| Using syntax highlighting Previous chapter: |usr_04.txt| Making small changes Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_06.esx| Uso del resaltado de sintaxis Capítulo anterior: |usr_04.esx| Hacer cambios pequeños Tabla de contenidos: |usr_toc.esx|

source: *05.1* The vimrc file *vimrc-intro*
es: *05.1* El archivo «vimrc» *vimrc-intro*

source: You probably got tired of typing commands that you use very often.
es: Probablemente se haya cansado de introducir órdenes que usa muy a menudo.

source: To start Vim with all your favorite option settings and mappings, you write them in what is called the vimrc file.
es: Para iniciar Vim con todas sus opciones y macros favoritas, defínalos en lo que se llama el archivo «vimrc».

source: Vim executes the commands in this file when it starts up.
es: Vim ejecuta las órdenes en este archivo al inicio.

source: If you don't have a vimrc file yet, see |vimrc| to find out where you can create a vimrc file.
es: Si todavía no tiene un archivo vimrc, consulte |vimrc| para saber dónde puede crear un archivo vimrc.

source: Also, the ":version" command mentions the name of the "user vimrc file" Vim looks for.
es: La orden «:version» también menciona el nombre del «archivo vimrc de usuario» que Vim busca.

source: The vimrc file can contain all the commands that you type after a colon.
es: El archivo vimrc puede contener todas las órdenes que se pueden teclear tras «:».

source: The most simple ones are for setting options.
es: Los más sencillos son los que se usan para ajustar opciones.

source: For example, if you want Vim to always start with the 'incsearch' option on, add this line you your vimrc file: >
es: Por ejemplo, si quiere que Vim comience siempre con la opción 'incsearch' activada, añada la siguiente línea al archivo: >

source: For this new line to take effect you need to exit Vim and start it again.
es: Necesita salir de Vim e iniciarlo otra vez para que esta nueva línea tenga efecto.

source: Later you will learn how to do this without exiting Vim.
es: Luego verá cómo hacer esto sin salir de Vim.

source: This chapter only explains the most basic items.
es: Este capítulo sólo explica los elementos más básicos.

source: For more information on how to write a Vim script file: |usr_41.txt|.
es: Para más información sobre cómo escribir un archivo de script de Vim: |usr_41.txt|.

source: *05.2* The example vimrc file explained *vimrc_example.vim*
es: *05.2* El archivo vimrc de ejemplo, explicado *vimrc_example.vim*

source: In the first chapter was explained how the example vimrc (included in the Vim distribution) file can be used to make Vim startup in not-compatible mode (see |not-compatible|).
es: En el primer capítulo se explicó como el archivo vimrc de ejemplo (incluido en la distribución de Vim) se puede emplear para iniciar Vim en modo no-compatible (ver |not-compatible|).

source: The file can be found here:
es: Puede encontrar el archivo aquí:

source: In this section we will explain the various commands used in this file.
es: En esta sección explicaremos las diferentes órdenes empleadas en este archivo.

source: This will give you hints about how to set up your own preferences.
es: Esto le dará pistas sobre cómo preparar su propia configuración.

source: Not everything will be explained though.
es: No todo se explicará, en cualquier caso.

source: Use the ":help" command to find out more.
es: Use la orden ":help" e investigue.

source: As mentioned in the first chapter, these manuals explain Vim working in an improved way, thus not completely Vi compatible.
es: Tal y como se mencionó en el primer capítulo, estos manuales explican un Vim funcionando en un modo mejorado, y por lo tanto no completamente Vi-compatible.

source: Setting the 'compatible' option off, thus 'nocompatible' takes care of this.
es: Desactivar la opción 'compatible' o activar 'nocompatible' se encarga de esto.

source: This specifies where in Insert mode the <BS> is allowed to delete the character in front of the cursor.
es: Esto especifica que se permita en el modo Insertar que <Retroceso> pueda eliminar el carácter delante del cursor.

source: The three items, separated by commas, tell Vim to delete the white space at the start of the line, a line break and the character before where Insert mode started.
es: Los tres elementos, separados por comas, le dicen a Vim que puede eliminar el espacio en blanco al comienzo de la línea, un salto de línea y el carácter anterior a donde inició el modo Insertar.

source: This tells Vim to keep a backup copy of a file when overwriting it.
es: Esto le dice a Vim que mantenga una copia de seguridad de un archivo cuando lo sobreescribe.

source: But not on the VMS system, since it keeps old versions of files already.
es: Pero no en el sistema VMS, ya que éste mantiene versiones anteriores por su cuenta.

source: The backup file will have the same name as the original file with "~" added.
es: El backup tendrá el mismo nombre con un «~» delante.

source: See |07.4| >
es: Véase |07.4| >

source: Keep 50 commands and 50 search patterns in the history.
es: Mantiene 50 órdenes y 50 patrones de búsqueda en el historial.

source: Use another number if you want to remember fewer or more lines.
es: Use otro número si quiere almacenar más o menos líneas.

source: Display an incomplete command in the lower right corner of the Vim window, left of the ruler.
es: Muestra una orden incompleta en la esquina inferior derecha de la ventana de Vim, a la izquierda del «ruler» (regla).

source: For example, when you type "2f", Vim is waiting for you to type the character to find and "2f" is displayed.
es: Por ejemplo, cuando pulsa «2f», Vim está esperando que introduzcas el carácter a encontrar y muestra «2f» es mostrado.

source: When you press "w" next, the "2fw" command is executed and the displayed "2f" is removed.
es: Cuando pulse «w», la orden «2fw» es ejecutará y el «2f» se eliminará.

source: +-------------------------------------------------+ |text in the Vim window | |~ | |~ | |-- VISUAL -- 2f 43,8 17% | +-------------------------------------------------+ ^^^^^^^^^^^ ^^^^^^^^ ^^^^^^^^^^ 'showmode' 'showcmd' 'ruler'
es: +-------------------------------------------------+ |texto en la ventana de Vim | |~ | |~ | |-- VISUAL -- 2f 43,8 17% | +-------------------------------------------------+ ^^^^^^^^^^^ ^^^^^^^^ ^^^^^^^^^^ 'showmode' 'showcmd' 'ruler'

source: This mapping yanks the visually selected text and searches for it in C files.
es: Esta macro copia el texto seleccionado visualmente y lo busca en archivos C.

source: This is a complicated mapping.
es: Este es una macro complicado.

source: You can see that mappings can be used to do quite complicated things.
es: Aquí puede ver que los macro se pueden emplear para hacer cosas realmente complicadas.

source: Still, it is just a sequence of commands that are executed like you typed them.
es: En cualquier caso, es simplemente una secuencia de órdenes que se ejecutan justo como los tecleas.

source: This switches on syntax highlighting, but only if colors are available.
es: Esto activa el resaltado de sintaxis, pero sólo si hay colores disponibles.

source: And the 'hlsearch' option tells Vim to highlight matches with the last used search pattern.
es: Y la opción 'hlsearch' le dice a Vim que resalte las coincidencias con el último patrón de búsqueda empleado.

source: The "if" command is very useful to set options only when some condition is met.
es: La orden «if» es muy útil para activar opciones sólo cuando se cumple alguna condición.

source: More about that in |usr_41.txt|.
es: Véase |usr_41.txt|

source: Using filetype plugin files Many different filetypes are edited with different options.
es: Usar extensiones de tipo de archivo («filetype plugin») Muchos tipos de archivo se editan con diferentes opciones.

source: For example, when you edit a "c" file, it's very useful to set the 'cindent' option to automatically indent the lines.
es: Por ejemplo, cuando edita un archivo «c», es muy útil activar la opción «cindent» para sangrar las líneas automáticamente.

source: These commonly useful option settings are included with Vim in filetype plugins.
es: Estas opciones empleadas comúnmente están incluidas con Vim en las extensiones de tipos de archivo.

source: You can also add your own, see |write-filetype-plugin|.
es: También puede incluir las tuyas propias, consulte |write-filetype-plugin|.

source: Using indent files When editing programs, the indent of a line can often be computed automatically.
es: Usar archivos de tabulación Cuando edita programas, la sangría de una línea puede a menudo ser computada de manera automática.

source: Vim comes with these indent rules for a number of filetypes.
es: Vim viene con esas reglas de sangrado para diversos tipos de archivo.

source: See |:filetype-indent-on| and 'indentexpr'.
es: Véase |:filetype-indent-on| y 'indentexpr'.

source: This makes Vim break text to avoid lines getting longer than 78 characters.
es: Esto hace que Vim divida el texto para evitar que las líneas sean más largas de 78 caracteres.

source: But only for files that have been detected to be plain text.
es: Pero sólo para archivos que se han identificado como de texto regular.

source: There are actually two parts here.
es: Aqui hay dos aspectos.

source: "autocmd FileType text" is an autocommand.
es: «autocmd FileType text» es una autoorden.

source: This defines that when the file type is set to "text" the following command is automatically executed.
es: Esto define que cuando el tipo de archivo sea «texto», la orden posterior se ejecute automáticamente.

source: "setlocal textwidth=78" sets the 'textwidth' option to 78, but only locally in one file.
es: «setlocal textwidth=78» ajusta la opción 'textwidth' a 78, pero sólo localmente a un archivo.

source: Another autocommand.
es: Otra autoorden.

source: This time it is used after reading any file.
es: Esta vez se ejecuta tras leer cualquier archivo.

source: The complicated stuff after it checks if the '" mark is defined, and jumps to it if so.
es: Las cosas tan complicadas que hay después de él comprueban si la marca '" está definida, y salta hacia ella si lo está.
