Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: There are two items, one for comments starting with ">" and one for comments that start with "!". Both use the flag "n". This means that these comments nest. Thus a line starting with ">" may have another comment after the ">". This allows formatting a message like this:
es: Hay dos elementos, uno para los comentarios que empiezan con «>» y otro para los comentarios que comienzan con «!». Ambos usan la opción «n». Esto significa que estos comentarios se anidan. Por lo tanto, una línea comenzando con «>» puede tener otro comentario después de «>». Esto permite dar formato a un mensaje como este:

source: > ! Did you see that site? ~ > ! It looks really great. ~ > I don't like it. The ~ > colors are terrible. ~ What is the URL of that ~ site? ~
es: > ! ¿Has visto esa página web? ~ > ! Tiene un buen diseño. ~ > No me gusta. Los ~ > colores son horribles. ~ ¿Cual es la URL de esa ~ página web? ~

source: Try setting 'textwidth' to a different value, e.g., 80, and format the text by Visually selecting it and typing "gq". The result is:
es: Pruebe configurando 'textwidth' con un valor diferente, de 80, y formatee el texto seleccionándolo en modo Visual y escribiendo «gq». El resultado es:

source: > ! Did you see that site? It looks really great. ~ > I don't like it. The colors are terrible. ~ What is the URL of that site? ~
es: > ! ¿Has visto esa página web? Tiene un buen diseño. ~ > No me gusta. Los colores son horribles. ~ ¿Cual es la URL de esa página web? ~

source: You will notice that Vim did not move text from one type of comment to another. The "I" in the second line would have fit at the end of the first line, but since that line starts with "> !" and the second line with ">", Vim knows that this is a different kind of comment.
es: Notará que Vim no desplazó el texto de un tipo de comentario a otro. El «No» en la segunda línea puede encajar al final de la primera línea, pero ya que la línea comienza con «> !», y la segunda con «>», Vim detectará que es otro tipo de comentario.

source: A C comment starts with "/*", has "*" in the middle and "*/" at the end. The entry in 'comments' for this looks like this: >
es: Un comentario de C empieza con «/*», «*» en el medio, y «/*» al final. La entrada en 'comments' tendría este aspecto: >

source: The start is defined with "s1:/*". The "s" indicates the start of a three-piece comment. The colon separates the flags from the text by which the comment is recognized: "/*". There is one flag: "1". This tells Vim that the middle part has an offset of one space. The middle part "mb:*" starts with "m", which indicates it is a middle part. The "b" flag means that a blank must follow the text. Otherwise Vim would consider text like "*pointer" also to be the middle of a comment. The end part "ex:*/" has the "e" for identification. The "x" flag has a special meaning. It means that after Vim automatically inserted a star, typing / will remove the extra space.
es: El principio se define con «s1:/*». La «s» indica el principio de un comentario en tres partes. Los dos puntos separan las marcas del texto por el cual se detecta que es un comentario: «/*». Hay una marca, «1». Indica a Vim que la parte central tiene un «offset» de un espacio. La parte central «mb:*» comienza con «m», que indica que es la parte central. La opción «b» indica que el texto debe ir seguido de un espacio en blanco. En caso contrario, Vim considerará que el texto como «*pointer» también es la parte central de un comentario. La parte final «ex:*/» tiene «e» como identificador. La opción «x» tiene un significado especial. Indica que pulsar «/» eliminará el espacio adicional después de que Vim haya insertado automáticamente un asterisco, «*».

source: *usr_28.txt* For Vim version 7.3. Last change: 2008 Jun 14
es: *usr_28.esx* Para Vim versión 7.3. Último cambio: 8/2/2007

source: Folding
es: Plegar

source: |28.1| What is folding? |28.2| Manual folding |28.3| Working with folds |28.4| Saving and restoring folds |28.5| Folding by indent |28.6| Folding with markers |28.7| Folding by syntax |28.8| Folding by expression |28.9| Folding unchanged lines |28.10| Which fold method to use?
es: |28.1| ¿Qué es plegar? |28.2| Plegar manualmente |28.3| Trabajar con pliegues |28.4| Guardar y restaurar pliegues |28.5| Plegar por sangrado |28.6| Plegar con marcadores |28.7| Plegar por sintaxis |28.8| Plegar por expresión |28.9| Plegar líneas sin cambios |28.10¿| ¿Qué método de plegar debería usar?

source: Next chapter: |usr_29.txt| Moving through programs Previous chapter: |usr_27.txt| Search commands and patterns Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_29.esx| Moverse a través de programas Capítulo anterior: |usr_27.esx| Órdenes de búsqueda y patrones Tabla de contenidos: |usr_toc.esx|

source: *28.1* What is folding?
es: *28.1¿* ¿Qué es plegar?

source: Folding is used to show a range of lines in the buffer as a single line on the screen. Like a piece of paper which is folded to make it shorter:
es: Plegar se usa para mostrar un rango de líneas en un búfer como una sola línea en la pantalla. Como un trozo de papel plegado para acortarlo.

source: +------------------------+ | line 1 | | line 2 | | line 3 | |_______________________ | \ \ \________________________\ / folded lines / /________________________/ | line 12 | | line 13 | | line 14 | +------------------------+
es: +------------------------+ | línea 1 | | línea 2 | | línea 3 | |_______________________ | \ \ \________________________\ / líneas plegadas / /________________________/ | línea 12 | | línea 13 | | línea 14 | +------------------------+

source: The text is still in the buffer, unchanged. Only the way lines are displayed is affected by folding.
es: El texto aún está en el búfer, sin cambios. Plegar sólo afecta a la manera en que se muestran las líneas.

source: *28.2* Manual folding
es: *28.2* Plegar manualmente

source: You will see that the paragraph is replaced by a highlighted line. You have created a fold. |zf| is an operator and |ap| a text object selection. You can use the |zf| operator with any movement command to create a fold for the text that it moved over. |zf| also works in Visual mode.
es: Verá que una línea resaltada reemplaza al párrafo. Ha creado un pliegue. |zf| es un operando y |ap| una selección de un objeto textual. Puede usar el operando |zf| con cualquier orden de desplazamiento para crear un pliegue para el texto reemplazado. |zf| funciona también en el modo Visual.

source: All the folding commands start with "z". With some fantasy, this looks like a folded piece of paper, seen from the side. The letter after the "z" has a mnemonic meaning to make it easier to remember the commands:
es: Todas las órdenes de plegado empiezan con «z». Si usa la imaginación, se asemeja a un papel plegado visto de lado. La letra a continuación de «z» tiene un significado nemónico que facilita recordar las órdenes:

source: zf F-old creation zo O-pen a fold zc C-lose a fold
es: zf F-old creation (crear pliegue) zo O-pen a fold (abrir pliegue) zc C-lose a fold (cerrar pliegue)

source: Suppose you have created several folds, and now want to view all the text. You could go to each fold and type "zo". To do this faster, use this command: >
es: Imagine que ha creado varios pliegues, y que ahora desea ver todo el texto. Puede ir a cada pliegue y teclear «zo». Use la siguiente orden para hacer esto mismo con rapidez: >

source: This will R-educe the folding. The opposite is: >
es: Esto r_educe el plegado. Lo opuesto es: >

source: This folds M-ore. You can repeat "zr" and "zm" to open and close nested folds of several levels.
es: Esto pliega m_ás. Puede repetir «zr» y «zm» para abrir y cerrar pliegues anidados en varios niveles.

source: You can quickly disable the folding with the |zn| command. Then |zN| brings back the folding as it was. |zi| toggles between the two. This is a useful way of working: - create folds to get overview on your file - move around to where you want to do your work - do |zi| to look at the text and edit it - do |zi| again to go back to moving around
es: Puede desactivar el plegado rápidamente con la orden |zn|. |Zn| devuelve el plegado a su estado previo. |zi| pasa de uno a otro. Esta es una buena forma de trabajar: creación de pliegues para obtener una visión general de su archivo - desplazarse a las áreas que desea modificar - visionado y edición del texto con |zi| - repita |zi| para seguir desplazándose.

source: *28.3* Working with folds
es: *28.3* Trabajar con pliegues

source: When some folds are closed, movement commands like "j" and "k" move over a fold like it was a single, empty line. This allows you to quickly move around over folded text.
es: De haber algunos pliegues cerrados, las órdenes de movimiento como «j» y «k» se desplazarán sobre el pliegue como si fuese una única línea vacía. Esto permite un desplazamiento más rápido sobre texto plegado.

source: It is sometimes difficult to see or remember where a fold is located, thus where a |zo| command would actually work. To see the defined folds: >
es: A veces es difícil ver o recordar la ubicación de un pliegue; la orden |zo| es de utilidad en estos caso. Para ver los pliegues definidos: >

source: This will show a small column on the left of the window to indicate folds. A "+" is shown for a closed fold. A "-" is shown at the start of each open fold and "|" at following lines of the fold.
es: Esto muestra una pequeña columna a la izquierda de la ventana que indica los pliegues. Un «+» simboliza un pliegue cerrado. Un «-» aparece al principio de cada pliegue abierto y «|» simboliza líneas del pliegue a continuación.

source: You can use the mouse to open a fold by clicking on the "+" in the foldcolumn. Clicking on the "-" or a "|" below it will close an open fold.
es: Puede usar el ratón para abrir un pliegue pulsando sobre la «+» en la columna de plegado. Pulsar sobre «-» o el «|» que aparece debajo cierra un pliegue abierto.

source: To open all folds at the cursor line use |zO|. To close all folds at the cursor line use |zC|. To delete a fold at the cursor line use |zd|. To delete all folds at the cursor line use |zD|.
es: Use |zO| para abrir todos los pliegues en la línea del cursor. Use |zC| para cerrar todos los pliegues en la línea del cursor. Puede eliminar un pliegue en la línea del cursor con |zd|. Use |zD| para borrar todos los pliegues bajo la línea del cursor.

source: When in Insert mode, the fold at the cursor line is never closed. That allows you to see what you type!
es: La línea del cursor nunca se cierra en el modo Insertar. Esto permite ver lo que teclea.

source: Folds are opened automatically when jumping around or moving the cursor left or right. For example, the "0" command opens the fold under the cursor (if 'foldopen' contains "hor", which is the default). The 'foldopen' option can be changed to open folds for specific commands. If you want the line under the cursor always to be open, do this: >
es: Los pliegues se abren automáticamente al desplazarse o moviendo el cursor a la izquierda o a la derecha. Por ejemplo, la orden «0» abre el pliegue bajo el cursor (si 'foldopen' contiene 'hor', el valor predeterminado). Puede modificar la opción 'foldopen' para abrir los pliegues con órdenes específicas. Haga lo siguiente si desea que la línea bajo el cursor esté siempre abierta: >

source: Warning: You won't be able to move onto a closed fold then. You might want to use this only temporarily and then set it back to the default: >
es: Aviso: en esta situación, no será capaz de desplazarse a un pliegue cerrado. Puede que desea usar esto temporalmente para después devolverlo al valor original: >

source: This will re-apply 'foldlevel' to all folds that don't contain the cursor. You have to try it out if you like how this feels. Use |zm| to fold more and |zr| to fold less (reduce folds).
es: Esto ejecutará 'foldlevel' en todos los pliegues que no contengan el cursor. Tiene que probar para ver si le gusta. Use |zm| para plegar más, y |zr| para plegar menos (reducir los pliegues).

source: The folding is local to the window. This allows you to open two windows on the same buffer, one with folds and one without folds. Or one with all folds closed and one with all folds open.
es: El pliegue es local para la ventana. Esto permite abrir dos ventanas en el mismo búfer, uno con pliegues y otro sin ellos. O uno con todos los pliegues cerrados y otro con todos los pliegues abiertos.

source: *28.4* Saving and restoring folds
es: *28.4* Guardar y restaurar pliegues

source: When you abandon a file (starting to edit another one), the state of the folds is lost. If you come back to the same file later, all manually opened and closed folds are back to their default. When folds have been created manually, all folds are gone! To save the folds use the |:mkview| command: >
es: Al cerrar un archivo para iniciar la edición de otro, el estado del pliegue es eliminado. Si vuelve al mismo archivo más tarde, todos aquellos pliegues cerrados y abiertos manualmente volverán a su estado predeterminado. ¡Perderá todos los pliegues creados manualmente. Use la orden |:mkview| para guardar el estado de los archivos: >

source: This will store the settings and other things that influence the view on the file. You can change what is stored with the 'viewoptions' option. When you come back to the same file later, you can load the view again: >
es: Esto guardará la configuración y otras que cosas que modifican el visionado del archivo. Puede modificar lo guardado con la opción 'viewoptions'. Puede cargar el mismo visionado al volver al archivo más tarde: >

source: You can store up to ten views on one file. For example, to save the current setup as the third view and load the second view: >
es: Puede guardar hasta diez visionados distintos de un archivo. Por ejemplo, para guardar la configuración actual como el tercer visionado, y cargar después el segundo: >

source: Note that when you insert or delete lines the views might become invalid. Also check out the 'viewdir' option, which specifies where the views are stored. You might want to delete old views now and then.
es: Tenga en cuenta que, al insertar o eliminar líneas, las vistas dejarán de ser válidas. Revise también la opción 'viewdir', que define donde se guardan los visionados. Puede que desee eliminar viejos visionados de vez en cuando.

source: *28.5* Folding by indent
es: *28.5* Plegar según el sangrado

source: Defining folds with |zf| is a lot of work. If your text is structured by giving lower level items a larger indent, you can use the indent folding method. This will create folds for every sequence of lines with the same indent. Lines with a larger indent will become nested folds. This works well with many programming languages.
es: Definir pliegues con |zf| supone mucho trabajo. Si el texto está estructurado de forma que los elementos de un nivel inferior tienen un mayor sangrado, puede usar el método de pliegue por sangrado. Ésto crea pliegues para cada secuencia de líneas dentro del mismo sangrado. Las líneas con un sangrado mayor se convertirán en pliegues anidados. Esto funciona muy bien con varios lenguajes de programación.

source: Then you can use the |zm| and |zr| commands to fold more and reduce folding. It's easy to see on this example text:
es: Puede después usar las órdenes |zm| y |zr| para aumentar y reducir el plegado. Es fácil de ver con este texto de ejemplo:

source: This line is not indented This line is indented once This line is indented twice This line is indented twice This line is indented once This line is not indented This line is indented once This line is indented once
es: La línea no tiene sangrado Esta línea tiene un sangrado Esta línea tiene doble sangrado Esta línea tiene doble sangrado Esta línea tiene un sangrado La línea no tiene sangrado Esta línea tiene un sangrado Esta línea tiene un sangrado

source: Note that the relation between the amount of indent and the fold depth depends on the 'shiftwidth' option. Each 'shiftwidth' worth of indent adds one to the depth of the fold. This is called a fold level.
es: Tenga en cuenta que la relación entre la cantidad de sangrado y la profundidad del pliegue depende de la opción 'shiftwidth'. Cada 'shiftwidth' con el valor de un sangrado añade uno a la profundidad del pliegue. Este se denomina nivel de plegado.

source: When you use the |zr| and |zm| commands you actually increase or decrease the 'foldlevel' option. You could also set it directly: >
es: En realidad, cuando usa las órdenes |zr| y |zm| aumento o disminuye la opción 'foldlevel'. Puede también definirlo directamente: >

source: This means that all folds with three times a 'shiftwidth' indent or more will be closed. The lower the foldlevel, the more folds will be closed. When 'foldlevel' is zero, all folds are closed. |zM| does set 'foldlevel' to zero. The opposite command |zR| sets 'foldlevel' to the deepest fold level that is present in the file.
es: Esto significa que todos los pliegues con un sangrado tres veces el valor de 'shiftwidth' se cerrarán. Cuanto más bajo es 'foldlevel', más pliegues se cerrarán. Si el valor de 'foldlevel' es cero, se cerrarán todos los pliegues. |zM| define 'foldlevel' como cero. La orden opuesta |zR| define 'foldlevel' con el valor de nivel de pliegue más bajo presente en el archivo.

source: Thus there are two ways to open and close the folds: (A) By setting the fold level. This gives a very quick way of "zooming out" to view the structure of the text, move the cursor, and "zoom in" on the text again.
es: Por ello, hay dos maneras de abrir y cerrar los pliegues: (a) Definiendo el nivel de pliegue (foldlevel). Esto ofrece un rápida manera de alejar la vista para ver la estructura general del texto, desplazar el cursor, acercar la vista y de vuelta al texto otra vez.

source: (B) By using |zo| and |zc| commands to open or close specific folds. This allows opening only those folds that you want to be open, while other folds remain closed.
es: (B) Usando las órdenes |zo| y |zc| para abrir o cerrar pliegues específicos. Esto permite abrir sólo aquellos pliegues que desea abrir, manteniendo los otros cerrados.

source: This can be combined: You can first close most folds by using |zm| a few times and then open a specific fold with |zo|. Or open all folds with |zR| and then close specific folds with |zc|.
es: Esto se puede combinar: primero puede cerrar la mayoría de los pliegues usando |zm| unas cuantas veces, y después abrir un pliegue en particular con |zo|. O abrir todos los pliegues con |zR| y después cerrar pliegues específicos con |zc|.

source: *28.6* Folding with markers
es: *28.6* Plegar con marcadores

source: Notice that the folded line will display the text before the marker. This is very useful to tell what the fold contains.
es: Observe que la líena plegada mostrará el texto previo al marcador. Es útil para informar de los contenidos del pliegue.

source: It's quite annoying when the markers don't pair up correctly after moving some lines around. This can be avoided by using numbered markers. Example:
es: Es bastante molesto cuando los marcadores no encajan correctamente tras desplazar algunas líneas. Esto se puede evitar usando marcadores numerados. Ejemplo:

source: At every numbered marker a fold at the specified level begins. This will make any fold at a higher level stop here. You can just use numbered start markers to define all folds. Only when you want to explicitly stop a fold before another starts you need to add an end marker.
es: Un pliegue se iniciará con el nivel definido por cada marcador numerado. Esto detiene en este punto cualquier pliegue de nivel superior. Puede usar marcadores de inicio numerados para definir todos los pliegues. Tendrá que añadir un marcador de fin sólo cuando desee detener un pliegue antes de iniciar otro.

source: *28.7* Folding by syntax
es: *28.7* Plegar por sintaxis

source: *28.8* Folding by expression
es: *28.8* Plegar por expresión

source: This is similar to folding by indent, but instead of using the indent of a line a user function is called to compute the fold level of a line. You can use this for text where something in the text indicates which lines belong together. An example is an e-mail message where the quoted text is indicated by a ">" before the line. To fold these quotes use this: >
es: Es similar a plegar por sangrado pero usa una función de usuario para computar el nivel de pliegue de una línea, en lugar del sangrado. Puede usar esto con texto en el que éste indica qué líneas están juntas. Un ejemplo es un correo electrónico en el que el texto citado se indica con un «>» al inicio de la línea. Use esto para plegar esas citas: >

source: Explanation for the 'foldexpr' used in the example (inside out): getline(v:lnum) gets the current line substitute(...,'\\s','','g') removes all white space from the line substitute(...,'[^>].*','','') removes everything after leading '>'s strlen(...) counts the length of the string, which is the number of '>'s found
es: Explicación del 'foldexpr' usado en el ejemplo (de dentro a fuera): getline(v:lnum) obtiene la línea actual substitute(...,'\\s','','g') elimina los espacios blancos de la línea substitute(...,'[^>].*','','') elimina todo lo que '> precede strlen(...) cuenta la longitud de la cadena, el cual es el número de '>' encontrados.

source: Note that a backslash must be inserted before every space, double quote and backslash for the ":set" command. If this confuses you, do >
es: Tenga en cuenta que al usar la orden «:set» debe insertar una barra inversa antes de cada espacio, comilla doble y barra inversa. Si esto le confunde, haga >

source: to check the actual resulting value. To correct a complicated expression, use the command-line completion: >
es: para revisar el valor actual resultante. Para corregir una expresión compleja, use el auto completa de línea de órdenes: >

source: Where <Tab> is a real Tab. Vim will fill in the previous value, which you can then edit.
es: Aquí, <Tab> es una tabulación real. Vim rellenará el valor previo, el cual puede después editar.

source: *28.9* Folding unchanged lines
es: *28.9* Plegar líneas sin cambios

source: This is useful when you set the 'diff' option in the same window. The |vimdiff| command does this for you. Example: >
es: Es útil cuando define la opción 'diff' en la misma ventana. La orden |vimdiff| hace esto por usted. Ejemplo: >

source: Do this in every window that shows a different version of the same file. You will clearly see the differences between the files, while the text that didn't change is folded.
es: Haga esto en cada ventana que muestre una versión distinta del mismo archivo. Verá claramente las diferencias entre archivos, plegando a su vez aquellas líneas que no contienen cambios.

source: *28.10* Which fold method to use?
es: *28.10* ¿Qué método de plegado debería usar?

source: All these possibilities make you wonder which method you should choose. Unfortunately, there is no golden rule. Here are some hints.
es: Todas estas posibilidades le hacen preguntarse qué método escoger. Por desgracia, no existe ninguna regla de oro. Aquí tiene algunas pistas.

source: If there is a syntax file with folding for the language you are editing, that is probably the best choice. If there isn't one, you might try to write it. This requires a good knowledge of search patterns. It's not easy, but when it's working you will not have to define folds manually.
es: De existir un archivo de sintaxis con plegado para el lenguaje en el que está editando, puede que sea la mejor opción. De no ser así, puede intentar crear uno. Esto requiere un buen conocimiento de patrones de búsqueda. No resulta sencillo, pero una vez que funciona no tendrá definir los pliegues manualmente.
