Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: If you see a lot of error messages or Vim doesn't finish until the end, there must be something wrong.
es: Si ve muchos mensajes de error o Vim no continua hasta el final, puede que exista algún problema.

source: Either try to find out yourself, or find someone who can solve it.
es: Puede intentar encontrarlo manualmente, o encontrar a alguien que lo puede solucionar.

source: You could look in the |maillist-archive| for a solution.
es: También puede consultar la lista de correo (|maillist-archive|) en busca de una solución.

source: If everything else fails, you could ask in the vim |maillist| if someone can help you.
es: Si todo falla, puede preguntar en la lista de correo (|maillist|) de Vim si alguien le puede ayudar.

source: INSTALLING *install-home* If you want to install in your home directory, edit the Makefile and search for a line:
es: INSTALACIÓN *install-home* Si desea instalar Vim en su directorio personal (o «home»), edite el archivo «Makefile» y busque la siguiente línea:

source: Remove the # at the start of the line.
es: Elimine «#» al principio de la línea.

source: When installing for the whole system, Vim has most likely already selected a good installation directory for you.
es: Al instalar para todo el sistema, los más probable es que Vim haya seleccionado un directorio de instalación adecuado.

source: You can also specify one, see below.
es: También puede definir uno; vea a continuación.

source: You need to become root for the following.
es: Necesita ser el administrador para poder realizar lo siguiente.

source: That should move all the relevant files to the right place.
es: Esto debería mover todos los archivos relevantes al sitio adecuado.

source: Now you can try running vim to verify that it works.
es: Ahora puede intentar ejecutar Vim para comprobar que funciona.

source: Use two simple tests to check if Vim can find its runtime files: >
es: Use dos pruebas sencillas para comprobar que Vim puede encontrar sus archivos de tiempo de ejecución.

source: Don't forget that the user manual assumes you Vim in a certain way.
es: No olvide que el manual del usuario supone que usa Vim de una cierta manera.

source: After installing Vim, follow the instructions at |not-compatible| to make Vim work as assumed in this manual.
es: Tras instalar Vim, siga las instrucciones en |not-compatible| para que Vim funcione de la forma aceptada en este manual.

source: Vim has many ways to select features.
es: Vim ofrece varias formas de seleccionar funcionalidades.

source: One of the simple ways is to edit the Makefile.
es: Una de las más sencillas es editar el archivo «Makefile».

source: There are many directions and examples.
es: Hay muchas indicaciones y ejemplos.

source: Often you can enable or disable a feature by uncommenting a line.
es: Generalmente, puede activar o desactivar una funcionalidad simplemente descomentando una línea.

source: An alternative is to run "configure" separately.
es: Otra alternativa es ejecutar «configure» de forma separada.

source: This allows you to specify configuration options manually.
es: Le permite especificar opciones de configuración manualmente.

source: The disadvantage is that you have to figure out what exactly to type.
es: La desventaja es que tiene que averiguar qué teclear exactamente.

source: Some of the most interesting configure arguments follow.
es: A continuación tiene algunas de los argumentos más interesantes.

source: These can also be enabled from the Makefile.
es: También se pueden activar desde el archivo «Makefile».

source: --prefix={directory} Top directory where to install Vim.
es: --prefix={directorio} Directorio superior donde instalar Vim.

source: --with-features=tiny Compile with many features disabled.
es: --with-features=tiny Compilación con varias funcionalidades desactivadas.

source: --with-features=small Compile with some features disabled.
es: --with-features=small Compilación con algunas funcionalidades desactivadas.

source: --with-features=big Compile with more features enabled.
es: --with-features=big Compilación con más funcionalidades activadas.

source: --with-features=huge Compile with most features enabled.
es: --with-features=huge Compilación con la mayoría de funcionalidades activadas.

source: See |+feature-list| for which feature is enabled in which case.
es: Consulte |+feature-list| para ver qué funcionalidad está activa por omisión.

source: --enable-perlinterp Enable the Perl interface.
es: --enable-perlinterp Activa la interfaz de Perl.

source: There are similar arguments for ruby, python and tcl.
es: Existen argumentos similares para Ruby, Python y tcl.

source: --disable-gui Do not compile the GUI interface.
es: --disable-gui No compila la interfaz gráfica.

source: --without-x Do not compile X-windows features.
es: --without-x No compila las funcionalidades del sistema de ventanas X.

source: When both of these are used, Vim will not connect to the X server, which makes startup faster.
es: Si se usan las dos, Vim no se conectará al servidor de X, lo cual agiliza el inicio.

source: You can find a bit of explanation for each feature, and links for more information here: |feature-list|.
es: Puede encontrar una explicación de cada funcionalidad y enlaces a más información aquí: |feature-list|.

source: For the adventurous, edit the file "feature.h".
es: Para los atrevido, edite el archivo «feature.h».

source: You can also change the source code yourself!
es: ¡También puede modificar el código fuente directamente!

source: There are two ways to install the Vim program for Microsoft Windows.
es: Existen dos formas de instalar el programa Vim para Microsoft Windows.

source: You can uncompress several archives, or use a self-installing big archive.
es: Puede descomprimir varios archivos, o usar un sólo archivo de instalación automática.

source: Most users with fairly recent computers will prefer the second method.
es: La mayoría de usuarios con ordenadores relativamente recientes pueden preferir el segundo método.

source: For the first one, you will need:
es: Se requiere lo siguiente para usar el primero:

source: - An archive with binaries for Vim.
es: - Un archivo con binarios para Vim.

source: - The Vim runtime archive.
es: - El archivo de tiempo de ejecución («runtime) de Vim.

source: - A program to unpack the zip files.
es: - Un programa para desempaquetar los archivos zip.

source: Go to the "pc" directory and you'll find a list of files there.
es: Vaya al directorio «pc» y verá una lista de archivos.

source: The version number is embedded in the file name.
es: El número de versión se incluye en el nombre de archivo.

source: We will use "61" here, which is version 6.1.
es: En este documento se usará «61», la versión 6.1.

source: gvim61.exe The self-installing archive.
es: gvim61.exe El archivo de instalación automática.

source: This is all you need for the second method.
es: Esto es todo lo que necesita para el segundo método.

source: Just launch the executable, and follow the prompts.
es: Simplemente ejecute el archivo, y siga los diálogos.

source: For the first method you must chose one of the binary archives.
es: Debe escoger uno de los archivos binarios para realizar el primer método.

source: These are available:
es: Los siguientes están disponibles:

source: gvim61.zip The normal MS-Windows GUI version.
es: gvim61.zip La versión de interfaz gráfica normal de MS Windows.

source: gvim61ole.zip The MS-Windows GUI version with OLE support.
es: gvim61ole.zip La versión gráfica de MS Windows con compatibilidad con OLE.

source: Uses more memory, supports interfacing with other OLE applications.
es: Usa más memoria, permite interactuar con otras aplicaciones OLE.

source: vim61w32.zip 32 bit MS-Windows console version.
es: vim61w32.zip La versión de consola de 32 bit para MS Windows.

source: For use in a Win NT/2000/XP console.
es: Para el uso en una consola Win NT/2000/XP console.

source: Does not work well on Win 95/98.
es: No funciona bien en Win 95/98.

source: vim61d32.zip 32 bit MS-DOS version.
es: vim61d32.zip Versión de 32 bit para MS-DOS.

source: For use in the Win 95/98 console window.
es: Para el uso en una ventana de consola de Win 95/98.

source: vim61d16.zip 16 bit MS-DOS version.
es: vim61d16.zip Versión de 16 bit para MS-DOS.

source: Only for old systems.
es: Sólo para sistemas antiguos.

source: Does not support long filenames.
es: No permite el uso de nombres de archivo largos.

source: You only need one of them.
es: Sólo necesita uno de estos.

source: Although you could install both a GUI and a console version.
es: Aunque puede instalar la versión gráfica y una versión de intérprete de órdenes.

source: You always need to get the archive with runtime files.
es: Siempre necesita obtener el archivo con los archivos de tiempo de ejecución.

source: vim61rt.zip The runtime files.
es: vim61rt.zip Los archivos de tiempo de ejecución.

source: Use your un-zip program to unpack the files.
es: Use su programa un-zip para descomprimir lso archivos.

source: For example, using the "unzip" program: >
es: Por ejemplo, usando el programa «unzip»: >

source: This will unpack the files in the directory "c:\vim\vim61".
es: Éstas órdenes desempaquetarán los ficheros en el directorio «c:\vim\vim61».

source: If you already have a "vim" directory somewhere, you will want to move to the directory just above it.
es: Si ya tiene un directorio «vim», puede navegar al directorio superior a él.

source: Now change to the "vim\vim61" directory and run the install program: >
es: Ahora, entre al directorio «vim\vim61» y ejecute el programa de instalación: >

source: Carefully look through the messages and select the options you want to use.
es: Revise los mensajes con cuidado y seleccione las opciones que desea usar.

source: If you finally select "do it" the install program will carry out the actions you selected.
es: Si al final selecciona «do it», el programa de instalación llevará a cabo las acciones seleccionadas.

source: The install program doesn't move the runtime files.
es: El programa de instalación no reubica los archivos de tiempo de ejecución.

source: They remain where you unpacked them.
es: Permanecerán en el lugar en el que los desempaquetó.

source: In case you are not satisfied with the features included in the supplied binaries, you could try compiling Vim yourself.
es: En el caso de que no esté satisfecho con las características incluidas en los binarios proporcionados, puede intentar compilar Vim.

source: Get the source archive from the same location as where the binaries are.
es: Obtenga el archivo de fuentes de la misma ubicación de los binarios.

source: You need a compiler for which a makefile exists.
es: Necesitará un compilador que permita «makefiles».

source: Microsoft Visual C works, but is expensive.
es: Microsoft Visual C funciona, pero es caro.

source: The Free Borland command-line compiler 5.5 can be used, as well as the free MingW and Cygwin compilers.
es: Puede usar el compilador de línea de órdenes libre Borland 5.5, así como los compiladores libres MingW y Cygwin.

source: Check the file src/INSTALLpc.txt for hints.
es: Consulte el archivo «src/INSTALLpc.txt» para más indicaciones.

source: *90.3* Upgrading
es: *90.3* Actualizar

source: When you type "make install" the runtime files will be copied to a directory which is specific for this version.
es: Cuando teclea «make install», los ficheros de tiempo de ejecución se copiarán un directorio específico a la versión.

source: Thus they will not overwrite a previous version.
es: Por ello, no sobreescribirán una versión anterior.

source: This makes it possible to use two or more versions next to each other.
es: Esto permite usar dos o más versiones simultáneamente.

source: The executable "vim" will overwrite an older version.
es: El ejecutable «vim» sobreescribirá una versión anterior.

source: If you don't care about keeping the old version, running "make install" will work fine.
es: Si no le interesa preservar la versión más antigua, ejecutar «make install» funcionará sin problemas.

source: You can delete the old runtime files manually.
es: Puede eliminar los archivos de tiempo de ejecución manualmente.

source: Just delete the directory with the version number in it and all files below it.
es: Simplemente elimine el directorio con el número de versión y todos los archivos contenidos en él.

source: There are normally no changed files below this directory.
es: Generalmente, bajo este directorio no hay archivos modificados.

source: If you did change the "filetype.vim" file, for example, you better merge the changes into the new version before deleting it.
es: Si ha modificado el archivo «filetype.vim», por ejemplo, será mejor que introduzca esos cambios en la versión nueva antes de eliminar el archivo.

source: If you are careful and want to try out the new version for a while before switching to it, install the new version under another name.
es: Si es cuidadoso y desea probar la nueva versión durante un tiempo antes de cambiar a ella, instale la nueva versión bajo otro nombre.

source: You need to specify a configure argument.
es: Necesita especificar un argumento de configuración.

source: Before running "make install", you could use "make -n install" to check that no valuable existing files are overwritten.
es: Debería usar «make -n install» antes de ejecutar «make install» para comprobar que no se sobreescribirá ningún archivo valioso.

source: When you finally decide to switch to the new version, all you need to do is to rename the binary to "vim".
es: Cuando decida pasar a la nueva versión, todo lo que necesita hacer es renombrar el binario a «vim».

source: Upgrading is mostly equal to installing a new version.
es: Actualizar es casi idéntico a instalar una versión nueva.

source: Just unpack the files in the same place as the previous version.
es: Sencillamente desempaquete los archivos en la misma ubicación de la versión anterior.

source: A new directory will be created, e.g., "vim61", for the files of the new version.
es: Se creará un directorio nuevo, esto es, «vim61», para los archivos de la versión nueva.

source: Your runtime files, vimrc file, viminfo, etc. will be left alone.
es: Sus archivos de tiempo de ejecución, «vimrc» y «viminfo» no se modificarán.

source: If you want to run the new version next to the old one, you will have to do some handwork.
es: Si desea ejecutar la nueva versión junto a la antigua, tendrá que hacer algún trabajo manual.

source: Don't run the install program, it will overwrite a few files of the old version.
es: No ejecute el programa de instalación, ya que sobreescribirá algunos archivos de la versión antigua.

source: Execute the new binaries by specifying the full path.
es: Ejecute los binarios nuevos especificando la ruta completa.

source: The program should be able to automatically find the runtime files for the right version.
es: El programa debería averiguar automáticamente la ubicación de los archivos de tiempo de ejecución para la versión adecuada.

source: However, this won't work if you set the $VIMRUNTIME variable somewhere.
es: Por otra parte, no funcionará si define en algún lugar la variable «$VIMRUNTIME».

source: If you are satisfied with the upgrade, you can delete the files of the previous version.
es: Si la actualización le satisface, puede eliminar los archivos de la versión anterior.

source: See |90.5|.
es: Consulte |90.5|.

source: *90.4* Common installation issues
es: *90.4* Problemas de instalación habituales

source: This section describes some of the common problems that occur when installing Vim and suggests some solutions.
es: Esta sección describe algunos de los problemas más habituales al instalar Vim, y sugiere algunas soluciones.

source: It also contains answers to many installation questions.
es: También contiene respuestas a muchas preguntas sobre la instalación.

source: Q: I Do Not Have Root Privileges.
es: P: No tengo privilegios de administrador.

source: How Do I Install Vim?
es: ¿Cómo puedo instalar Vim?

source: This gives you a personal copy of Vim.
es: Esto genera una copia personal de Vim.

source: You need to put $HOME/bin in your path to execute the editor.
es: Necesita poner «$HOME/bin» en su ruta (variable PATH) para ejecutar el editor.

source: Also see |install-home|.
es: Consulte también |install-home|.

source: Q: The Colors Are Not Right on My Screen.
es: P: Los colores no son los correctos en mi pantalla.

source: If the terminal type listed is not correct, fix it.
es: Si el tipo de terminal listado no es el correcto, corríjalo.

source: For more hints, see |06.2|.
es: Para más indicaciones, consulte |06.2|.

source: Another solution is to always use the GUI version of Vim, called gvim.
es: Otra solución es usar siempre la versión gráfica de usuario de Vim, llamado gvim.

source: This avoids the need for a correct terminal setup.
es: Esto último evita la necesidad de una correcta configuración de terminal.

source: The definition of what key sends what code is very unclear for backspace <BS> and Delete <Del> keys.
es: La definición del código que cada tecla envía no está muy clara con las teclas de retroceso <BS> y eliminar <Del>.

source: First of all, check your $TERM setting.
es: Primero, compruebe su opción de configuración «$TERM».

source: If there is nothing wrong with it, try this: >
es: Si no detecta nada incorrecto: pruebe esto: >

source: In the first line you need to press CTRL-V and then hit the backspace key.
es: En la primera línea tiene que pulsar «CTRL-V» y después pulsar la tecla de retroceso.

source: In the second line you need to press CTRL-V and then hit the Delete key.
es: En la segunda, debe pulsar «CTRL-V» y pulsar la tecla de eliminar.

source: You can put these lines in your vimrc file, see |05.1|.
es: Puede poner estas líneas en su archivo «vimrc», consulte |05.1|.

source: A disadvantage is that it won't work when you use another terminal some day.
es: Una desventaja es que no funcionará cuando use otra terminal.

source: Look here for alternate solutions: |:fixdel|.
es: Consulte aquí las posibles soluciones: |:fixdel|.

source: Q: I Am Using RedHat Linux.
es: P: Uso RedHat Linux.

source: Can I Use the Vim That Comes with the System?
es: ¿Puedo usar la versión de Vim que viene con el sistema?

source: By default RedHat installs a minimal version of Vim.
es: Por omisión, RedHat instala una versión mínima de Vim.

source: Check your RPM packages for something named "Vim-enhanced-version.rpm" and install that.
es: Busque entre los paquetes RPM algo llamado «Vim-enhanced-version.rpm» e instale ese paquete.

source: Q: How Do I Turn Syntax Coloring On?
es: P: ¿Como se activa el resaltado de sintaxis?

source: How do I make plugins work?
es: ¿Como hago funcionar las extensiones?

source: Use the example vimrc script.
es: Use el script de ejemplo «vimrc».

source: You can find an explanation on how to use it here: |not-compatible|.
es: Encontrará una explicación de su uso en el siguiente apartado: |not-compatible|.

source: Many users have uploaded useful Vim scripts and plugins there.
es: Muchos usuarios han enviado útiles scripts de Vim y extensiones a esta ubicación de Internet.

source: There is an archive with hints from Vim users.
es: Hay un archivo con indicaciones de usuarios de Vim.

source: You might also want to search in the |maillist-archive|.
es: Puede que también desee buscar en el archivo de la lista de correo, |maillist-archive|.

source: *90.5* Uninstalling Vim
es: *90.5* Desinstalar Vim

source: When you installed Vim as a package, check your package manager to find out how to remove the package again.
es: Si ha instalado Vim como un paquete, compruebe su gestor de paquetes para averiguar cómo eliminar el paquete.

source: If you installed Vim from sources you can use this command: >
es: Si ha instalado Vim a partir de las fuentes, puede usar la siguiente orden: >

source: However, if you have deleted the original files or you used an archive that someone supplied, you can't do this.
es: Sin embargo, si ha eliminado los archivos originales, o ha usado un archivo que alguien le ha proporcionado, no podrá hacer esto.

source: Do delete the files manually, here is an example for when "/usr/local" was used as the root: >
es: Este es un ejemplo de desinstalación manual de Vim cuando «/usr/local» se ha usado como el directorio raíz.

source: If you installed Vim with the self-installing archive you can run the "uninstall-gui" program located in the same directory as the other Vim programs, e.g.
es: Si ha instalado Vim el archivo de instalación automática, puede ejecutar el programa «uninstall-gui», ubicado en el mismo directorio de otros programas de Vim.

source: "c:\vim\vim61".
es: Esto es, «c:\vim\vim61».

source: You can also launch it from the Start menu if installed the Vim entries there.
es: También puede iniciarlo desde el menú de aplicaciones si ha instalado las entradas de Vim.

source: This will remove most of the files, menu entries and desktop shortcuts.
es: Esto elimina la mayoría de los archivos, entradas de menú y enlaces directos.

source: Some files may remain however, as they need a Windows restart before being deleted.
es: Sin embargo, algunos archivos permanecerán en el sistema, ya que necesitan un reinicio de Windows antes de su eliminación.

source: You will be given the option to remove the whole "vim" directory.
es: Se le dará la opción de eliminar todo el directorio «vim».

source: It probably contains your vimrc file and other runtime files that you created, so be careful.
es: Probablemente, contiene su archivo «vimrc» y otros archivos de tiempo de ejecución que ha creado, tenga cuidado.

source: *gui_x11.txt* For Vim version 7.2.
es: *gui_x11.txt* Para Vim versión 7.2.

source: Last change: 2007 Dec 09
es: Último cambio: 2007 Dec 09

source: Vim's Graphical User Interface *gui-x11* *GUI-X11* *Athena* *Motif* 1.
es: Interfaz gráfica de usuario de Vim *gui-x11* *GUI-X11* *Athena* *Motif* 1.

source: Starting the X11 GUI |gui-x11-start| 2.
es: Iniciar GUI para X11 |gui-x11-start| 2.

source: GUI Resources |gui-resources| 3.
es: Recursos de la GUI |gui-resources| 3.

source: Shell Commands |gui-pty| 4.
es: Órdenes del intérprete de órdenes |gui-pty| 4.

source: Various |gui-x11-various| 5.
es: Varios |gui-x11-various| 5.

source: GTK version |gui-gtk| 6.
es: Versión GTK |gui-gtk| 6.

source: GNOME version |gui-gnome| 7.
es: Versión GNOME |gui-gnome| 7.

source: KDE version |gui-kde| 8.
es: Versión KDE |gui-kde| 8.

source: Compiling |gui-x11-compiling| 9.
es: Compilar |gui-x11-compiling| 9.

source: X11 selection mechanism |x11-selection|
es: Mecanismo de selección de X11 |x11-selection|

source: Starting the X11 GUI *gui-x11-start* *E665*
es: Iniciando la IGU de X11 *gui-x11-start* *E665*

source: So if you call the executable "gvim", or make "gvim" a link to the executable, then the GUI version will automatically be used.
es: Por ello, si invoca el ejecutable «gvim», o enlaza «gvim» al ejecutable, la interfaz gráfica se usará automáticamente.

source: Additional characters may be added after "gvim", for example "gvim-5".
es: Se pueden añadir caracteres adicionales tras «gvim», «gvim-5» por ejemplo.

source: *gui-fork* When the GUI is started, it does a fork() and exits the current process.
es: *gui-fork* Cuando inicia la GUI, crea un «fork()» y termina el proceso actual.

source: When gvim was started from a shell this makes the shell accept further commands.
es: Cuando se ha iniciado gvim desde un interprete de órdenes, esto hace que la consola pueda recibir futuras órdenes.
