Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: On the Macintosh, where <CR> is the line break character, it's possible to have a <LF> character halfway a line.
es: En un Macintosh, donde <CR> marca el retorno de línea, es posible obtener un caracter <LF> en mitad de la línea.

source: The result is that it's not possible to be 100% sure whether a file containing both <CR> and <LF> characters is a Mac or a Unix file.
es: El resultado es que no es posible estar totalmente seguro de si es un archivo MAC o UNIX al estar presentes ambos caracteres <CR> y <LF>.

source: Therefore, Vim assumes that on Unix you probably won't edit a Mac file, and doesn't check for this type of file.
es: Por ello, Vim asume que probablemente no editaría un archivo MAC bajo Unix, y no revisará el tipo del archivo.

source: To check for this format anyway, add "mac" to 'fileformats': >
es: Para revisar el formato de todas maneras, añada «mac» a 'fileformats'.

source: Then Vim will take a guess at the file format.
es: Vim intentará entonces dilucidar el formato del archivo.

source: Watch out for situations where Vim guesses wrong.
es: Esté atento a las situaciones en las que Vim erra en su conclusión.

source: The "++" string is an item that tells Vim that an option name follows, which overrules the default for this single command.
es: La cadena «++» es un elemento que informa a Vim de que a continuación hay un nombre de opción que invalida el valor predeterminado, sólo de esta orden.

source: "++ff" is used for 'fileformat'.
es: «++ff» se usa para 'fileformat'.

source: You could also use "++ff=mac" or "++ff=dos".
es: También puede usar «++ff=mac» o «++ff=dos».

source: This doesn't work for any option, only "++ff" and "++enc" are currently implemented.
es: Esto no funciona con cualquier opción, y sólo está implementado «++ff» y «++enc».

source: The full names "++fileformat" and "++encoding" also work.
es: Los nombres completos, «++fileformat» y «++encoding», también funcionan.

source: You can use the 'fileformat' option to convert from one file format to another.
es: Puede usar la opción 'fileformat' para convertir el formato de un archivo a otro.

source: Suppose, for example, that you have an MS-DOS file named README.TXT that you want to convert to UNIX format.
es: Suponga, por ejemplo, que tiene un archivo MS-DOS llamado README.TXT, que desea convertir al formato UNIX.

source: Start by editing the MS-DOS format file: > vim README.TXT
es: Comience editando el archivo de formato MS-DOS: > vim README.TXT

source: Vim will recognize this as a dos format file.
es: Vim reconocerá esto como un archivo de formato MS-DOS.

source: Now change the file format to UNIX: >
es: Ahora cambie el formato a UNIX: >

source: *23.2* Files on the internet
es: *23.2* Archivos en Internet

source: Someone sends you an e-mail message, which refers to a file by its URL.
es: Suponga que alguien le manda un correo electrónico que le remite a un archivo a través de su URL.

source: You can find the information here: ~ ftp://ftp.vim.org/pub/vim/README ~
es: Puedes encontrar la información aquí: ~ ftp://ftp.vim.org/pub/vim/README ~

source: You could start a program to download the file, save it on your local disk and then start Vim to edit it.
es: Puede iniciar un programa para descargar el archivo, guardarlo en su disco e iniciar Vim para editarlo.

source: There is a much simpler way.
es: Existe una manera mucho más simple.

source: Move the cursor to any character of the URL.
es: Desplace el cursor hacia cualquier carácter del URL.

source: Then use this command: >
es: Después ejecute esta orden: >

source: With a bit of luck, Vim will figure out which program to use for downloading the file, download it and edit the copy.
es: Con un poco de suerte, Vim escogerá qué programa usar para descargarse el archivo, lo descargará y editará la copia.

source: To open the file in a new window use CTRL-W f.
es: Para abrir el archivo en una ventana nueva use «CTRL-W f».

source: If something goes wrong you will get an error message.
es: Se le informará de cualquier incidencia en el proceso.

source: It's possible that the URL is wrong, you don't have permission to read it, the network connection is down, etc.
es: Es posible que el URL sea erróneo, que no tiene los permisos necesarios para leerlo, que la conexion a Internet se ha interrumpido, etc.

source: Unfortunately, it's hard to tell the cause of the error.
es: Desafortunadamente, es difícil conocer la causa del error.

source: You might want to try the manual way of downloading the file.
es: Puede que desee intentar una descarga manual.

source: Accessing files over the internet works with the netrw plugin.
es: El acceso a archivos en Internet es posible gracias a la extensión netrw.

source: Currently URLs with these formats are recognized:
es: A día de hoy se reconocen los siguientes formatos de URL:

source: ftp:// uses ftp rcp:// uses rcp scp:// uses scp http:// uses wget (reading only)
es: ftp:// usa ftp rcp:// usa rcp scp:// usa scp http:// usa wget (sólo lectura)

source: Vim doesn't do the communication itself, it relies on the mentioned programs to be available on your computer.
es: Vim no realiza la conexión por si mismo, sino que depende de que los programas mencionados estén instalados en su ordenador.

source: On most Unix systems "ftp" and "rcp" will be present.
es: La mayoría de los sistemas Unix incluyen ftp y rcp.

source: "scp" and "wget" might need to be installed.
es: Puede que tenga que instalar scp y wget.

source: Vim detects these URLs for each command that starts editing a new file, also with ":edit" and ":split", for example.
es: Vim detecta estas URL para cada orden que inicia la edición de un archivo nuevo, también con «:edit» y «:split», por ejemplo.

source: Write commands also work, except for http://.
es: Las órdenes de escritura también funcionan, a excepción de «http://».

source: *23.3* Encryption
es: *23.3* Cifrado

source: vim -x exam.txt
es: vim -x examen.txt

source: Enter encryption key: ~
es: Introduzca la clave de cifrado: ~

source: Carefully type the secret key now.
es: Escriba ahora la clave con cuidado.

source: You cannot see the characters you type, they will be replaced by stars.
es: No puede ver los caracteres que teclea, sino que serán reemplazados por estrellas.

source: To avoid the situation that a typing mistake will cause trouble, Vim asks you to enter the key again:
es: Para evitar problemas debidos a un error mecanográfico, Vim le pedirá que introduzca la clave otra vez:

source: Enter same key again: ~
es: Introduzca la misma clave de cifrado otra vez: ~

source: You can now edit this file normally and put in all your secrets.
es: Ahora puede editar este archivo con normalidad e introducir en él todos sus secretos.

source: When you finish editing the file and tell Vim to exit, the file is encrypted and written.
es: Cuando haya terminado de editar el archivo este se guarda y es cifrado.

source: When you edit the file with Vim, it will ask you to enter the same key again.
es: Cuando edite el archivo con Vim, éste le pedirá que introduzca la contraseña otra vez.

source: You don't need to use the "-x" argument.
es: No necesita emplear el argumento «-x».

source: You can also use the normal ":edit" command.
es: Puede también usar la orden «:edit».

source: Vim adds a magic string to the file by which it recognizes that the file was encrypted.
es: Vim añade una cadena mágica al archivo con el cual reconoce que el archivo está cifrado.

source: If you try to view this file using another program, all you get is garbage.
es: Obtendrá sólo basura si intenta editar este archivo con otro programa.

source: Also, if you edit the file with Vim and enter the wrong key, you get garbage.
es: Así mismo, si lo abre con Vim pero introduce mal la contraseña también obtendrá basura.

source: Vim does not have a mechanism to check if the key is the right one (this makes it much harder to break the key).
es: Vim no posee un mecanismo para revisar si la clave es correcta (lo cual hace más difícil descifrar la clave).

source: To disable the encryption of a file, set the 'key' option to an empty string: > :set key=
es: Para desactivar el cifrado de un archivo, configure la opción 'key' con una cadena vacía: > :set key=

source: The next time you write the file this will be done without encryption.
es: La siguiente vez que escriba el archivo, ésto se hará sin cifrado.

source: Setting the 'key' option to enable encryption is not a good idea, because the password appears in the clear.
es: Configurar la opción 'key' para activar el cifrado no es una buena idea ya que la contraseña aparece sin ocultar.

source: Anyone shoulder-surfing can read your password.
es: Cualquier persona leyendo por encima de su hombro puede leer su contraseña.

source: To avoid this problem, the ":X" command was created.
es: La orden «:X» se creó para evitar este problema.

source: It asks you for an encryption key, just like the "-x" argument did: >
es: Le pide una clave de cifrado, al igual que hizo el argumento «-x»: >

source: :X Enter encryption key: ****** Enter same key again: ******
es: :X Introduzca la clave de cifrado: ****** Introduzca la misma clave de cifrado otra vez: ******

source: The encryption algorithm used by Vim is weak.
es: El algoritmo de cifrado de Vim es débil.

source: It is good enough to keep out the casual prowler, but not good enough to keep out a cryptology expert with lots of time on his hands.
es: Es suficiente para mantener alejado al merodeador de turno, pero no lo es para mantener alejado a un experto en cifrado con mucho tiempo libre.

source: Also you should be aware that the swap file is not encrypted; so while you are editing, people with superuser privileges can read the unencrypted text from this file.
es: Debe ser consciente de que el archivo de de intercambio («swap») no está cifrado; por ello, al editar, personas con privilegios de superusuario pueden leer el texto sin cifrar en este archivo.

source: One way to avoid letting people read your swap file is to avoid using one.
es: Una manera de evitar que le gente lea su archivo de intercambio es evitar tener uno.

source: If the -n argument is supplied on the command line, no swap file is used (instead, Vim puts everything in memory).
es: Si introduce el argumento «-n» en la linea de órdenes, no se usará ningún archivo de intercambio (en lugar de ello, volcará todo en la memoria).

source: For example, to edit the encrypted file "file.txt" without a swap file use the following command: >
es: Por ejemplo, para editar el archivo cifrado «archivo.txt» si un archivo de intercambio, use la siguiente orden: >

source: vim -x -n file.txt
es: vim -x -n archivo.txt

source: Since there is no swapfile, recovery will be impossible.
es: Es imposible recuperar un archivo si no existe un archivo de intercambio.

source: Save the file a bit more often to avoid the risk of losing your changes.
es: Guarde los datos en el archivo más regularmente para evitar perder sus cambios .

source: While the file is in memory, it is in plain text.
es: Un archivo está en texto simple mientras esté en memoria.

source: Anyone with privilege can look in the editor's memory and discover the contents of the file.
es: Cualquiera con los privilegios necesarios puede mirar en la memoria del editor y descubrir los contenidos del archivo.

source: If you use a viminfo file, be aware that the contents of text registers are written out in the clear as well.
es: Si está usando un archivo viminfo, sea consciente de que los contenidos del registro del texto también se escriben de manera abierta.

source: If you really want to secure the contents of a file, edit it only on a portable computer not connected to a network, use good encryption tools, and keep the computer locked up in a big safe when not in use.
es: Si realmente desea proteger los contenidos de un archivo, edítelo sólo en un ordenador portátil sin conexión a ninguna red, use buenas herramientas de cifrado, y guarde el ordenador en una gran caja fuerte cuando no esté en uso.

source: *23.4* Binary files
es: *23.4* Archivos binarios

source: You can edit binary files with Vim.
es: Puede editar archivos binarios con Vim.

source: Vim wasn't really made for this, thus there are a few restrictions.
es: Vim no se creó para esta labor, y por ello hay ciertas restricciones.

source: But you can read a file, change a character and write it back, with the result that only that one character was changed and the file is identical otherwise.
es: Pero puede leer el archivo, cambiar un carácter y escribir esto en el archivo, con el resultado de que sólo cambió un carácter y que, en todo lo demás, el archivo es idéntico.

source: To make sure that Vim does not use its clever tricks in the wrong way, add the "-b" argument when starting Vim: >
es: Para impedir que Vim use sus ingeniosos trucos de manera inapropiada, añada el argumento «-b» al iniciar Vim: >

source: vim -b datafile
es: vim -b archivo_de_datos

source: This sets the 'binary' option.
es: Esto activa la opción 'binary'.

source: The effect of this is that unexpected side effects are turned off.
es: El efecto que tiene es que se desactivan ciertos efectos secundarios inesperados.

source: For example, 'textwidth' is set to zero, to avoid automatic formatting of lines.
es: Por ejemplo, 'textwidth' recibe un valor 0, para evitar el formateo automático de las líneas.

source: And files are always read in Unix file format.
es: Y los archivos se leen siempre en el formato de archivo UNIX.

source: Binary mode can be used to change a message in a program.
es: El modo binario se puede usar para cambiar el mensaje de un programa.

source: Be careful not to insert or delete any characters, it would stop the program from working.
es: Tenga cuidado de no insertar o eliminar cualquier carácter, ya que impediría el funcionamiento del programa.

source: Use "R" to enter replace mode.
es: Use «-R» para pasar al modo «replace» (reemplazar).

source: Many characters in the file will be unprintable.
es: Muchos caracteres en el archivo no se pueden imprimir.

source: To see them in Hex format: >
es: Para verlos en formato Hex: >

source: Otherwise, the "ga" command can be used to see the value of the character under the cursor.
es: Por otro lado, puede usar la orden «ga» para ver el valor del carácter bajo el cursor.

source: The output, when the cursor is on an <Esc>, looks like this:
es: La salida, si el cursor está sobre un <Esc>, tiene este aspecto:

source: There might not be many line breaks in the file.
es: Puede que no haya demasiados retornos de línea en el archivo.

source: To get some overview switch the 'wrap' option off: >
es: Para obtener una visión de conjunto, desactive la opción 'wrap': >

source: Col 9-16 of 9-16; Line 277 of 330; Word 1806 of 2058; Byte 10580 of 12206 ~
es: Col 9-16 of 9-16; Línea 277 of 330; Palabra 1806 de 2058; Byte 10580 de 12206 ~

source: The last two numbers are the byte position in the file and the total number of bytes.
es: Los dos últimos números son el byte posición en el archivo y el número total de bytes.

source: This takes into account how 'fileformat' changes the number of bytes that a line break uses.
es: Tiene en cuenta cómo 'fileformat' cambia el número de bytes que emplea un retorno de línea.

source: To move to a specific byte in the file, use the "go" command.
es: Para desplazarse a un byte específico en el archivo, use la orden «go».

source: For example, to move to byte 2345: >
es: Por ejemplo, para ir al byte 2345: >

source: A real binary editor shows the text in two ways: as it is and in hex format.
es: Un editor realmente binario muestra el texto de dos formas: tal cual y en formato hexadecimal.

source: You can do this in Vim by first converting the file with the "xxd" program.
es: Vim hace esto posible si primero convierte el archivo con el programa «xxd».

source: This comes with Vim.
es: Este programa está incluido en Vim.

source: First edit the file in binary mode: >
es: Primero edite el archivo en modo binario: >

source: You can now view and edit the text as you like.
es: Ahora puede ver y editar el texto como desee.

source: Vim treats the information as ordinary text.
es: Vim trata la información como texto normal.

source: Changing the hex does not cause the printable character to be changed, or the other way around.
es: Cambiar el valor hexadecimal no provoca un cambio en el carácter imprimible, o vicecersa.

source: Finally convert it back with: > :%!xxd -r
es: Por último, conviertalo otra vez con: > :%!xxd -r

source: Only changes in the hex part are used.
es: Sólo se usan los cambios en la parte hexadecimal.

source: Changes in the printable text part on the right are ignored.
es: Los cambios en la parte imprimible de texto se ignoran.

source: *23.5* Compressed files
es: *23.5* Archivos comprimidos

source: Vim uses the mentioned programs to do the actual compression and decompression.
es: Vim realiza la compresión y descompresión mediante los programas mencionados.

source: You might need to install the programs first.
es: Puede que primero tenga instalar los programas.

source: *usr_24.txt* For Vim version 7.3.
es: *usr_24.esx* Para Vim versión 7.3.

source: Last change: 2006 Jul 23
es: Último cambio: 23/6/2006

source: Inserting quickly
es: Insertar con rapidez

source: When entering text, Vim offers various ways to reduce the number of keystrokes and avoid typing mistakes.
es: Al introducir texto, Vim ofrece varias maneras de reducir el número de teclas que pulsa, evitando teclear errores.

source: Use Insert mode completion to repeat previously typed words.
es: Use el modo de autocompletado del modo Insertar para repetir palabras anteriormente tecleadas.

source: Abbreviate long words to short ones.
es: Abrevie las palabras largas.

source: Type characters that aren't on your keyboard.
es: Teclee caracteres que no están en su teclado.

source: |24.1| Making corrections |24.2| Showing matches |24.3| Completion |24.4| Repeating an insert |24.5| Copying from another line |24.6| Inserting a register |24.7| Abbreviations |24.8| Entering special characters |24.9| Digraphs |24.10| Normal mode commands
es: |24.1| Corregir |24.2| Mostrar coincidencias |24.3| Autocompletado |24.4| Repetir una inserción |24.5| Copiar desde otra línea |24.6| Insertar un registro |24.7| Abreviaturas |24.8| Introducir caracteres especiales |24.9| Dígrafos |24.10| Órdenes del modo Normal

source: Next chapter: |usr_25.txt| Editing formatted text Previous chapter: |usr_23.txt| Editing other files Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_25.txt| Editar texto con formato Capitulo anterior: |usr_23.esx| Editar otros archivos Tabla de contenidos: |usr_toc.esx|

source: *24.1* Making corrections
es: *24.1* Corregir

source: The <BS> key was already mentioned.
es: La tecla <BS> ya se ha mencionado.

source: It deletes the character just before the cursor.
es: Borra el carácter que precede al cursor.

source: The <Del> key does the same for the character under (after) the cursor.
es: La tecla <Del> hace lo mismo con el carácter debajo (después) del cursor.

source: When you typed a whole word wrong, use CTRL-W:
es: Use CTRL-W en caso de haber tecleado una palabra completamente errónea:

source: The horse had fallen to the sky ~ CTRL-W The horse had fallen to the ~
es: El caballo cayó del cielo ~ CTRL-W El caballo cayó del ~

source: If you really messed up a line and want to start over, use CTRL-U to delete it.
es: En caso de haber realizado errores en una línea, y desea empezar otra vez, use CTRL-U para eliminarlo.

source: This keeps the text after the cursor and the indent.
es: Esto mantiene el texto después del cursor, así como la tabulación.

source: Only the text from the first non-blank to the cursor is deleted.
es: Sólo se elimina el texto desde el primer espacio que no esté vacío hasta el cursor.

source: With the cursor on the "f" of "fallen" in the next line pressing CTRL-U does this:
es: Pulsar CTRL-U con el cursor sobre la «c» de «cayó» hace lo siguiente:

source: The horse had fallen to the ~ CTRL-U fallen to the ~
es: El caballo cayó del cielo ~ CTRL-W cayó del ~

source: When you spot a mistake a few words back, you need to move the cursor there to correct it.
es: Cuando detecta un error en alguna palabra anterior, necesita desplazar el cursor hasta ese punto para corregirlo.

source: For example, you typed this:
es: Por ejemplo, escribió lo siguiente:

source: The horse had follen to the ground ~
es: El caballo cayu al suelo ~

source: You need to change "follen" to "fallen".
es: Necesita cambiar «cayo» a «cayó».

source: With the cursor at the end, you would type this to correct it: >
es: Con el cursor al final, teclearía esto para corregirlo: >

source: <Esc>4blraA
es: <Esc>3blróA

source: < get out of Insert mode <Esc> four words back 4b move on top of the "o" l replace with "a" ra restart Insert mode A
es: < Abandonar el modo insertar <Esc> Cuatro palabras hacia atrás 3b Desplazarse a la «u» l Reemplazar con «ó» ró Reiniciar modo insertar A

source: <C-Left><C-Left><C-Left><C-Left><Right><Del>a<End>
es: <C-Izq><C-Izq><C-Izq><Derecha><Derecha><Derecha><Supr>ó<Fin>

source: < four words back <C-Left><C-Left><C-Left><C-Left> move on top of the "o" <Right> delete the "o" <Del> insert an "a" a go to end of the line <End>
es: < Tres palabras hacia atrás <C-Izq><C-Izq><C-Izq> Desplazarse a la «u» <Derecha><Derecha><Derecha> Borrar la «u» <Supr> Insertar una «ó» ó Ir al final de la línea <Fin>

source: This uses special keys to move around, while remaining in Insert mode.
es: Esto emplea teclas especiales para el desplazamiento, a la vez que permanece en el modo Insertar.

source: This resembles what you would do in a modeless editor.
es: Esto se parece a lo que haría con un editor sin modos.

source: It's easier to remember, but takes more time (you have to move your hand from the letters to the cursor keys, and the <End> key is hard to press without looking at the keyboard).
es: Es más fácil de recordar, pero lleva más tiempo (tiene que mover sus manos de las letras a las teclas del cursor, y es difícil pulsar la tecla <Fin> sin mirar el teclado).

source: These special keys are most useful when writing a mapping that doesn't leave Insert mode.
es: Estas teclas especiales son más útiles cuando escribe una macro que no abandona el modo Insertar.

source: The extra typing doesn't matter then.
es: El tecleo adicional no importa en este caso.

source: An overview of the keys you can use in Insert mode:
es: Este es un resumen de las teclas que puede usar en el modo Insertar:

source: <C-Home> to start of the file <PageUp> a whole screenful up <Home> to start of line <S-Left> one word left <C-Left> one word left <S-Right> one word right <C-Right> one word right <End> to end of the line <PageDown> a whole screenful down <C-End> to end of the file
es: <C-Inicio> al principio del archivo <Repág> subir una pantalla <Inicio> al inicio de la línea <S-Izq> una palabra a la izquierda <C-Izq> una palabra a la izquierda <S-Der> una palabra a la derecha <C-Der> una palabra a la derecha <Fin> al final de la línea <Avpág> bajar una pantalla <C-Fin> al final del archivo

source: *24.2* Showing matches
es: *24.2* Mostrar coincidencias

source: When you type a ) it would be nice to see with which ( it matches.
es: Al teclear una «)» estaría bien ver con qué «(» encaja.

source: To make Vim do that use this command: >
es: Para hacer que Vim use esta orden: >
