Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: At this point, you tell Vim to complete the word using the command CTRL-P. Vim searches for a word that starts with what's in front of the cursor. In this case, it is "ch_", which matches with the word ch_array. So typing CTRL-P gives you the following:
es: En este punto es cuando le dice a Vim que complete la palabra usando la orden CTRL-P. Vim buscará una palabra que empiece con lo que se aparece frente al cursor. En este caso, es «ch_», el cual encaja con la palabra «ch_array». Por ello, teclear CTRL-P le daría lo siguiente:

source: If you now type CTRL-P Vim will search again for a word that completes the word before the cursor. Since there is nothing in front of the cursor, it finds the first word backwards, which is "ch_array". Typing CTRL-P again gives you the next word that matches, in this case "total". A third CTRL-P searches further back. If there is nothing else, it causes the editor to run out of words, so it returns to the original text, which is nothing. A fourth CTRL-P causes the editor to start over again with "ch_array".
es: Si pulsa ahora CTRL-P, Vim buscará otra vez una palabra que complete la que se haya frente al cursor. Ya que no hay nada en frente del cursor, busca la palabra en sentido inverso, el cual es «ch_array». Pulsar CTRL-P otra vez le daría la siguiente palabra que encaja, en este caso «total». Si lo pulsa por tercera vez, Vim buscará aún más atrás. Si no hay nada más, al editor se le acabarían las palabras, volviendo al texto original, que es nada. Un cuarto CTRL-P causaría al editor empezar otra vez con «ch_array».

source: To search forward, use CTRL-N. Since the search wraps around the end of the file, CTRL-N and CTRL-P will find the same matches, but in a different sequence. Hint: CTRL-N is Next-match and CTRL-P is Previous-match.
es: Use CTRL-N para una búsqueda hacia delante. Ya que la búsqueda vuelve al inicio cuando llega al final del archivo, CTRL-N y CTRL-P encontrarán las mismas coincidencias, pero en distinto orden. Pista: CTRL-N es siguiente coincidencia («Next-match») y CTRL-P es la coincidencia anterior («Previous-match»).

source: The Vim editor goes through a lot of effort to find words to complete. By default, it searches the following places:
es: Vim realiza un gran esfuerzo por encontrar palabras que completar. Por omisión, busca en los siguientes lugares:

source: 1. Current file 2. Files in other windows 3. Other loaded files (hidden buffers) 4. Files which are not loaded (inactive buffers) 5. Tag files 6. All files #included by the current file
es: 1. Archivo actual 2. Archivos en otras ventanas 3. Otros archivos cargados (búfers ocultos) 4. Archivos que no están cargados (búfers inactivos) 5. Archivos de etiquetas 6. Todos los archivos #incluidos en el archivo actual

source: The 'ignorecase' option is used. When it is set, case differences are ignored when searching for matches.
es: La opción 'ignorecase' es empleada. Las diferencias entre mayúsculas y minúsculas se ignorarán al buscar coincidencias de activar esta opción.

source: A special option for completion is 'infercase'. This is useful to find matches while ignoring case ('ignorecase' must be set) but still using the case of the word typed so far. Thus if you type "For" and Vim finds a match "fortunately", it will result in "Fortunately".
es: 'infercase' es una opción especial para el autocompletado. Es útil para encontrar parejas cuando ignora la sensibilidad a mayúsculas y minúsculas (debe activar 'ignorecase') , y seguir usando con esta palabra la mencionada sensibilidad. Por ello, si teclea «Para» y Vim encuentra «paramilitar», el resultado final será «Paramilitar».

source: CTRL-X CTRL-F file names CTRL-X CTRL-L whole lines CTRL-X CTRL-D macro definitions (also in included files) CTRL-X CTRL-I current and included files CTRL-X CTRL-K words from a dictionary CTRL-X CTRL-T words from a thesaurus CTRL-X CTRL-] tags CTRL-X CTRL-V Vim command line
es: CTRL-X CTRL-F Nombres de archivo CTRL-X CTRL-L Líneas completas CTRL-X CTRL-D Definiciones de macros (también en archivos incluidos) CTRL-X CTRL-I Archivo actual e incluidos CTRL-X CTRL-K Palabras de un diccionario CTRL-X CTRL-T Palabras de un tesauro CTRL-X CTRL-] Etiquetas CTRL-X CTRL-V Línea de órdenes de Vim

source: After each of them CTRL-N can be used to find the next match, CTRL-P to find the previous match. More information for each of these commands here: |ins-completion|.
es: Puede usar CTRL-N después de cada uno de estas órdenes para hallar la siguiente coincidencia, y CTRL-P para hallar la anterior. Para más información acerca de estas órdenes, consulte |ins-completion|.

source: Let's take CTRL-X CTRL-F as an example. This will find file names. It scans the current directory for files and displays each one that matches the word in front of the cursor. Suppose, for example, that you have the following files in the current directory:
es: Tomemos CTRL-X CTRL-F como ejemplo. Esto busca nombres de archivo. Examina el directorio actual en busca de archivos, y muestra cada uno que encaja con la palabra frenet al cursor. Suponga, por ejemplo, que tiene las siguientes líneas en el directorio actual:

source: The exit code is in the file sub ~
es: El código de salida está en el archivo sub ~

source: At this point, you enter the command CTRL-X CTRL-F. Vim now completes the current word "sub" by looking at the files in the current directory. The first match is sub_count.c. This is not the one you want, so you match the next file by typing CTRL-N. This match is sub_done.c. Typing CTRL-N again takes you to sub_exit.c. The results:
es: En este momento, introduzca la orden CTRL-X CTRL-F. Vim completará la palabra «sub» mirando en los ficheros en el directorio actual. La primera coincidencia es «sub_count.c». Esto no es lo que buscaba, así que busca la siguiente pareja pulsando CTRL-N. La coincidencia es «sub_done.c». Teclear CTRL-N otra vez le devolvería a «sub_exit.c». El resultado:

source: The exit code is in the file sub_exit.c ~
es: El código de salida está en el archivo sub_exit.c ~

source: If the file name starts with / (Unix) or C:\ (MS-Windows) you can find all files in the file system. For example, type "/u" and CTRL-X CTRL-F. This will match "/usr" (this is on Unix):
es: Si el nombre de archivo empieza con «/» (Unix) o «C:\» (MS-Windows), puede buscar todos los archivos en el sistema de archivos. Por ejemplo, teclee «/u» y CTRL-X CTRL-F. Esto buscará «/usr» (en Unix):

source: the file is found in /usr/ ~
es: El archivo se encuentra en "/usr/" ~

source: If you now press CTRL-N you go back to "/u". Instead, to accept the "/usr/" and go one directory level deeper, use CTRL-X CTRL-F again:
es: Si ahora pulsa CTRL-N volvería a «/u». En lugar de ello, para aceptar «/usr/» y descender un nivel en el árbol de directorios, use otra vez CTRL-X CTRL-F:

source: the file is found in /usr/X11R6/ ~
es: El archivo se encuentra en /usr/X11R6/~

source: The results depend on what is found in your file system, of course. The matches are sorted alphabetically.
es: Los resultados varían según lo que se encuentra en su sistema de archivos. Las coincidencias aparecen alfabéticamente.

source: Source code files are well structured. That makes it possible to do completion in an intelligent way. In Vim this is called Omni completion. In some other editors it's called intellisense, but that is a trademark.
es: Los archivos de código están bien estructurados. Esto posibilita un autocompletado inteligente. En Vim, esto se llama autocompletado global («Omni completion»). Algunos otros editores lo llaman intellisense, pero eso es una marca.

source: The key to Omni completion is CTRL-X CTRL-O. Obviously the O stands for Omni here, so that you can remember it easier. Let's use an example for editing C source:
es: La tecla para el autocompletado global es CTRL-X CTRL-O. Obviamente, la «O» significa «Omni», para recordarla mejor. Usemos un ejemplo para editar código C:

source: The cursor is after "p->". Now type CTRL-X CTRL-O. Vim will offer you a list of alternatives, which are the items that "struct foo" contains. That is quite different from using CTRL-P, which would complete any word, while only members of "struct foo" are valid here.
es: El cursor está después de «p->». Pulse ahora CTRL-X CTRL-O. Vim le ofrecerá una lista de alternativas, los cuales son los elementos que contiene «struct foo». Esto es diferente al uso de CTRL-P, el cual completa cualquier palabra, mientras que aquí sólo son válidos los miembros de «struct foo».

source: For Omni completion to work you may need to do some setup. At least make sure filetype plugins are enabled. Your vimrc file should contain a line like this: > filetype plugin on Or: > filetype plugin indent on
es: Necesita realizar alguna configuración para que funcione el autocompletado global. Asegúrese al menos de que las extensiones de tipo de archivo (filetype) están activadas. El archivo vimrc debería tener esta línea: > filetype plugin on O: > filetype plugin indent on

source: For C code you need to create a tags file and set the 'tags' option. That is explained |ft-c-omni|. For other filetypes you may need to do something similar, look below |compl-omni-filetypes|. It only works for specific filetypes. Check the value of the 'omnifunc' option to find out if it would work.
es: Necesita crear un archivo de etiquetas y definir la opción 'tags' si desea editar código C. Consulte |ft-c-omni|. Puede que tenga que realizar algo similar para otros tipos de archivo, consulte más adelante |compl-omni-filetypes|. Sólo funciona para ciertos tipos de archivo. Revise el valor de la opción 'omnifunc' para ver si funcionaría.

source: *24.4* Repeating an insert
es: *24.4* Repetir una inserción

source: If you press CTRL-A, the editor inserts the text you typed the last time you were in Insert mode. Assume, for example, that you have a file that begins with the following:
es: Si pulsa CTRL-A, el editor insertará el texto que tecleó la última que estaba en el modo Insertar. Suponga, por ejemplo, que tiene un archivo que empieza con lo siguiente:

source: "file.h" ~ /* Main program begins */ ~
es: "file.h" ~ /* El programa principal comienza */ ~

source: #include "file.h" ~ /* Main program begins */ ~
es: #include "file.h" ~ /* El programa principal comienza */ ~

source: You go down to the beginning of the next line using the commands "j^". You now start to insert a new "#include" line. So you type: >
es: Puede bajar hasta el inicio de la siguiente línea con las órdenes «j^». Ahora puede empezar a insertar una nueva línea «include». Asi que escribe: >

source: The result is as follows:
es: El resultado es el siguiente:

source: #include "file.h" ~ #include /* Main program begins */ ~
es: #include "file.h" ~ #include /* El programa principal comienza */ ~

source: The "#include " was inserted because CTRL-A inserts the text of the previous insert. Now you type "main.h"<Enter> to finish the line:
es: «#include» se insertó porque CTRL-A inserta el texto de la inserción anterior. Teclee ahora «main.h» <Enter> para finalizar la línea:

source: #include "file.h" ~ #include "main.h" ~ /* Main program begins */ ~
es: #include "file.h" ~ #include "main.h" ~ /* El programa principal comienza */ ~

source: The CTRL-@ command does a CTRL-A and then exits Insert mode. That's a quick way of doing exactly the same insertion again.
es: La orden CTRL-@ realiza un CTRL-A y abandona el modo Insertar. Esta es una manera rápida de hacer la misma inserción otra vez.

source: *24.5* Copying from another line
es: *24.5* Copiar desde otra línea

source: The CTRL-Y command inserts the character above the cursor. This is useful when you are duplicating a previous line. For example, you have this line of C code:
es: La orden CTRL-Y inserta el carácter sobre el cursor. Esto es útil si está duplicando una línea anterior. Por ejemplo, tiene esta línea de código C:

source: Now you need to type the same line, but with "s_prev" instead of "s_next". Start the new line, and press CTRL-Y 14 times, until you are at the "n" of "next":
es: Ahora necesita escribir la misma línea, pero con un «s_prev» en lugar de «s_next». Inicie una nueva línea, y pulse CTRL-Y 14 veces, hasta encontrarse en la «n» de «next»:

source: *24.6* Inserting a register
es: *24.6* Insertar un registro

source: The command CTRL-R {register} inserts the contents of the register. This is useful to avoid having to type a long word. For example, you need to type this:
es: La orden CTRL-R {registro} inserta el contenido de un registro. Esto es útil para evitar escribir una palabra larga. Por ejemplo, necesita teclear esto:

source: r = VeryLongFunction(a) + VeryLongFunction(b) + VeryLongFunction(c) ~
es: r = FunciónMuyLarga(a) + FunciónMuyLarga(b) + FunciónMuyLarga(c) ~

source: The function name is defined in a different file. Edit that file and move the cursor on top of the function name there, and yank it into register v: >
es: El nombre de la función se define en otro archivo. Edite ese archivo y desplace el cursor sobre el nombre de función presente, y copie el mismo al registro v:

source: "v is the register specification, "yiw" is yank-inner-word. Now edit the file where the new line is to be inserted, and type the first letters:
es: «"v» es el especificador del registro, «yiw» signifia copiar la palabra interior («yank inner word»). Edite ahora el archivo donde se insertará la línea, y escriba las primeras letras:

source: r = VeryLongFunction ~
es: r = FunciónMuyLarga ~

source: You continue to type the characters in between the function name, and use CTRL-R v two times more. You could have done the same with completion. Using a register is useful when there are many words that start with the same characters.
es: Continua insertando caracteres en medio del nombre de la función, y usa «CTRL-R v» dos veces más. Podría haber realizado lo mismo con el autocompletado. Usar un registro es útil cuando hay varias palabras que empiezan con el mismo carácter.

source: If the register contains characters such as <BS> or other special characters, they are interpreted as if they had been typed from the keyboard. If you do not want this to happen (you really want the <BS> to be inserted in the text), use the command CTRL-R CTRL-R {register}.
es: Si el registro contiene caracteres tales como <BS> o otros caracteres especiales, se interpretarán como introducidos a través del teclado. Si no desea que esto ocurra (realmente quiere que <BS> acabe insertado en el texto), use la orden CTRL-R CTRL-R {registro}.

source: *24.7* Abbreviations
es: *24.7* Abreviaturas

source: An abbreviation is a short word that takes the place of a long one. For example, "ad" stands for "advertisement". Vim enables you to type an abbreviation and then will automatically expand it for you. To tell Vim to expand "ad" into "advertisement" every time you insert it, use the following command: >
es: Una abreviatura es una palabra corta que sustituye a otra más larga. Por ejemplo, «poli» simboliza «policía». Vim le permite insertar una abreviatura para después expandirla automáticamente. Para decir a Vim que expanda «poli» a «policía» cada vez que lo inserte, use la siguiente orden: >

source: :iabbrev ad advertisement
es: :iabbrev poli policía

source: Now, when you type "ad", the whole word "advertisement" will be inserted into the text. This is triggered by typing a character that can't be part of a word, for example a space:
es: Ahora, cuando escribe «po», aparecerá la palabra completa «policía» en el texto. Esto se activa cuando teclea un carácter que no puede ser parte de una palabra, como por ejemplo un espacio:

source: What Is Entered What You See I saw the a I saw the a ~ I saw the ad I saw the ad ~ I saw the ad<Space> I saw the advertisement<Space> ~
es: Texto introducido Lo que ve Vi al p Vi al p ~ Vi al po Vi al po ~ Vi al po<Espacio> Vi al policía<Espacio> ~

source: The expansion doesn't happen when typing just "ad". That allows you to type a word like "add", which will not get expanded. Only whole words are checked for abbreviations.
es: La expansión no ocurre si solo escribe «po». Esto permite escribir una palabra como «polifacético», que no se expandirá. Solo se revisan palabras completas con abreviaturas.

source: It is possible to define an abbreviation that results in multiple words. For example, to define "JB" as "Jack Benny", use the following command: >
es: Es posible definir una abreviatura cuyo resultado sean varias palabras. Por ejemplo, para definir «JB» como «Juan Benítez», use la siguiente orden: >

source: :iabbrev JB Jack Benny
es: :iabbrev JB Juan Benítez

source: These are used for creating boxed comments. The comment starts with #b, which draws the top line. I then type the comment text and use #e to draw the bottom line. Notice that the #e abbreviation begins with a space. In other words, the first two characters are space-star. Usually Vim ignores spaces between the abbreviation and the expansion. To avoid that problem, I spell space as seven characters: <, S, p, a, c, e, >.
es: Uso esto para crear comentarios en cajas. El comentario empieza con «#b», el cual escribe la línea superior. Después escribo el texto del comentario y uso «#e» para dibujar la línea inferior. Observe que la abreviatura «#e» empieza con un espacio. En otras palabras, los primeros dos caracteres son espacio-asterisco. Por lo general, Vim ignora los espacios entre la abreviatura y la expansión. Para evitar tal problema, deletreo espacio («space») como siete caracters: <, S, p, a, c, e,>.

source: Note: ":iabbrev" is a long word to type. ":iab" works just as well. That's abbreviating the abbreviate command!
es: Nota: La palabra «:iabbrev» es algo larga. «:iab» también daría resultado. ¡Esto es abreviar la orden de abreviar!

source: It's very common to make the same typing mistake every time. For example, typing "teh" instead of "the". You can fix this with an abbreviation: >
es: Es bastante normal escribir siempre el mismo error. Por ejemplo, escribir «qeu» en lugar de «que». Puede arreglar esto con una abreviatura: >

source: :abbreviate teh the
es: :abbreviate qeu que

source: You can add a whole list of these. Add one each time you discover a common mistake.
es: Puede crear una lista completa de ejemplos como este. Añada uno cada vez que descubra un error común.

source: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Jack Benny i ad advertisement ! teh the
es: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Juan Benítez i po policía ! qeu que

source: The "i" in the first column indicates Insert mode. These abbreviations are only active in Insert mode. Other possible characters are:
es: La «i» en la primera columna indica modo Insertar. Estas abreviaturas sólo están activas en el modo Insertar. Otros caracteres posibles son:

source: Since abbreviations are not often useful in Command-line mode, you will mostly use the ":iabbrev" command. That avoids, for example, that "ad" gets expanded when typing a command like: >
es: Debido a que las abreviaturas no son útiles en el modo Línea de órdenes, usará más regularmente la orden «:iabbrev». Esto evita, por ejemplo, que se expanda «po» al escribir una orden como: >

source: :edit ad
es: :edit po

source: To get rid of an abbreviation, use the ":unabbreviate" command. Suppose you have the following abbreviation: >
es: Para eliminar una abreviatura, use la orden «:unabbreviate». Suponga que tiene la siguiente abreviatura: >

source: :abbreviate @f fresh
es: :abbreviate @f fresco

source: While you type this, you will notice that @f is expanded to "fresh". Don't worry about this, Vim understands it anyway (except when you have an abbreviation for "fresh", but that's very unlikely). To remove all the abbreviations: >
es: Notará al escribir esto que @f se expande a «fresco». No se preocupe, Vim lo entiende de todas formas (a menos que tenga una abreviatura «fresco», pero eso es improbable). Para eliminar todas las abreviaturas: >

source: There is one thing to watch out for when defining an abbreviation: The resulting string should not be mapped. For example: >
es: Existe un aspecto a tener en cuenta a la hora de definir una abreviatura: no debería asignar la cadena resultante a una macro. Por ejemplo: >

source: When you now type @a, you will get "adisk-doorer". That's not what you want. To avoid this, use the ":noreabbrev" command. It does the same as ":abbreviate", but avoids that the resulting string is used for mappings: >
es: Si ahora teclea @a, obtendrá «adisk-doorer». Esto no es lo que quiere. Para evitarlo, use la orden «:noabbrev». Hace lo mismo que «:abbreviate», pero evita que la cadena resultante se use en macros.

source: *24.8* Entering special characters
es: *24.8* Introducir caracteres especiales

source: The CTRL-V command is used to insert the next character literally. In other words, any special meaning the character has, it will be ignored. For example: >
es: La orden CTRL-V se emplea para insertar el siguiente carácter de forma literal. En otras palabras, se ignorará el significado especial de cualquier carácter. Por ejemplo: >

source: Inserts an escape character. Thus you don't leave Insert mode. (Don't type the space after CTRL-V, it's only to make this easier to read).
es: Esta orden inserta un carácter de escapado. Por ello, no abandona el modo Insertar. (No escriba un espacio después de CTRL-V, sólo lo hace más fácil de leer).

source: Note: On MS-Windows CTRL-V is used to paste text. Use CTRL-Q instead of CTRL-V. On Unix, on the other hand, CTRL-Q does not work on some terminals, because it has a special meaning.
es: Nota: En MS-Windows, CTRL-V se emplea para pegar texto. Use CTRL-Q en lugar de CTRL-V. Por otra parte, Unix no reconoce CTRL-Q en algunas terminales, porque tiene un significado especial.

source: You can also use the command CTRL-V {digits} to insert a character with the decimal number {digits}. For example, the character number 127 is the <Del> character (but not necessarily the <Del> key!). To insert <Del> type: >
es: También puede usar la orden CTRL-V {dígitos} para insertar un carácter con el número decimal {dígitos}. Por ejemplo, el carácter número 127 es el carácter <Del> (Supr) (¡pero no necesariamente la tecla <Supr>!). Escriba lo siguiente para insetar <Del>.

source: You can enter characters up to 255 this way. When you type fewer than two digits, a non-digit will terminate the command. To avoid the need of typing a non-digit, prepend one or two zeros to make three digits. All the next commands insert a <Tab> and then a dot:
es: Puede introducir hasta el carácter 255 de esta manera. Cuando escribe menos de dos dígitos, un no-dígito finalizará la orden. Para evitar la necesidad de escribir un no-dígito, añada uno o dos ceros para sumar tres dígitos. Todas las ordenes a continuación insertan primero un <Tab> y después un punto:

source: This also goes up to character 255 (CTRL-V xff). You can use "o" to type a character as an octal number and two more methods allow you to type up to a 16 bit and a 32 bit number (e.g., for a Unicode character): >
es: Esto también llega al carácter 255 (CTRL-V xff). También puede usar «o» para escribir un carácter como un número octal, y otros dos métodos le permiten escribir hasta un número en 16 y 32 bit (p, ej., un carácter Unicode): >

source: *24.9* Digraphs
es: *24.9* Dígrafos

source: Vim will display the digraph table. Here are three lines of it:
es: Vim mostrará la tabla de dígrafos. Aquí puede ver tres líneas:
