Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Now every tab is displayed as ^I. And a $ is displayed at the end of each line, so that you can spot trailing spaces that would otherwise go unnoticed. A disadvantage is that this looks ugly when there are many Tabs in a file. If you have a color terminal, or are using the GUI, Vim can show the spaces and tabs as highlighted characters. Use the 'listchars' option: >
es: Ahora todas las pestañas se mostrarán como ^I. Un «$» se mostrará al final de cada línea, permitiéndole ver espacios finales que de otra forma pasarían desapercibidos. Una desventaja de esto es que tiene una apariencia desagradable cuando hay muchas pestañas. Si tiene una terminal con colores o usa GVim, puede ver los espacios y las pestañas como marcas de color. Use la opción 'listchars': >

source: Now every tab will be displayed as ">---" (with more or less "-") and trailing white space as "-". Looks a lot better, doesn't it?
es: Ahora cada pestaña se mostrará como «>---» (con más o menos «-») y los espacios al final de la línea como «-». Más agradable, o no?

source: The "@" stands for all alphabetic letters. "48-57" stands for ASCII characters 48 to 57, which are the numbers 0 to 9. "192-255" are the printable latin characters. Sometimes you will want to include a dash in keywords, so that commands like "w" consider "upper-case" to be one word. You can do it like this: >
es: El «@» implica todas las letras del alfabeto. «48-57» significa los caracteres ASCII 48 a 57, que son los números 0 a 9. «192-255» son los caracteres latinos imprimibles. A veces querrá incluir un guión en las palabras clave, para que órdenes como «w» consideren «upper-case» como una sola palabra. Puede hacerlo así: >

source: If you look at the new value, you will see that Vim has added a comma for you. To remove a character use "-=". For example, to remove the underscore: >
es: Si miras el nuevo valor, comprobará que Vim ha añadido una coma por Ud. Para eliminar un carácter usa «-=». Por ejemplo, el guión bajo: >

source: When Vim starts there is one line at the bottom that is used for messages. When a message is long, it is either truncated, thus you can only see part of it, or the text scrolls and you have to press <Enter> to continue. You can set the 'cmdheight' option to the number of lines used for messages. Example: >
es: Cuando Vim arranca hay una línea en la parte de abajo que se usa para mensajes. Cuando un mensaje es largo, o se trunca (con lo que sólo puede ver una parte) o el texto se desplaza y tienes que pulsar <Intro> para continuar. Puedes asignar a la opción 'cmdheight' el número de líneas usado para mensajes. Por ejemplo: >

source: *usr_32.txt* For Vim version 7.3. Last change: 2010 Jul 20
es: *usr_32.esx* Para Vim versión 7.3. Último cambio: 20/6/2010

source: The undo tree
es: El árbol de deshacer

source: Vim provides multi-level undo. If you undo a few changes and then make a new change you create a branch in the undo tree. This text is about moving through the branches.
es: Vim ofrece varios niveles de deshacer. Si deshace unos cuantos cambios y después realiza uno nuevo, creará una rama en el árbol de deshacer. El texto a continuación trata acerca de desplazarse por las ramas.

source: |32.1| Undo up to a file write |32.2| Numbering changes |32.3| Jumping around the tree |32.4| Time travelling
es: |32.1| Volver a un punto de edición anterior |32.2| Numerar los cambios |32.3| Desplazarse en el árbol |32.4| Viajar en el tiempo

source: Next chapter: |usr_40.txt| Make new commands Previous chapter: |usr_31.txt| Exploiting the GUI Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_40.esx| Crear órdenes nuevas Capítulo anterior: |usr_31.esx| Aprovechar la interfaz gráfica Tabla de contenidos: |usr_toc.esx|

source: *32.1* Undo up to a file write
es: *32.1* Volver a un punto de edición anterior

source: Sometimes you make several changes, and then discover you want to go back to when you have last written the file. You can do that with this command: >
es: A veces realiza una serie de cambios, y se da cuenta que desea volver al punto en el que editó el archivo por última vez. Puede hacer esto con la siguiente orden: >

source: You can repeat this command to go further back in the past. Or use a count different from 1 to go back faster.
es: Puede repetir esta orden para retroceder aun más. O usar un número diferente de 1 para retroceder más rápido.

source: Note that these commands really work in time sequence. This matters if you made changes after undoing some changes. It's explained in the next section.
es: Tenga en cuenta que estas órdenes funcionan secuencialmente. Importa si realiza cambios después de deshacer otros. Se explica en la siguiente sección.

source: Also note that we are talking about text writes here. For writing the undo information in a file see |undo-persistence|.
es: Tenga también en cuenta que nos referimos a ediciones de texto. Para escribir la información de deshacer de en un archivo, consulte |undo-persistence|.

source: *32.2* Numbering changes
es: *32.2* Numerar los cambios

source: In section |02.5| we only discussed one line of undo/redo. But it is also possible to branch off. This happens when you undo a few changes and then make a new change. The new changes become a branch in the undo tree.
es: En la sección |02.5| sólo tratamos una línea temporal de deshacer o rehacer. Pero también es posible crear una nueva «rama». Ocurre cuando deshace algunos cambios y después realiza un nuevo cambio. Los cambios nuevos se convierten en una rama del árbol de deshacer.

source: Let's start with the text "one". The first change to make is to append " too". And then move to the first 'o' and change it into 'w'. We then have two changes, numbered 1 and 2, and three states of the text:
es: Empecemos con el texto «one». El primer cambio es añadir «too». Después, ir a la primera «o» y cambiarla a «w». Tenemos ahora dos cambios, 1 y 2, y tres estados del texto:

source: You can now use the |u| command to undo. If you do this twice you get to "one". Use |CTRL-R| to redo, and you will go to "one too". One more |CTRL-R| takes you to "me too". Thus undo and redo go up and down in the tree, using the branch that was last used.
es: Ahora puede usar la orden |u| para deshacer. Si lo hace dos veces, obtendrá «one». Use |CTRL-R| para rehacer, y obtendrá «one too». Pulsar |CTRL-R| una vez más le lleva a «me too». Esto es, deshacer y rehacer suben y bajan un árbol usando la rama usada por última vez.

source: What matters here is the order in which the changes are made. Undo and redo are not considered changes in this context. After each change you have a new state of the text.
es: Lo que importa es el orden de las cambios. Deshacer y rehacer no se consideran cambios en este contexto. Tras cada cambio tiene un nuevo estado del texto.

source: Note that only the changes are numbered, the text shown in the tree above has no identifier. They are mostly referred to by the number of the change above it. But sometimes by the number of one of the changes below it, especially when moving up in the tree, so that you know which change was just undone.
es: Tenga en cuenta que sólo se enumeran los cambios, y el texto que aparece en el árbol anterior no tiene identificador. Se hace referencia a ellos según el número del cambio por encima suyo. Pero, a veces, según el número por debajo de él, particularmente al subir el árbol, para así saber qué cambio se ha deshecho recientemente.

source: *32.3* Jumping around the tree
es: *32.3* Desplazarse en el árbol

source: So how do you get to "one two" now? You can use this command: >
es: ¿Cómo podemos obtener «one two» ahora? Puede usar esta orden: >

source: The text is now "one two", you are below change 2. You can use the |:undo| command to jump to below any change in the tree.
es: Ahora, el texto es «one two», y está bajo el cambio 2. Puede usar la orden |:undo| para saltar a cualquier cambio dentro del árbol.

source: Now you change your mind and want to go back to "me too". Use the |g-| command. This moves back in time. Thus it doesn't walk the tree upwards or downwards, but goes to the change made before.
es: Ahora cambia de idea, y desea volver a «me too». Use la orden |g-|. Esto vuelve a un momento anterior. No se desplaza por el árbol en una dirección u otra, sino que vuelve al último cambio realizado.

source: You can repeat |g-| and you will see the text change: me too ~ one two ~ one too ~ one ~
es: Puede repetir |g-| y ver como cambia el texto: me too ~ one two ~ one too ~ one ~

source: Use |g+| to move forward in time: one ~ one too ~ one two ~ me too ~ not two ~
es: Use |g+| para ir hacia delante en el tiempo: one ~ one too ~ one two ~ me too ~ not two ~

source: Using |:undo| is useful if you know what change you want to jump to. |g-| and |g+| are useful if you don't know exactly what the change number is.
es: Usar |:undo| es útil si sabe a qué cambio quiere pasar. |g-| y |g+| son útiles si no sabe exactamente el número del cambio.

source: *32.4* Time travelling
es: *32.4* Viajar en el tiempo

source: When you have been working on text for a while the tree grows to become big. Then you may want to go to the text of some minutes ago.
es: Cuando ha estado trabajando en el texto durante un rato el árbol crece hasta ser bastante grande. Así, puede que desee volver a como era el texto hace unos minutos.

source: :undolist < number changes time ~ 3 2 16 seconds ago 4 3 5 seconds ago
es: :undolist < número cambios hora ~ 3 2 hace 16 segundos 4 3 hace 5 segundos

source: Here you can see the number of the leaves in each branch and when the change was made. Assuming we are below change 4, at "not two", you can go back ten seconds with this command: >
es: Aquí puede ver el número de hojas en cada rama el momento en que se realizó el cambio. Suponiendo que estamos bajo el nivel 4, en «not two», puede retroceder 10 segundos con la siguiente orden:

source: Depending on how much time you took for the changes you end up at a certain position in the tree. The |:earlier| command argument can be "m" for minutes, "h" for hours and "d" for days. To go all the way back use a big number: >
es: Dependiendo del tiempo que le tomó realizar los cambios, acabará en una posición determinada del árbol. El argumento de la orden |:earlier| puede ser «m», de minutos, «h» de horas y «d» de días. Para volver al principio use un número grande: >

source: If you want even more details, or want to manipulate the information, you can use the |undotree()| function. To see what it returns: >
es: Si desea más detalles, o manipular la información, puede usar la función |undotree()|. Para ver qué devuelve: >

source: *usr_25.txt* For Vim version 7.3. Last change: 2007 May 11
es: *usr_25.esx* Para Vim versión 7.3. Último cambio: 11/6/2007

source: Editing formatted text
es: Editar texto con formato

source: Text hardly ever comes in one sentence per line. This chapter is about breaking sentences to make them fit on a page and other formatting. Vim also has useful features for editing single-line paragraphs and tables.
es: El texto rara vez aparece como una oración por línea. Este capítulo trata acerca de formatear oraciones para su correcta apariencia en un papel, así como otros formatos. Vim también ofrece útiles características para editar párrafos de una sola línea y tablas-

source: |25.1| Breaking lines |25.2| Aligning text |25.3| Indents and tabs |25.4| Dealing with long lines |25.5| Editing tables
es: |25.1| Dividir líneas |25.2| Alinear texto |25.3| Sangrado y tabulación |25.4| Tratar líneas largas |25.5| Editar tablas

source: Next chapter: |usr_26.txt| Repeating Previous chapter: |usr_24.txt| Inserting quickly Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_26.txt| Repetición Capítulo anterior: |usr_24.esx| Insertar con rapidez Tabla de contenidos: |usr_toc.esx|

source: *25.1* Breaking lines
es: *25.1* Dividir líneas

source: 1 2 3 12345678901234567890123456789012345 I taught programming for a whi ~
es: 1 2 3 12345678901234567890123456789012345 Enseñé programación durante un ~

source: If you type "l" next, this makes the line longer than the 30-character limit. When Vim sees this, it inserts a line break and you get the following:
es: Si teclea ahora «os», la línea sobrepasaría el límite de 30 caracteres. En cuanto Vim detecta esto, inserta un salto línea, obteniendo lo siguiente:

source: 1 2 3 12345678901234567890123456789012345 I taught programming for a ~ whil ~
es: 1 2 3 12345678901234567890123456789012345 Enseñé programación durante ~ unos ~

source: Note: The 'wrap' option makes Vim display lines with a line break, but this doesn't insert a line break in the file.
es: Nota: La opción 'wrap' hace que Vim muestre las líneas con un salto de línea, pero no inserta realmente un salto de línea.

source: The Vim editor is not a word processor. In a word processor, if you delete something at the beginning of the paragraph, the line breaks are reworked. In Vim they are not; so if you delete the word "programming" from the first line, all you get is a short line:
es: El editor Vim no es un editor de documentos. En un editor de documentos, si elimina algo al inicio del párrafo, se reorganizan los saltos de línea. No es así en Vim; así que se borra la palabra «programación» en la primera línea, obtendría los siguiente:

source: This does not look good. To get the paragraph into shape you use the "gq" operator. Let's first use this with a Visual selection. Starting from the first line, type: >
es: Esto no es elegante. Para dar formato a un párrafo puede usar el operador «gq». Usemos esto primero con una selección en modo Visual. Empezando por la primera línea, escriba: >

source: "v" to start Visual mode, "4j' to move to the end of the paragraph and then the "gq" operator. The result is:
es: «v» inicial el modo Visual, «4j» para desplazarse al final del párrafo, y después el operador «gq». El resultado es:

source: "ap" stands for "a-paragraph". This formats the text of one paragraph (separated by empty lines). Also the part before the cursor. If you have your paragraphs separated by empty lines, you can format the whole file by typing this: >
es: «ap» significa un párrafo («a-paragraph»). Esto da formato al texto de un párrafo (separado por líneas vacías). También el área anterior al cursor. Si los párrafos están separados por líneas vacías, puede dar formato a todo el archivo con lo siguiente: >

source: "gg" to move to the first line, "gqG" to format until the last line. Warning: If your paragraphs are not properly separated, they will be joined together. A common mistake is to have a line with a space or tab. That's a blank line, but not an empty line.
es: «gg» para ir a la primera línea, «gqG» para dar formato hasta la última línea. Aviso: si sus párrafos no están apropiadamente separados, no se unirán. Un error común es tener una línea con un espacio o tabulación. Esa es una línea en blanco, pero no una línea vacía.

source: Vim is able to format more than just plain text. See |fo-table| for how to change this. See the 'joinspaces' option to change the number of spaces used after a full stop. It is possible to use an external program for formatting. This is useful if your text can't be properly formatted with Vim's builtin command. See the 'formatprg' option.
es: Vim es capaz de dar formato a más que texto. Consulte |fo-table| para ver cómo cambiar esto. Consulte la opción 'joinspaces' para modificar el número de espacios antes de un punto final. Es posible dar formato con un programa externo. Esto es útil si el texto no puede recibir un formato adecuado con la orden integrada en Vim. Consulte la opción 'formatprg'.

source: *25.2* Aligning text
es: *25.2* Alinear texto

source: {range} is the usual command-line range. [width] is an optional line width to use for centering. If [width] is not specified, it defaults to the value of 'textwidth'. (If 'textwidth' is 0, the default is 80.) For example: >
es: {range} (rango) is el valor de rango normal en la línea de órdenes. [width] (ancho) es el valor opcional del ancho usado al centrar. De no especificar [width], su valor por omisión será el de 'textwidth'. (Si 'textwith' es cero, el valor será 80.) Por ejemplo: >

source: Vim has no built-in way of justifying text. However, there is a neat macro package that does the job. To use this package, execute the following command: >
es: Vim no posee una herramienta integrada para justificar texto. Por otro lado, ofrece un excelente macro que realiza esta labor. Ejecute la siguiente orden para usar este conjunto: >

source: This Vim script file defines a new visual command "_j". To justify a block of text, highlight the text in Visual mode and then execute "_j". Look in the file for more explanations. To go there, do "gf" on this name: $VIMRUNTIME/macros/justify.vim.
es: Este archivo script de Vim define una nueva orden visual, «_j». Para justificar un bloque de texto, resalte el texto en modo Visual y ejecute «_j». Consulte el archivo para una explicación más completa. Para ir a ese punto, pulse «gf» en este nombre: $VIMRUNTIME/macros/justify.vim.

source: An alternative is to filter the text through an external program. Example: >
es: Una alternativa es filtrar el texto a través de un programa externo. Ejemplo: >

source: *25.3* Indents and tabs
es: *25.3* Sangrado y tabulación

source: Indents can be used to make text stand out from the rest. The example texts in this manual, for example, are indented by eight spaces or a tab. You would normally enter this by typing a tab at the start of each line. Take this text: the first line ~ the second line ~
es: Puede usar el sangrado para destacar texto con respecto al resto. Los textos de ejemplo en este manual, por ejemplo, están sangrados con ocho espacios, o una tabulación. Generalmente, introduce el sangrado con una tabulación al inicio de cada línea. Suponga este texto: la primera línea ~ la segunda línea ~

source: This is entered by typing a tab, some text, <Enter>, tab and more text. The 'autoindent' option inserts indents automatically: >
es: Puede introducir esto pulsando el botón de tabulado, algo de texto, <Intro>, tabulado, y más texto. La opción 'autoindent' inserta sangrado automáticamente: >

source: When a new line is started it gets the same indent as the previous line. In the above example, the tab after the <Enter> is not needed anymore.
es: Al iniciar una nueva línea, este recibirá el mismo sangrado que la línea anterior. En el ejemplo anterior, el tabulado tras <Intro> ya no es necesario.

source: To increase the amount of indent in a line, use the ">" operator. Often this is used as ">>", which adds indent to the current line. The amount of indent added is specified with the 'shiftwidth' option. The default value is 8. To make ">>" insert four spaces worth of indent, for example, type this: >
es: Para aumentar la cantidad de sangrado en una línea, use el operador «>». A menudo usará esto como «>>», que añade sangrado a la línea actual. La cantidad de sangrado añadida se especifica con la opción 'shiftwidth'. El valor por omisión es 8. Para lograr que «>>» inserte cuatro espacios de sangrado, por ejemplo, use lo siguiente: >

source: the first line ~ the second line ~
es: la primera línea ~ la segunda línea ~

source: If you want to make indents a multiple of 4, you set 'shiftwidth' to 4. But when pressing a <Tab> you still get 8 spaces worth of indent. To change this, set the 'softtabstop' option: >
es: Si desea que el sangrado sea un múltiplo de 4, defina 'shiftwidth' a 4. Aún obtendría ocho espacios de sangrado al pulsar <Tab>. Defina la opción 'softtabstop' para modificar esto: >

source: This will make the <Tab> key insert 4 spaces worth of indent. If there are already four spaces, a <Tab> character is used (saving seven characters in the file). (If you always want spaces and no tab characters, set the 'expandtab' option.)
es: Esto hará que la tecla <Tab> inserte 4 espacios de sangrado. EL carácter <Tab> se usará en caso ya existir cuatro espacios (ahorrando 7 espacios en el archivo). (Si desea siempre espacios y no caracteres de tabulado, defina la opción 'expandtab').

source: Note: You could set the 'tabstop' option to 4. However, if you edit the file another time, with 'tabstop' set to the default value of 8, it will look wrong. In other programs and when printing the indent will also be wrong. Therefore it is recommended to keep 'tabstop' at eight all the time. That's the standard value everywhere.
es: Nota: Puede definir la opción 'tabstop' con valor de 4. De todas formas, si edita el archivo en otro momento teniendo 'tabstop' su valor predeterminado de 8, el aspecto no será el deseado. Otros programas, así como imprimir el sangrado presentarán un aspecto equivocado. Por ello, recomendamos mantener 'tabstop' con valor de 8 en todo momento. Este es el valor estándar en otras aplicaciones.

source: The ":retab" command will change 'tabstop' to 8, while changing the text such that it looks the same. It changes spans of white space into tabs and spaces for this. You can now write the file. Next time you edit it the indents will be right without setting an option. Warning: When using ":retab" on a program, it may change white space inside a string constant. Therefore it's a good habit to use "\t" instead of a real tab.
es: La orden «:retab» cambia 'tabstop' a 8, a la vez que modifica el texto para que encaje. Para ello, modifica los tramos de espacio blanco a tabulados y espacios. Ahora puede escribir en el archivo. La siguiente vez que lo edite, la tabulación será la correcta sin necesidad de definir la opción. Aviso: Si usa «:retab» sobre un programa, cabe que modifique el espacio en blanco dentro de una cadena entrecomillas. Por ello, es una buena costumbre usar «\t» en lugar de un tabulado real.

source: *25.4* Dealing with long lines
es: *25.4* Tratar líneas largas

source: If you don't have a scrollbar or don't want to use it, use these commands to scroll the text. The cursor will stay in the same place, but it's moved back into the visible text if necessary.
es: Si no tiene una barra de desplazamiento o no quiere usarla, puede usar estas órdenes para desplazar el texto. El cursor permanecerá en el mismo lugar, pero permitiendo también desplazarlo al texto visible, de ser necesario.

source: Let's attempt to show this with one line of text. The cursor is on the "w" of "which". The "current window" above the line indicates the text that is currently visible. The "window"s below the text indicate the text that is visible after the command left of it.
es: Vamos a intentar mostrar esto con una línea de texto. El cursor está sobre la «w» de «which». La «ventana actual» sobre la línea indica el texto actualmente visible. Las «ventana» bajo el texto indican el texto visible después de ejecutar la orden.

source: |<-- current window -->| some long text, part of which is visible in the window ~ ze |<-- window -->| zH |<-- window -->| 4zh |<-- window -->| zh |<-- window -->| zl |<-- window -->| 4zl |<-- window -->| zL |<-- window -->| zs |<-- window -->|
es: |<-- ventana actual -->| some long text, part of which is visible in the window ~ ze |<-- ventana -->| zH |<-- ventana -->| 4zh |<-- ventana -->| zh |<-- ventana -->| zl |<-- ventana -->| 4zl |<-- ventana -->| zL |<-- ventana -->| zs |<-- ventana -->|
