Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The CTRL-W w command can be used to jump between the windows.
es: La orden CTRL-W w se puede usar para saltar de una ventana a otra.

source: If you are in the top window, CTRL-W w jumps to the window below it.
es: Si está en la ventana superior, CTRL-W w salta a la ventana inferior.

source: If you are in the bottom window it will jump to the first window.
es: Si está en la ventana inferior saltará a la primera ventana.

source: (CTRL-W CTRL-W does the same thing, in case you let go of the CTRL key a bit later.)
es: (CTRL-W CTRL-W hace lo mismo, en caso de que suelte la tecla CTRL un poco después.)

source: Actually, any command that quits editing a file works, like ":quit" and "ZZ".
es: De hecho, cualquier orden que salga del archivo funciona, como «:quit» y «ZZ».

source: But ":close" prevents you from accidentally exiting Vim when you close the last window.
es: Pero «:close» evitará que salga accidentalmente de Vim cuando cierre la última ventana.

source: This closes all windows, except for the current one.
es: Esto cierra todas las ventanas, excepto la actual.

source: If any of the other windows has changes, you will get an error message and that window won't be closed.
es: Si cualquiera de las otras ventanas tiene cambios, obtendrá un mensaje de error y esa ventana no se cerrará.

source: *08.2* Split a window on another file
es: *08.2* Dividir una ventana con otro archivo

source: The following command opens a second window and starts editing the given file: > :split two.c
es: La siguiente orden abre una segunda ventana y comienza la edición de un archivo: > :split two.c

source: +----------------------------------+ |/* file two.c */ | |~ | |~ | |two.c=============================| |/* file one.c */ | |~ | |one.c=============================| | | +----------------------------------+
es: +----------------------------------+ |/* archivo dos.c */ | |~ | |~ | |two.c=============================| |/* archivo uno.c */ | |~ | |one.c=============================| | | +----------------------------------+

source: *08.3* Window size
es: *08.3* Tamaño de ventana

source: The ":split" command can take a number argument.
es: La orden «:split» puede recibir un argumento numérico.

source: If specified, this will be the height of the new window.
es: Si se especifica, este será la altura de la nueva ventana.

source: For example, the following opens a new window three lines high and starts editing the file alpha.c: >
es: Por ejemplo, el siguiente abre una nueva ventana con una altura de tres líneas y edita el archivo alpha.c: >

source: For existing windows you can change the size in several ways.
es: Para ventanas ya existentes puede cambiar el tamaño de varias formas.

source: When you have a working mouse, it is easy: Move the mouse pointer to the status line that separates two windows, and drag it up or down.
es: Cuando tiene un ratón, es fácil: Coloque el puntero en la línea de estado que separa las dos ventanas y arrástrela.

source: Both of these commands take a count and increase or decrease the window size by that many lines.
es: Ambas órdenes reciben un multiplicador que modificará la altura de ventana ese número de líneas.

source: Thus "4 CTRL-W +" make the window four lines higher.
es: «4 CTRL-W +» hará la ventana cuatro líneas más alta.

source: {height}CTRL-W _
es: {altura}CTRL-W _

source: That's: a number {height}, CTRL-W and then an underscore (the - key with Shift on English-US keyboards).
es: O sea: un número {altura}, CTRL-W y luego un guión bajo (Mayúsculas más la tecla -).

source: To make a window as high as it can be, use the CTRL-W _ command without a count.
es: Para maximizar una ventana, use la orden CTRL-W _ sin ningún multiplicador ni argumento.

source: In Vim you can do many things very quickly from the keyboard.
es: En Vim puede hacer muchas cosas muy rápidamente desde el teclado.

source: Unfortunately, the window resizing commands require quite a bit of typing.
es: Por desgracia, las órdenes de ajuste de las ventanas requieren mucho trabajo.

source: In this case, using the mouse is faster.
es: En este caso, usar el ratón es más rápido.

source: Position the mouse pointer on a status line.
es: Coloque el ratón sobre la línea de estado.

source: Now press the left mouse button and drag.
es: Ahora presione el botón izquierdo y arrastre.

source: The status line will move, thus making the window on one side higher and the other smaller.
es: La línea de estado se desplazará, ajustando el tamaño de la ventana.

source: The 'winheight' option can be set to a minimal desired height of a window and 'winminheight' to a hard minimum height.
es: La opción 'winheight' se puede ajustar a una altura mínima de ventana y 'winminheight' a un mínimo estricto.

source: Likewise, there is 'winwidth' for the minimal desired width and 'winminwidth' for the hard minimum width.
es: Del mismo modo, hay un ancho 'winwidth' para el ancho mínimo deseado y un 'winminheight' para un ancho mínimo estricto.

source: The 'equalalways' option, when set, makes Vim equalize the windows sizes when a window is closed or opened.
es: La opción 'equalalways', cuando está activa, hace que Vim equilibre el tamaño de las ventanas cuando éstas se cierran o se abren nuevas.

source: *08.4* Vertical splits
es: *08.4* Divisiones verticales

source: The ":split" command creates the new window above the current one.
es: La orden «:split» crea una nueva ventana sobre la actual.

source: To make the window appear at the left side, use: >
es: Para hacer que una ventana aparezca en el lateral izquierda, use: >

source: or: > :vsplit two.c
es: o: > :vsplit two.c

source: +--------------------------------------+ |/* file two.c */ |/* file one.c */ | |~ |~ | |~ |~ | |~ |~ | |two.c===============one.c=============| | | +--------------------------------------+
es: +--------------------------------------+ |/*archivo dos.c */ |/*archivo uno.c */| |~ |~ | |~ |~ | |~ |~ | |two.c===============one.c=============| | | +--------------------------------------+

source: There is also the ":vnew" command, to open a vertically split window on a new, empty file.
es: También hay una orden «:vnew», para abrir una partición vertical con un archivo nuevo.

source: The ":vertical" command can be inserted before another command that splits a window.
es: La orden «:vertical» se puede insertar justo antes de otra orden que divida la ventana.

source: This will cause that command to split the window vertically instead of horizontally.
es: Esto puede hacer que la ventana se divida verticalmente en lugar de horizontalmente.

source: (If the command doesn't split a window, it works unmodified.)
es: (Si la orden no divide ventanas se ejecuta de modo normal.)

source: Since you can split windows horizontally and vertically as much as you like, you can create almost any layout of windows.
es: Ya que puede dividir ventanas horizontal y verticalmente a voluntad, puede crear casi cualquier estructura.

source: Then you can use these commands to move between them:
es: Una vez las haya creado se puede desplazar por ellas:

source: CTRL-W h move to the window on the left CTRL-W j move to the window below CTRL-W k move to the window above CTRL-W l move to the window on the right
es: CTRL-W h moverse a la ventana de la izquierda CTRL-W j moverse a la ventana de abajo CTRL-W k moverse a la ventana de arriba CTRL-W l moverse a la ventana de la derecha

source: CTRL-W t move to the TOP window CTRL-W b move to the BOTTOM window
es: CTRL-W t moverse a la ventana superior (TOP) CTRL-W b moverse a la ventana inferior (BOTTOM)

source: You will notice the same letters as used for moving the cursor.
es: Se habrá dado cuenta de que son las mismas teclas empleadas para mover el cursor.

source: And the cursor keys can also be used, if you like.
es: También puede usar las teclas de flechas si lo desea.

source: More commands to move to other windows: |Q_wi|.
es: Más órdenes para moverse a otras ventanas: |Q_wi|.

source: *08.5* Moving windows
es: *08.5* Mover ventanas

source: You have split a few windows, but now they are in the wrong place.
es: Imagine que ha creado unas cuantas ventanas, pero están en el lugar equivocado.

source: Then you need a command to move the window somewhere else.
es: Necesitará una orden para mover las ventanas a otro lugar.

source: For example, you have three windows like this:
es: Por ejemplo, tiene tres ventanas como estas:

source: +----------------------------------+ |/* file two.c */ | |~ | |~ | |two.c=============================| |/* file three.c */ | |~ | |~ | |three.c===========================| |/* file one.c */ | |~ | |one.c=============================| | | +----------------------------------+
es: +----------------------------------+ |/* archivo dos.c */ | |~ | |~ | |dos.c=============================| |/* archivo tres.c */ | |~ | |~ | |tres.c============================| |/* archivo uno.c */ | |~ | |uno.c=============================| | | +----------------------------------+

source: Clearly the last one should be at the top.
es: Obviamente la última ventana debería estar en la parte superior.

source: Go to that window (using CTRL-W w) and the type this command: >
es: Vaya a esa ventana (usando CTRL-W w) y luego teclee la siguiente orden: >

source: +-------------------------------------------+ |/* two.c */ |/* three.c */ |/* one.c */ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |two.c=========three.c=========one.c========| | | +-------------------------------------------+
es: +-------------------------------------------+ |/* dos.c */ |/* tres.c */ |/* uno.c */ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |~ |~ |~ | |dos.c==========tres.c=========uno.c========| | | +-------------------------------------------+

source: +-------------------------------------------+ |/* three.c */ | |~ | |~ | |three.c====================================| |/* two.c */ |/* one.c */ | |~ |~ | |two.c==================one.c===============| | | +-------------------------------------------+
es: +-------------------------------------------+ |/* tres.c */ | |~ | |~ | |tres.c=====================================| |/* dos.c */ |/* uno.c */ | |~ |~ | |dos.c==================uno.c===============| | | +-------------------------------------------+

source: CTRL-W H move window to the far left CTRL-W J move window to the bottom CTRL-W L move window to the far right
es: CTRL-W H mover la ventana al extremo izquierdo CTRL-W J mover la ventana al extremo inferior CTRL-W L mover la ventana al extremo derecho

source: *08.6* Commands for all windows
es: *08.6* Órdenes sobre todas las ventanas

source: When you have several windows open and you want to quit Vim, you can close each window separately.
es: Cuando tiene varias ventanas abiertas y quiere salir de Vim, puede cerrar cada ventana por su cuenta.

source: A quicker way is using this command: >
es: Una forma más rápida es la siguiente: >

source: This stands for "quit all".
es: Esto viene de «quit all» (cerrar todo).

source: If any of the windows contain changes, Vim will not exit.
es: Si alguna de las ventanas contiene cambios, Vim no saldrá.

source: The cursor will automatically be positioned in a window with changes.
es: El cursor se pondrá automáticamente en la ventana con cambios.

source: You can then either use ":write" to save the changes, or ":quit!" to throw them away.
es: Puede usar «:w» para guardar los cambios, o «:q!» para eliminarlos completamente.

source: This stands for "write all".
es: Esto viene de «write all» (escribir/guardar todo).

source: But actually, it only writes files with changes.
es: Pero, de hecho, sólo escribe archivos con cambios.

source: Vim knows it doesn't make sense to write files that were not changed.
es: Vim sabe que no tiene sentido guardar archivos sin cambios.

source: And then there is the combination of ":qall" and ":wall": the "write and quit all" command: >
es: También hay una combinación de «:qall» y «:wall»: la orden «guardar y salir de todas las ventanas»: >

source: This writes all modified files and quits Vim.
es: Esto guarda todos los archivos modificados y sale de Vim.

source: Finally, there is a command that quits Vim and throws away all changes: >
es: Por último, hay una orden que sale de Vim y no guarda nada: >

source: vim -o one.txt two.txt three.txt
es: vim -o uno.txt dos.txt tres.txt

source: +-------------------------------+ |file one.txt | |~ | |one.txt========================| |file two.txt | |~ | |two.txt========================| |file three.txt | |~ | |three.txt======================| | | +-------------------------------+
es: +-------------------------------+ |archivo uno.txt | |~ | |uno.txt========================| |archivo dos.txt | |~ | |dos.txt========================| |archivo tres.txt | |~ | |tres.txt=======================| | | +-------------------------------+

source: The "-O" argument is used to get vertically split windows.
es: El argumento «-O"» se usa para que las divisiones se hagan verticalmente.

source: When Vim is already running, the ":all" command opens a window for each file in the argument list.
es: Cuando Vim está ejecutándose, la orden «:all» abre una ventana para cada archivo en la lista de argumentos.

source: ":vertical all" does it with vertical splits.
es: «:vertical all» lo hace verticalmente.

source: *08.7* Viewing differences with vimdiff
es: *08.7* Ver las diferencias con «vimdiff»

source: There is a special way to start Vim, which shows the differences between two files.
es: Existe una manera especial de arrancar Vim que muestra las diferencias entre dos archivos.

source: Let's take a file "main.c" and insert a few characters in one line.
es: Cojamos un archivo «main.c» e insertemos unos caracteres en una línea.

source: Write this file with the 'backup' option set, so that the backup file "main.c~" will contain the previous version of the file.
es: Escriba el archivo con la opción 'backup' activada, de manera que el archivo «main.c~» contendrá la versión anterior.

source: Type this command in a shell (not in Vim): >
es: Escribe la siguiente orden en una consola (no en Vim): >

source: Vim will start, with two windows side by side.
es: Vim arrancará con dos ventanas verticales.

source: You will only see the line in which you added characters, and a few lines above and below it.
es: Verá solamente la línea en la que ha añadido los cambios y unas cuántas líneas por debajo.

source: VV VV +-----------------------------------------+ |+ +--123 lines: /* a|+ +--123 lines: /* a| <- fold | text | text | | text | text | | text | text | | text | changed text | <- changed line | text | text | | text | ------------------| <- deleted line | text | text | | text | text | | text | text | |+ +--432 lines: text|+ +--432 lines: text| <- fold | ~ | ~ | | ~ | ~ | |main.c~==============main.c==============| | | +-----------------------------------------+
es: VV VV +-----------------------------------------+ |+ +--123 lines: /* a|+ +--123 lines: /* a| <- pliegue | texto | texto | | texto | texto | | texto | texto | | texto | texto modificado | <- línea modificada | texto | texto | | texto | ------------------| <- línea eliminada | texto | texto | | texto | texto | | texto | texto | |+ +--432 lines:texto|+ +--432 lines:texto| <- pliegue | ~ | ~ | | ~ | ~ | |main.c~==============main.c==============| | | +-----------------------------------------+

source: The lines that were not modified have been collapsed into one line.
es: Las líneas que no se modificaron se han agrupado en una sola línea.

source: This is called a closed fold.
es: A esto se le denomina pliegue (fold) cerrado.

source: They are indicated in the picture with "<- fold".
es: Se indican con «<- pliegue» en la figura.

source: Thus the single fold line at the top stands for 123 text lines.
es: La línea de arriba marca que hay 123 líneas.

source: These lines are equal in both files.
es: Estas líneas son iguales en ambos archivos.

source: The line marked with "<- changed line" is highlighted, and the inserted text is displayed with another color.
es: La línea marcada con «<- línea modificada» está resaltada y el texto insertado se muestra con otro color.

source: This clearly shows what the difference is between the two files.
es: Esto muestra claramente las diferencias entre los dos archivos.

source: The line that was deleted is displayed with "---" in the main.c window.
es: La línea que se eliminó se muestra con «---» en la ventana «main.c».

source: See the "<- deleted line" marker in the picture.
es: Observe el «<- línea eliminada» en la figura.

source: These characters are not really there.
es: Estos caracteres no están ahí realmente.

source: They just fill up main.c, so that it displays the same number of lines as the other window.
es: Simplemente llenan el espacio necesario en «main.c» para que ambos archivos tengan el mismo número de líneas.

source: Each window has a column on the left with a slightly different background.
es: Cada ventana tiene una columna en la izquierda que tiene un fondo ligeramente diferente.

source: In the picture above these are indicated with "VV".
es: En la figura de arriba se indican con «VV».

source: You notice there is a plus character there, in front of each closed fold.
es: Fíjese que hay un carácter «+» en ese sitio, enfrente de cada pliegue cerrado.

source: Move the mouse pointer to that plus and click the left button.
es: Mueva el puntero del ratón a ese signo «+» y pulse el botón izquierdo.

source: The fold will open, and you can see the text that it contains.
es: Esto abrirá el pliegue, mostrando el texto que contiene.

source: The fold column contains a minus sign for an open fold.
es: La columna del pliegue muestra un «-» para un pliegue abierto.

source: If you click on this -, the fold will close.
es: Si pulsa este «-», el pliegue se cerrará.

source: Obviously, this only works when you have a working mouse.
es: Obviamente, esto sólo funciona cuando tiene un ratón configurado.

source: You can also use "zo" to open a fold and "zc" to close it.
es: También puedes usar «zo» para abrir un pliegue y «zc» para cerrarlo.

source: Another way to start in diff mode can be done from inside Vim.
es: Otra manera de iniciar el modo diff es hacerlo desde Vim.

source: Edit the "main.c" file, then make a split and show the differences: >
es: Edite el archivo «main.c», haga después un «split» y muestre las diferencias: >

source: The ":vertical" command is used to make the window split vertically.
es: La orden «:vertical» se usa para hacer que las ventanas se dividan verticalmente.

source: If you omit this, you will get a horizontal split.
es: Si omite esto, obtendrá una división horizontal.

source: If you have a patch or diff file, you can use the third way to start diff mode.
es: Si tiene un parche o un archivo diff, puede usarlo como una tercera manera de iniciar el modo diff.

source: First edit the file to which the patch applies.
es: Primero edite el archivo sobre el cuál se aplica el parche.

source: Then tell Vim the name of the patch file: >
es: Entonces escribe la siguiente orden: >

source: WARNING: The patch file must contain only one patch, for the file you are editing.
es: AVISO: El parche debe contener un solo parche, el del archivo que está editando.

source: Otherwise you will get a lot of error messages, and some files might be patched unexpectedly.
es: En caso contrario, recibirá muchos de mensajes de error y algunos archivos pueden verse parcheados de forma imprevista.

source: The patching will only be done to the copy of the file in Vim.
es: El parcheo será realizado sólo sobre una copia del archivo en Vim.

source: The file on your harddisk will remain unmodified (until you decide to write the file).
es: El archivo del disco duro no se modificará hasta que no lo guardes.

source: When the files have more changes, you can scroll in the usual way.
es: Cuando los archivos tienen muchos cambios, puede desplazarse de manera normal.

source: Vim will try to keep both the windows start at the same position, so you can easily see the differences side by side.
es: Vim intentará hacer que ambas ventanas comiencen con el mismo desplazamiento, para que pueda ver las diferencias en cada lado.

source: When you don't want this for a moment, use this command: >
es: Cuando no quiera que esto ocurra, use lo siguiente: >

source: When you have disabled folding in some way, it may be difficult to find the changes.
es: Cuando haya desactivado los pliegues de algún modo, puede ser más difícil encontrar los cambios.

source: Use this command to jump forward to the next change: >
es: Use esta orden para saltar al siguiente cambio: >

source: You can move text from one window to the other.
es: Puede mover texto de una ventana a otra.

source: This either removes differences or adds new ones.
es: Esto elimina diferencias o añade unas nuevas.

source: Vim doesn't keep the highlighting updated in all situations.
es: Vim no mantiene el texto resaltado en todas las situaciones.

source: To update it use this command: >
es: Para actualizarlo deberá escribir: >

source: To remove a difference, you can move the text in a highlighted block from one window to another.
es: Para eliminar una diferencia, puede mover el texto de un bloque resaltado desde una ventana a otra.

source: Take the "main.c" and "main.c~" example above.
es: Suponga el «main.c» y el «main.c~» del ejemplo.

source: Move the cursor to the left window, on the line that was deleted in the other window.
es: Mueva el cursor a la izquierda de la ventana, sobre la línea que se eliminó en la otra ventana.

source: The change will be removed by putting the text of the current window in the other window.
es: El cambio se eliminará poniendo el texto de la ventana actual en la otra ventana.

source: "dp" stands for "diff put".
es: «dp» viene de «diff put» (put = poner).

source: You can also do it the other way around.
es: Puede hacerlo también de la forma completamente opuesta.

source: Move the cursor to the right window, to the line where "changed" was inserted.
es: Mueva el cursor a la ventana de la derecha, donde se insertó el cambio.

source: The change will now be removed by getting the text from the other window.
es: El cambio será ahora eliminado obteniendo el texto desde la otra ventana.

source: Since there are no changes left now, Vim puts all text in a closed fold.
es: Ya que no hay cambios restantes, Vim pondrá todo el texto en un pliegue cerrado.

source: "do" stands for "diff obtain".
es: «do» viene de «diff obtain» (obtain = obtener).

source: "dg" would have been better, but that already has a different meaning ("dgg" deletes from the cursor until the first line).
es: «dg» podría ser mejor (de g = get = obtener) pero «dgg» ya tenía un significado diferente.

source: *08.8* Various
es: *08.8* Varios

source: 0 never 1 only when there are split windows (the default) 2 always
es: 0 nunca 1 sólo cuando hay más ventanas (predeterminado) 2 siempre

source: Many commands that edit another file have a variant that splits the window.
es: Muchas órdenes que editan otro archivo disponen de una variante que divide la ventana.

source: For Command-line commands this is done by prepending an "s".
es: Para los de la línea de órdenes se hace con el prefijo «s».

source: For example: ":tag" jumps to a tag, ":stag" splits the window and jumps to a tag.
es: Por ejemplo «:tag» salta a una etiqueta, «:stag» divide la ventana y salta a la etiqueta.

source: For Normal mode commands a CTRL-W is prepended.
es: Para órdenes del modo normal se teclea CTRL-W antes.

source: CTRL-^ jumps to the alternate file, CTRL-W CTRL-^ splits the window and edits the alternate file.
es: CTRL-^ salta al archivo alterno, CTRL-W CTRL-^ divide la ventana y edita el archivo alterno.
