Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The override command modifier is needed because Vim is reluctant to throw away changes.
es: El modificador de anulación es necesario porque Vim se resiste a perder los cambios.

source: If you were to just type ":q", Vim would display an error message and refuse to exit:
es: Si escribiese sólo «:q», Vim mostraría un mensaje de error y se negaría a salir:

source: E37: No write since last change (use ! to override) ~
es: E37: No se ha guardado el fichero desde el último cambio (añada ! para forzar) ~

source: *02.8* Finding help
es: *02.8* Encontrar ayuda

source: Everything you always wanted to know can be found in the Vim help files.
es: Todo lo que quiera saber puede encontrarlo en los archivos de ayuda.

source: Don't be afraid to ask!
es: ¡No tenga miedo a preguntar!

source: To get generic help use this command: >
es: Use la siguiente orden para obtener ayuda genérica:

source: You could also use the first function key <F1>.
es: También puede usar la tecla <F1>.

source: If your keyboard has a <Help> key it might work as well.
es: Si su teclado tiene tecla <Ayuda> puede que funcione también.

source: If you don't supply a subject, ":help" displays the general help window.
es: Si no define un tema, «:help» muestra la ventana de ayuda general.

source: The creators of Vim did something very clever (or very lazy) with the help system: They made the help window a normal editing window.
es: Los creadores de Vim hicieron algo muy inteligente (o fueron muy vagos) con el sistema de ayuda: Hicieron la ventana de ayuda una ventana normal de edición.

source: You can use all the normal Vim commands to move through the help information.
es: Puede usar todas las órdenes comunes de Vim para moverse por ella.

source: Therefore h, j, k, and l move left, down, up and right.
es: Por lo tanto, h, j, k, l mueven el cursor hacia la izquierda, derecha, arriba y abajo.

source: To get out of the help window, use the same command you use to get out of the editor: "ZZ".
es: Para salir de la ventana de ayuda, usa la misma orden que usas para salir del editor: «ZZ».

source: This will only close the help window, not exit Vim.
es: Esto sólo cierra la ayuda, no sale de Vim.

source: When you need to get help for a control character command (for example, CTRL-A), you need to spell it with the prefix "CTRL-".
es: Cuando necesite obtener ayuda para las órdenes de control de carácter (por ejemplo, CTRL-A), debe escribirlo con el prefijo «CTRL-».

source: The Vim editor has many different modes.
es: El editor Vim tiene muchos modos diferentes.

source: By default, the help system displays the normal-mode commands.
es: De manera predeterminada, el sistema de ayuda muestra las ordenes del modo normal.

source: For example, the following command displays help for the normal-mode CTRL-H command: >
es: Por ejemplo, la siguiente orden muestra la ayuda para la orden CTRL-H en modo normal: >

source: To identify other modes, use a mode prefix.
es: Para identificar otros modos, se necesita un prefijo de modo.

source: If you want the help for the insert-mode version of a command, use "i_".
es: Si quiere ayuda para la versión en modo Insertar de una orden, use «i_».

source: For CTRL-H this gives you the following command: >
es: Para, CTRL-H es la siguiente orden: >

source: The Vim editor has a number of options that enable you to configure and customize the editor.
es: El editor Vim tiene una serie de opciones que le permiten configurar y personalizar el editor.

source: If you want help for an option, you need to enclose it in single quotation marks.
es: Si quiere ayuda para una opción, tiene que escribirla entre comillas simples.

source: To find out what the 'number' option does, for example, use the following command: >
es: Para encontrar lo que hace la opción 'number' por ejemplo, usa la orden siguiente: >

source: Special keys are enclosed in angle brackets.
es: Las teclas especiales se escriben entre corchetes angulares.

source: To find help on the up-arrow key in Insert mode, for instance, use this command: >
es: Para encontrar ayuda sobre la flecha hacia arriba en modo insertar, use: >

source: *intro.txt* For Vim version 7.3.
es: *intro.esx* Para Vim versión 7.3.

source: VIM REFERENCE MANUAL by Bram Moolenaar
es: MANUAL DE REFERENCIA DE VIM por Bram Moolenar

source: Introduction to Vim *ref* *reference*
es: Introducción a Vim *ref* *referencia* *reference*

source: Introduction |intro| 2.
es: Introducción |intro| 2.

source: Vim on the internet |internet| 3.
es: Vim en internet |internet| 3.

source: Credits |credits| 4.
es: Créditos |credits| 4.

source: Notation |notation| 5.
es: Notación |notación| |notation| 5.

source: Modes, introduction |vim-modes-intro| 6.
es: Modos, introducción |vim-modes-intro| 6.

source: Switching from mode to mode |mode-switching| 7.
es: Cambiar de Modos |cambiar-modo| |mode-switching| 7.

source: The window contents |window-contents| 8.
es: El contenido de la ventana |ventana-contenidos| |window-contents| 8.

source: Definitions |definitions|
es: Definiciones |definiciones| |definitions|

source: Introduction *intro*
es: Introducción *intro*

source: Vim stands for Vi IMproved.
es: Vim son las siglas de Vi Improved («Vi mejorado»).

source: It used to be Vi IMitation, but there are so many improvements that a name change was appropriate.
es: Solía significar Vi IMitation, pero hay tantas mejoras que se consideró apropiado cambiar el nombre.

source: Vim is a text editor which includes almost all the commands from the Unix program "Vi" and a lot of new ones.
es: Vim es un editor de texto que incluye casi todas las órdenes del programa para Unix, Vi, así como otras más.

source: It is very useful for editing programs and other plain text.
es: Es muy útil para la edición de programas y archivos de formato de texto normal.

source: All commands are given with the keyboard.
es: Todas las órdenes se introducen mediante el teclado.

source: This has the advantage that you can keep your fingers on the keyboard and your eyes on the screen.
es: Ésto ofrece la ventaja de poder tener sus dedos en el teclado y sus ojos en la pantalla.

source: For those who want it, there is mouse support and a GUI version with scrollbars and menus (see |gui.txt|).
es: Para aquellos que lo deseen, también tiene compatibilidad con ratón y una versión que ofrece una interfaz gráfica con barras de desplazamiento y menús (consulte |gui.txt|).

source: An overview of this manual can be found in the file "help.txt", |help.txt|.
es: Encontrará una visión general de este manual en el archivo «help.txt», |help.txt|.

source: It can be accessed from within Vim with the <Help> or <F1> key and with the |:help| command (just type ":help", without the bars or quotes).
es: Puede acceder a él a través de Vim con la tecla <Ayuda> o <F1> y con la orden |:help| (sólo teclee «:help», sin las comillas o barras).

source: The 'helpfile' option can be set to the name of the help file, in case it is not located in the default place.
es: La opción 'helpfile' se puede configurar con el nombre del archivo de ayuda en caso de no encontrarse en la ubicación habitual.

source: You can jump to subjects like with tags: Use CTRL-] to jump to a subject under the cursor, use CTRL-T to jump back.
es: Puede saltar de un tema a otro como si fuesen etiquetas: Use CTRL-] para pasar al tema bajo el cursor, y CTRL-T para volver.

source: Throughout this manual the differences between Vi and Vim are mentioned in curly braces, like this: {Vi does not have on-line help}.
es: Las diferencias entre Vi y Vim se señalarán con llaves, por ejemplo: {Vi no tiene ayuda en línea}.

source: See |vi_diff.txt| for a summary of the differences between Vim and Vi.
es: Consulte |vi_diff.txt| para un resumen de las diferencias entre Vim y Vi.

source: This manual refers to Vim on various machines.
es: Este manual trata el uso de Vim en varios sistemas.

source: There may be small differences between different computers and terminals.
es: Pueden existir pequeñas diferencias entre computadoras y terminales.

source: Besides the remarks given in this document, there is a separate document for each supported system, see |sys-file-list|.
es: Además de los comentarios que se ofrecen en este documento, hay un documento aparte para cada sistema compatible, consulte |sys-file-list|.

source: *pronounce* Vim is pronounced as one word, like Jim, not vi-ai-em.
es: *pronounce* *pronunciar* Vim se pronuncia como una sola palabra, como Jim, no uve-a-eme.

source: It's written with a capital, since it's a name, again like Jim.
es: Se escribe mayúscula, ya que es un nombre al igual que Jim.

source: This manual is a reference for all the Vim commands and options.
es: Este manual es una referencia para todas las órdenes y opciones de Vim.

source: This is not an introduction to the use of Vi or Vim, it gets a bit complicated here and there.
es: No es una introducción al uso de Vi o Vim, y algunas secciones son complejas.

source: For beginners, there is a hands-on |tutor|.
es: Hay un tutor práctico, |tutor|.

source: To learn using Vim, read the user manual |usr_toc.txt|.
es: Si quiere aprender a usar Vim, consulte el manual de usuario |usr_toc.txt|.

source: *book* There are many books on Vi that contain a section for beginners.
es: *book* Existen muchos libros sobre Vi que contienen una sección para principiantes.

source: There are two books I can recommend:
es: Personalmente recomiendo dos libros:

source: "Vim - Vi Improved" by Steve Oualline
es: «Vim - Vi Improved» por Steve Oualline

source: This is the very first book completely dedicated to Vim.
es: Este es el primer libro completamente dedicado a Vim.

source: It is very good for beginners.
es: Es muy bueno para principiantes.

source: The most often used commands are explained with pictures and examples.
es: Las órdenes más usadas se explican con imágenes y ejemplos.

source: The less often used commands are also explained, the more advanced features are summarized.
es: También se tratan aquellas órdenes menos comunes, y las características más avanzadas son resumidas.

source: There is a comprehensive index and a quick reference.
es: Tiene un completo índice y una rápida referencia.

source: Parts of this book have been included in the user manual |frombook|.
es: Hay partes de este libro incluidas en el manual de usuario |frombook|.

source: Published by New Riders Publishing.
es: Publicado por New Riders Publishing.

source: ISBN: 0735710015 For more information try one of these: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html
es: ISBN: 0735710015 Pruebe estos enlaces para más información: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html

source: "Learning the Vi editor" by Linda Lamb and Arnold Robbins
es: «Learning the Vi editor» por Linda Lamb y Arnold Robbins

source: Vim on the internet *internet*
es: Vim en internet *internet*

source: *www* *WWW* *faq* *FAQ* *distribution* *download* The Vim pages contain the most recent information about Vim.
es: *www* *WWW* *faq* *FAQ* *distribution* *download* *descargar* Las páginas de Vim ofrecen la información más actualizada.

source: They also contain links to the most recent version of Vim.
es: También contienen enlaces a la versión más reciente de Vim.

source: The FAQ is a list of Frequently Asked Questions.
es: El FAQ es una lista de las preguntas más frecuentes.

source: Read this if you have problems.
es: Consulte esa página en caso de tener problemas.

source: VIM home page: http://www.vim.org/ VIM FAQ: http://vimdoc.sf.net/ Downloading: ftp://ftp.vim.org/pub/vim/MIRRORS
es: Página web de VIM http://www.vim.org/ VIM FAQ: http://vimdoc.sf.net/ Descargar: ftp://ftp.vim.org/pub/vim/MIRRORS

source: Usenet News group where Vim is discussed: *news* *usenet* comp.editors This group is also for other editors.
es: Grupo de Usenet News en el que se trata Vim: *news* *usenet* comp.editors Este grupo también trata de otros editores.

source: If you write about Vim, don't forget to mention that.
es: Si escribe sobre Vim, no olvide de mencionar esto último.

source: *mail-list* *maillist* There are several mailing lists for Vim: <vim@vim.org> For discussions about using existing versions of Vim: Useful mappings, questions, answers, where to get a specific version, etc.
es: *mail-list* *maillist* Existen varias listas de correo acerca de Vim: <vim@vim.org> Para discusiones acerca del uso de varias versiones de Vim: Macros útiles, preguntas, respuestas, dónde obtener una versión especifica.

source: There are quite a few people watching this list and answering questions, also for beginners.
es: Hay varias personas mirando esta lista, y que responden a preguntas, también para principiantes.

source: Don't hesitate to ask your question here.
es: No dude en preguntar.

source: <vim-dev@vim.org> *vim-dev* *vimdev* For discussions about changing Vim: New features, porting, patches, beta-test versions, etc.
es: <vim-dev@vim.org> *vim-dev* *vimdev* Para la discusión de cambios en Vim: Nuevas características, portabilidad, parches, versiones beta, etc.

source: <vim-announce@vim.org> *vim-announce* Announcements about new versions of Vim; also for beta-test versions and ports to different systems.
es: <vim-announce@vim.org> *vim-announce* Anuncios acerca de nuevas versiones de Vim; también para versiones beta y la adaptación a otras arquitecturas.

source: This is a read-only list.
es: Lista de sólo lectura.

source: <vim-multibyte@vim.org> *vim-multibyte* For discussions about using and improving the multi-byte aspects of Vim.
es: <vim-multibyte@vim.org> *vim-multibyte* Discusión acerca de la mejora de la experiencia multi-byte en Vim.

source: <vim-mac@vim.org> *vim-mac* For discussions about using and improving the Macintosh version of Vim.
es: <vim-mac@vim.org> *vim-mac* Discusión acerca del uso y la mejora de la versión Macintosh de Vim.

source: NOTE: - You can only send messages to these lists if you have subscribed!
es: NOTA: - Sólo puede mandar mensajes a estas listas si esta suscrito.

source: - You need to send the messages from the same location as where you subscribed from (to avoid spam mail).
es: - Debe mandar los mensajes desde la misma dirección desde la cual se suscribió (para evitar el spam).

source: - Maximum message size is 40000 characters.
es: - El tamaño máximo de un mensaje es de 40000 caracteres.

source: *subscribe-maillist* If you want to join, send a message to <vim-subscribe@vim.org> Make sure that your "From:" address is correct.
es: *lista-correo* *subscribe-maillist* Si desea unirse, envie un mensaje a <vim-subscribe@vim.org> Asegúrese de que su dirección «De:» es correcta.

source: Then the list server will give you help on how to subscribe.
es: El servidor de la lista le asistirá para suscribirse.

source: *maillist-archive* For more information and archives look on the Vim maillist page: http://www.vim.org/maillist.php
es: *maillist-archive* Para más información y visitar los archivos, visite la página de listas de correo de Vim: http://www.vim.org/maillist.php

source: Bug reports: *bugs* *bug-reports* *bugreport.vim*
es: Informes de fallo: *fallos* *informe-de-fallo* *bugs* *bug-reports* *bugreport.vim*

source: It will help to include information about the version of Vim you are using and your setup.
es: Nos ayudaría si incluye información acerca de su configuración y versión de Vim.

source: You can get the information with this command: > :so $VIMRUNTIME/bugreport.vim This will create a file "bugreport.txt" in the current directory, with a lot of information of your environment.
es: Puede obtener esta información con la siguiente orden: > :so $VIMRUNTIME/bugreport.vim Esto creará el archivo «bugreport.txt» en el directorio presente, conteniendo información relativa a su entorno.

source: Before sending this out, check if it doesn't contain any confidential information!
es: Antes de enviarlo, revise que no contenga ninguna información confidencial.

source: If Vim crashes, please try to find out where.
es: Si Vim se cuelga, intente encontrar donde.

source: You can find help on this here: |debug.txt|.
es: Puede encontrar ayuda aquí: |debug.txt|.

source: There might be a year 2038 problem, when the seconds don't fit in a 32 bit int anymore.
es: Puede aparecer un problema en el año 2038, cuando los segundos no quepan en 32 bits.

source: This depends on the compiler, libraries and operating system.
es: Esto depende del compilador, la bibliotecas y el sistema operativo.

source: Specifically, time_t and the ctime() function are used.
es: Se usan particularmente las funciones «time_t» y «ctime()».

source: And the time_t is stored in four bytes in the swap file.
es: «time_t» se guarda en cuatro bytes en el archivo de intercambio.

source: But that's only used for printing a file date/time for recovery, it will never affect normal editing.
es: Esto último sólo se emplea para imprimir una fecha/tiempo para la recuperación y en ningún caso afectará a la edición normal.

source: The Vim strftime() function directly uses the strftime() system function.
es: La función de Vim «strftime()» usa directamente la función del sistema «strftime()».

source: localtime() uses the time() system function.
es: «localtime()» usa la función del sistema «time()».

source: getftime() uses the time returned by the stat() system function.
es: «getftime» usa el tiempo devuelto por la función del sistema «stat()».

source: If your system libraries are year 2000 compliant, Vim is too.
es: Si las bibliotecas de sus sistema son compatibles con el año 2000, Vim también lo es.

source: The user may create scripts for Vim that use external commands.
es: El usuario puede crear scripts para Vim que usan órdenes externas.

source: These might introduce Y2K problems, but those are not really part of Vim itself.
es: Esto puede introducir problemas Y2K, pero no son parte de Vim.

source: Credits *credits* *author* *Bram* *Moolenaar*
es: Creditos *credits* *créditos* *autor* *Bram* *Moolenaar*

source: Parts of the documentation come from several Vi manuals, written by: W.N.
es: El origen de algunas partes de la documentación nacen de varios manuales de Vim, escritos por: W.N.

source: The Vim editor is based on Stevie and includes (ideas from) other software, worked on by the people mentioned here.
es: El editor Vim está basado en Stevie, e incluye ideas procedentes de otro software, trabajadas por la gente aquí mencionada.

source: Other people helped by sending me patches, suggestions and giving feedback about what is good and bad in Vim.
es: Otra gente me ayudó mediante parches, sugerencias y opiniones acerca de lo bueno y malo de Vim.

source: I wish to thank all the people that sent me bug reports and suggestions.
es: Quisiera dar gracias a toda la gente que envió informes de fallo y sugerencias.

source: The list is too long to mention them all here.
es: La lista es demasiado larga como para mencionarlos a todos aquí.

source: Vim would not be the same without the ideas from all these people: They keep Vim alive!
es: Vim no sería lo mismo sin las ideas de todas esta gente: ¡Mantienen Vim vivo!

source: In this documentation there are several references to other versions of Vi: *Vi* *vi* Vi "the original".
es: A lo largo de la documentación verá varias referencias a otras versiones de Vi: *Vi* *vi* Vi «El original».

source: Without further remarks this is the version of Vi that appeared in Sun OS 4.x.
es: Sin mas detalle, esta es la versión de Vim que apareció en Sun Os 4.x.

source: ":version" returns "Version 3.7, 6/7/85".
es: «:version» devuelve «Version 3.7, 6/7/85».

source: Sometimes other versions are referred to.
es: A veces encontrara referencias a otras versiones.

source: Only runs under Unix.
es: Sólo funciona bajo Unix.

source: Source code only available with a license.
es: El código sólo está disponible a través de una licencia.

source: More information on Vi can be found through: http://vi-editor.org [doesn't currently work...] *Posix* Posix From the IEEE standard 1003.2, Part 2: Shell and utilities.
es: Puede encontrar más información a cerca de Vi: http://vi-editor.org (no funciona a día de hoy...) *Posix* Posix Pertenece al estándar IEEE 1003.2.

source: Generally known as "Posix".
es: Parte 2: Consola y utilidades.

source: This is a textual description of how Vi is supposed to work.
es: Generalmente conocido como «Posix», una descripción textual de cómo debe funcionar Vi.

source: See |posix-compliance|.
es: Véase |posix-compliance|.

source: *Nvi* Nvi The "New" Vi.
es: *Nvi* Nvi El «Nuevo» Vi.

source: The version of Vi that comes with BSD 4.4 and FreeBSD.
es: La versión de Vi que ofrece BSD 4.4 y FreeBSD.

source: Very good compatibility with the original Vi, with a few extensions.
es: Es muy compatible con el editor original Vi, con unas cuantas extensiones.

source: The version used is 1.79.
es: La versión referida es 1.79.

source: ":version" returns "Version 1.79 (10/23/96)".
es: «:version» devuelve «Version 1.79 (10/23/96).

source: There has been no release the last few years, although there is a development version 1.81.
es: No se ha publicado una nueva versión en los últimos años, aunque existe una versión en desarrollo 1.81.

source: Source code is freely available.
es: El código se distribuye libremente.

source: *Elvis* Elvis Another Vi clone, made by Steve Kirkendall.
es: *Elvis* Elvis Otro clon de Vi, hecho por Steve Kirkendall.

source: Very compact but isn't as flexible as Vim.
es: Muy compacto pero menos flexible que Vim.

source: The version used is 2.1.
es: La versión referida es 2.1.

source: It is still being developed.
es: Aún está en desarrollo.

source: Source code is freely available.
es: El código se distribuye libremente.

source: Notation *notation*
es: Notación *notación* *leyenda*

source: When syntax highlighting is used to read this, text that is not typed literally is often highlighted with the Special group.
es: Si usa el resaltado de sintaxis para leer esto, el texto que no se ha introducido literalmente será resaltado como perteneciente al grupo Special.

source: These are items in [], {} and <>, and CTRL-X.
es: Estos son los elementos [], {}, <> y CTRL-X.

source: Note that Vim uses all possible characters in commands.
es: Tenga en cuenta que Vim utiliza todos los caracteres posibles en las órdenes.

source: Sometimes the [], {} and <> are part of what you type, the context should make this clear.
es: El contexto aclarará cuando los signos [], () y <> son parte de texto literal.

source: [] Characters in square brackets are optional.
es: [] Los caracteres entre corchetes son opcionales.

source: *count* *[count]* *E489* [count] An optional number that may precede the command to multiply or iterate the command.
es: *[número]* *[count]* *E489* Un número opcional que puede preceder a la orden para multiplicar o cambiar la orden.

source: If no number is given, a count of one is used, unless otherwise noted.
es: Si no introduce un número, se usará uno a menos que se indique lo contrario.

source: Note that in this manual the [count] is not mentioned in the description of the command, but only in the explanation.
es: Tenga en cuenta] que en este manual, el [número no se menciona en las descripciones de las órdenes.

source: This was done to make the commands easier to look up.
es: La razón para esto es facilitar la lectura de las órdenes.

source: If the 'showcmd' option is on, the (partially) entered count is shown at the bottom of the window.
es: Si la opción esta activada, el número (parcialmente) introducido se mostrará en la parte inferior de la ventana.

source: You can use <Del> to erase the last digit (|N<Del>|).
es: Puede usar <Supr> para eliminar el último dígito (|N<Supr>|).
