Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: :set filetype < If the result is "filetype=" then the problem is indeed that Vim doesn't know what type of file this is.
es: :set filetype < Si el resultado es «filetype=» entonces el problema es que Vim no sabe que de qué tipo de archivo se trata.

source: You can set the type manually: >
es: Puede decirle el tipo de archivo de forma manual: >

source: < To see which types are available, look in the directory $VIMRUNTIME/syntax.
es: < Para ver qué tipos de archivos están disponibles, mire en el directorio «$VIMRUNTIME/syntax».

source: For the GUI you can use the Syntax menu.
es: Para la GUI puede usar el menú Syntax.

source: Setting the filetype can also be done with a |modeline|, so that the file will be highlighted each time you edit it.
es: También puede activar el tipo de archivo con un |modeline|, de forma que el archivo se resaltará cada vez que lo edite.

source: For example, this line can be used in a Makefile (put it near the start or end of the file): >
es: Por ejemplo, puede emplear esta línea para los Makefiles (insértela cerca del principio o el final del archivo): >

source: < You might know how to detect the file type yourself.
es: < Quizá sepa cómo detectar el tipo de archivo por cuenta propia.

source: Often the file name extension (after the dot) can be used.
es: A menudo se puede emplear la extensión del nombre de archivo.

source: See |new-filetype| for how to tell Vim to detect that file type.
es: Véase |new-filetype| para ver cómo decirle a Vim que detecte el tipo.

source: - There is no highlighting for your file type.
es: - No hay resaltado para su tipo de archivo.

source: You could try using a similar file type by manually setting it as mentioned above.
es: Puede intentar usar un archivo similar activándolo manualmente como se explica más arriba.

source: If that isn't good enough, you can write your own syntax file, see |mysyntaxfile|.
es: Si no tiene suficiente, puede escribir su propio archivo de sintaxis, consulte |mysyntaxfile|.

source: - The colored text is very hard to read.
es: - El texto coloreado es muy difícil de leer.

source: Vim guesses the background color that you are using.
es: Vim trata de averiguar el color de fondo que está usando.

source: If it is black (or another dark color) it will use light colors for text.
es: Si es negro (u otro color oscuro) usará colores claros para el texto.

source: If it is white (or another light color) it will use dark colors for text.
es: Si es blanco (u otro color claro) usará colores oscuros para el texto.

source: If Vim guessed wrong the text will be hard to read.
es: Si Vim no ha acertado, el texto se hará difícil de leer.

source: To solve this, set the 'background' option.
es: Para solucionar esto, active la opción 'background'.

source: For a dark background: >
es: Para un fondo oscuro: >

source: < And for a light background: >
es: < Y para un fondo claro: >

source: < Make sure you put this _before_ the ":syntax enable" command, otherwise the colors will already have been set.
es: < Asegúrese de que lo pone _antes_ de «:syntax enable», en caso contrario, los colores ya se habrán definido.

source: You could do ":syntax reset" after setting 'background' to make Vim set the default colors again.
es: Puede hacer «:syntax reset» tras activar 'background' para hacer que Vim vuelva a redefinir los colores.

source: *06.3* Different colors *:syn-default-override*
es: *06.3* Diferentes colores *:syn-default-override*

source: If you don't like the default colors, you can select another color scheme.
es: Si no le gustan los colores predeterminados, puede seleccionar otro esquema de colores.

source: In the GUI use the Edit/Color Scheme menu.
es: En GVim, use el menú Edit/Color.

source: You can also type the command: >
es: También puede usar la orden: >

source: "evening" is the name of the color scheme.
es: «evening» es el nombre del esquema de colores.

source: There are several others you might want to try out.
es: Hay muchos otros que quizá quiera probar.

source: Look in the directory $VIMRUNTIME/colors.
es: Mire en el directorio «$MYVIMRUNTIME/colors».

source: You could also write your own color scheme.
es: También puede escribir su propio esquema de colores.

source: This is how you do it:
es: Así es que como se hace:

source: Select a color scheme that comes close.
es: Seleccione un esquema que se parezca.

source: Copy this file to your own Vim directory.
es: Copie ese archivo a su propio directorio de Vim.

source: For Unix, this should work: >
es: Bajo Unix, esto debería funcionar: >

source: !mkdir ~/.vim/colors !cp $VIMRUNTIME/colors/morning.vim ~/.vim/colors/mine.vim < This is done from Vim, because it knows the value of $VIMRUNTIME.
es: !mkdir ~/.vim/colors !cp $VIMRUNTIME/colors/morning.vim ~/.vim/colors/mine.vim < Esto se hace desde Vim, porque conoce el valor de $VIMRUNTIME.

source: Edit the color scheme file.
es: Editar el archivo del esquema de colores.

source: These entries are useful:
es: Estas entradas son útiles:

source: term attributes in a B&W terminal cterm attributes in a color terminal ctermfg foreground color in a color terminal ctermbg background color in a color terminal gui attributes in the GUI guifg foreground color in the GUI guibg background color in the GUI
es: term atributos en una terminal B/N cterm atributos en una terminal a color ctermfg color frontal de una terminal a color ctermbg color de fondo de una terminal a color gui atributos de la GUI guifg color frontal de la GUI guibg color de fondo de la GUI

source: For example, to make comments green: >
es: Por ejemplo, para hacer los comentarios en verde: >

source: :highlight Comment ctermfg=green guifg=green < Attributes you can use for "cterm" and "gui" are "bold" and "underline".
es: :highlight Comment ctermfg=green guifg=green < Los atributos que puede usar para «cterm» y «gui» son «bold» y «underline».

source: If you want both, use "bold,underline".
es: Si quiere los dos, escriba «bold,underline».

source: For details see the |:highlight| command.
es: Para más detalles, consulte la orden |:highlight|.

source: Tell Vim to always use your color scheme.
es: Decir a Vim que use siempre su esquema.

source: Put this line in your |vimrc|: >
es: Incluya esto en su |vimrc|: >

source: You will see text in various color combinations.
es: Verá texto en varias combinaciones de colores.

source: You can check which ones are readable and look nice.
es: Puede comprobar cuáles son legibles y que tienen un apariencia agradable.

source: *06.4* With colors or without colors
es: *06.4* Con colores o sin colores

source: Displaying text in color takes a lot of effort.
es: Mostrar texto en color conlleva un gran uso del procesador.

source: If you find the displaying too slow, you might want to disable syntax highlighting for a moment: >
es: Si le parece que el texto se muestra muy lentamente, puede desactivar el resaltado momentáneamente: >

source: *:syn-off* If you want to stop highlighting completely use: >
es: *:syn-off* Si quiere desactivar el resaltado por completo use: >

source: *:syn-manual* If you want syntax highlighting only for specific files, use this: >
es: *:syn-manual* Si desea resaltado de sintaxis sólo para archivos específicos, use esto: >

source: This will enable the syntax highlighting, but not switch it on automatically when starting to edit a buffer.
es: Esto permitirá el resaltado, pero no lo activará automáticamente cuando edites un búfer.

source: To switch highlighting on for the current buffer, set the 'syntax' option: >
es: Para activarla en el búfer actual, asigne la opción 'syntax' del siguiente modo: >

source: *06.5* Printing with colors *syntax-printing*
es: *06.5* Imprimir con colores *syntax-printing*

source: You will get the usual printer dialog, where you can select the printer and a few settings.
es: Le aparecerá el típico diálogo de impresora, donde puede seleccionarla junto con algunas opciones.

source: If you have a color printer, the paper output should look the same as what you see inside Vim.
es: Si tiene una impresora a color, la salida impresa debe ser similar a lo que aparece en pantalla.

source: But when you use a dark background the colors will be adjusted to look good on white paper.
es: Sin embargo, cuando tiene un fondo oscuro, los colores se ajustarán para verse bien sobre blanco.

source: There are several options that change the way Vim prints: 'printdevice' 'printheader' 'printfont' 'printoptions'
es: Hay diversas opciones que modifican el modo en el que Vim imprime: 'printdevice' 'printheader' 'printfont' 'printoptions'

source: "v" starts Visual mode.
es: «v» inicia el modo Visual.

source: "100j" moves a hundred lines down, they will be highlighted.
es: «100j» le mueve 100 líneas hacia abajo, que se resaltarán.

source: Then ":hardcopy" will print those lines.
es: Por último «:hardcopy» imprimirá las líneas destacadas.

source: You can use other commands to move in Visual mode, of course.
es: Puede usar otras órdenes para moverse en modo Visual, por supuesto.

source: This also works on Unix, if you have a PostScript printer.
es: Esto también funciona en Unix si tiene una impresora PostScript.

source: Otherwise, you will have to do a bit more work.
es: En caso contrario, tendrá que hacer un poco más de trabajo.

source: You need to convert the text to HTML first, and then print it from a web browser.
es: Tendrá que convertir a HTML primero y luego imprimirlo desde un navegador web.

source: You will see it crunching away, this can take quite a while for a large file.
es: Lo verá trabajar, esto puede llevar un buen tiempo para archivos grandes.

source: Some time later another window shows the HTML code.
es: Un rato después otra ventana muestra el código HTML.

source: Now write this somewhere (doesn't matter where, you throw it away later): > :write main.c.html
es: Ahora guarde esto en algún lugar (no importa dónde, lo eliminará en cuanto termine de imprimir): > :write main.c.html

source: Open this file in your favorite browser and print it from there.
es: Abra este archivo en su navegador favorito e imprímalo desde allí.

source: If all goes well, the output should look exactly as it does in Vim.
es: Si todo ha salido bien, la salida debe tener la misma apariencia que tenía en Vim.

source: See |2html.vim| for details.
es: Véase |2html.vim| para más detalles.

source: Don't forget to delete the HTML file when you are done with it.
es: No se olvide de eliminar el archivo HTML.

source: *06.6* Further reading
es: *06.6* Más información

source: |usr_44.txt| Your own syntax highlighted.
es: |usr_44.txt| Su propio resaltado de sintaxis.

source: |syntax| All the details.
es: |syntax| Todos los detalles.

source: *usr_12.txt* For Vim version 7.3.
es: *usr_12.esx* Para Vim versión 7.3.

source: Clever tricks
es: Trucos

source: By combining several commands you can make Vim do nearly everything.
es: Puedes conseguir que Vim haga casi cualquier cosa,.mediante la combinación varias órdenes.

source: In this chapter a number of useful combinations will be presented.
es: En este capítulo, presentaremos una serie de combinaciones útiles.

source: This uses the commands introduced in the previous chapters and a few more.
es: Esto emplea las órdenes introducidos en capítulos anteriores y algunos más.

source: |12.1| Replace a word |12.2| Change "Last, First" to "First Last" |12.3| Sort a list |12.4| Reverse line order |12.5| Count words |12.6| Find a man page |12.7| Trim blanks |12.8| Find where a word is used
es: |12.1| Reemplazar una palabra |12.2| Cambiar «Último, Primero» a «Primero Último» |12.3| Ordenar una lista |12.4| Invertir el orden de las líneas |12.5| Contar palabras |12.6| Encontrar una página de manual |12.7| Eliminar espacios en blanco sobrantes |12.8| Buscar dónde se emplea una palabra

source: Next chapter: |usr_20.txt| Typing command-line commands quickly Previous chapter: |usr_11.txt| Recovering from a crash Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_20.esx| Ser eficaz con la línea de órdenes Capítulo anterior: |usr_11.esx| Recuperarse de un fallo Tabla de contenidos: |usr_toc.esx|

source: *12.1* Replace a word
es: *12.1* Reemplazar una palabra

source: :%s/four/4/g
es: :%s/cuatro/4/g

source: :%s/\<four/4/g
es: :%s/\<cuatro/4/g

source: Obviously, this still goes wrong on "fourteen".
es: Obviamente, esto también funcionará mal con «cuatrocientos».

source: Use "\>" to match the end of a word: >
es: Use «\>» para concordar el final de una palabra: >

source: :%s/\<four\>/4/g
es: :%s/\<cuatro\>/4/g

source: If you are programming, you might want to replace "four" in comments, but not in the code.
es: Si está programando, quizá desee reemplazar «cuatro» en los comentarios, pero no en el código.

source: Since this is difficult to specify, add the "c" flag to have the substitute command prompt you for each replacement: >
es: Ya que es difícil de especificar, añada la opción «c» para que se le pida una confirmación cada vez que se vaya a reemplazar la palabra: >

source: :%s/\<four\>/4/gc
es: :%s/\<cuatro\>/4/gc

source: Suppose you want to replace a word in more than one file.
es: Suponga que quiere reemplazar una palabra en más de un archivo.

source: You could edit each file and type the command manually.
es: Puede editar cada archivo y escribir la orden manualmente.

source: It's a lot faster to use record and playback.
es: Es mucho más fácil usar la grabación y reproducción.

source: Let's assume you have a directory with C++ files, all ending in ".cpp".
es: Vamos a suponer que tiene un directorio con archivos C++ en el que todos terminan en «.cpp».

source: There is a function called "GetResp" that you want to rename to "GetAnswer".
es: Quiere renombrar la función «GetResp» a «GetAnswer».

source: At the last file you will get an error message, because ":wnext" cannot move to the next file.
es: En el último archivo obtendrá un mensaje de error, porque «wnext» no puede ir a un archivo siguiente.

source: This stops the execution, and everything is done.
es: Esto parará la ejecución y todo terminará.

source: Note: When playing back a recorded sequence, an error stops the execution.
es: Nota: Cuando vuelva a reproducir una secuencia grabada, un error detendrá la ejecución.

source: Therefore, make sure you don't get an error message when recording.
es: Cuide de no producir errores cuando grabes.

source: There is one catch: If one of the .cpp files does not contain the word "GetResp", you will get an error and replacing will stop.
es: Hay un pequeño problema: Si uno de los archivos .cpp no contiene la palabra «GetResp», obtendrá un error y la ejecución se detendrá.

source: To avoid this, add the "e" flag to the substitute command: >
es: Para evitar esto, añada la opción «e» a la orden de sustituir: >

source: *12.2* Change "Last, First" to "First Last"
es: *12.2* Cambiar «Último, Primero» a «Primero Último»

source: Doe, John ~ Smith, Peter ~
es: Pepe, Juan ~ Amancio, Pedro ~

source: John Doe ~ Peter Smith ~
es: Juan Pepe ~ Pedro Amancio ~

source: Let's break this down in parts.
es: Veámoslo por partes.

source: Obviously it starts with a substitute command.
es: Obviamente comienza con la orden «substitute».

source: The "%" is the line range, which stands for the whole file.
es: El «%» es el rango de líneas, que se refiere al archivo completo.

source: Thus the substitution is done in every line in the file.
es: Por lo tanto la sustitución se producirá en cada línea del archivo.

source: The arguments for the substitute command are "/from/to/".
es: Los argumentos para la orden sustituir son «/desde/a/».

source: The slashes separate the "from" pattern and the "to" string.
es: Las barras separan el patrón «desde» y la cadena "hacia".

source: This is what the "from" pattern contains: \([^,]*\), \(.*\) ~
es: Esto es lo que el patrón «desde» contiene: \([^,]*\), \(.*\) ~

source: The first part between \( \) matches "Last" \( \) match anything but a comma [^,] any number of times * matches ", " literally , The second part between \( \) matches "First" \( \) any character .
es: La primera parte entre \( \) concuerda «Último» \( \) concordar cualquier cosa excepto una coma [^,] cualquier número de veces * concuerda literalmente ", " , La segunda parte entre \( \) concuerda «Primero» \( \) cualquier carácter .

source: any number of times *
es: cualquier número de veces *

source: In the "to" part we have "\2" and "\1".
es: En la parte «a» tenemos «\2» y «\1».

source: These are called backreferences.
es: A esto se le llaman referencias «inversas».

source: They refer to the text matched by the "\( \)" parts in the pattern.
es: Se refieren al texto encontrado por los «\( \)» del patrón.

source: "\2" refers to the text matched by the second "\( \)", which is the "First" name.
es: «\2» se refiere al texto del segundo «\( \)», que es el nombre «Primero».

source: "\1" refers to the first "\( \)", which is the "Last" name.
es: «\1» se refiere al primer «\( \)», que es el nombre «Último».

source: You can use up to nine backreferences in the "to" part of a substitute command.
es: Puede usar hasta nueve referencias «inversas» en la parte «a» de una orden de sustitución.

source: "\0" stands for the whole matched pattern.
es: «\0x se refiere a la cadena coincidente completa.

source: There are a few more special items in a substitute command, see |sub-replace-special|.
es: Hay otros elementos especiales en una orden sustituir, consulte |sub-replace-special|.

source: *12.3* Sort a list
es: *12.3* Ordenar una lista

source: In a Makefile you often have a list of files.
es: A menudo, en un archivo Makefile tiene una lista de archivos.

source: This goes to the first line, where "OBJS" is the first thing in the line.
es: Esto va a la primera línea, donde «OBJS» es lo primero que se encuentra en una línea.

source: Then it goes one line down and filters the lines until the next empty line.
es: Luego baja una línea y filtra las líneas hasta encontrar una línea vacía.

source: You could also select the lines in Visual mode and then use "!sort".
es: También podría seleccionar las líneas en modo Visual y escribir «!sort».

source: That's easier to type, but more work when there are many lines.
es: Es más fácil pero conlleva más trabajo cuando hay muchas líneas.

source: The result is this:
es: El resultado es el siguiente:

source: Notice that a backslash at the end of each line is used to indicate the line continues.
es: Observe que una barra inversa al final de cada línea se usa para indicar que la línea continúa.

source: After sorting, this is wrong!
es: Tras ordenar, está mal puesto.

source: The "backup.o" line that was at the end didn't have a backslash.
es: La línea de «backup.o» que estaba al final no tenía una barra inversa.

source: Now that it sorts to another place, it must have a backslash.
es: Ahora que se sitúa en otro lugar debe tener una barra inversa.

source: The simplest solution is to add the backslash with "A \<Esc>".
es: La solución más sencilla es añadirla con «A \<Esc>».

source: You can keep the backslash in the last line, if you make sure an empty line comes after it.
es: Puede mantener la barra en la última línea si se asegura de que una línea en blanco viene justo después.

source: That way you don't have this problem again.
es: De este modo no tendrá este problema de nuevo.

source: *12.4* Reverse line order
es: *12.4* Invertir el orden de las líneas

source: The |:global| command can be combined with the |:move| command to move all the lines before the first line, resulting in a reversed file.
es: La orden «|:global|» se debe combinar con la orden «|:move|» para mover todas las líneas antes de la primera línea, invirtiendo el archivo.

source: The command is: >
es: La orden es: >

source: The "^" regular expression matches the beginning of the line (even if the line is blank).
es: La expresión regular «^» coincide con el comienzo de línea (incluso si la línea está en blanco).

source: The |:move| command moves the matching line to after the mythical zeroth line, so the current matching line becomes the first line of the file.
es: La orden «|:move|» mueve la línea justo después de la mítica «línea cero», de forma que se convierte en la primera línea.

source: As the |:global| command is not confused by the changing line numbering, |:global| proceeds to match all remaining lines of the file and puts each as the first.
es: Como la orden «|:global|» no se confunde al cambiar la numeración de las líneas, «|:global|» procede a concordar el resto de líneas del archivo y pone cada una como la primera.

source: This also works on a range of lines.
es: Esto también funciona sobre un rango de líneas.

source: First move to above the first line and mark it with "mt".
es: Vaya primero a la línea de encima de la primera y márcala con "mt".

source: Then move the cursor to the last line in the range and type: >
es: Luego pon el cursor en la última línea del rango y escribe: >

source: *12.5* Count words
es: *12.5* Contar palabras

source: Sometimes you have to write a text with a maximum number of words.
es: A veces puede escribir un texto con un número máximo de palabras.

source: Vim can count the words for you.
es: Vim puede contar las palabras por Ud.

source: When the whole file is what you want to count the words in, use this command: >
es: Cuando quiera usar el archivo completo para contar las palabras, use la siguiente orden: >

source: Do not type a space after the g, this is just used here to make the command easy to read.
es: No teclee un espacio tras la «g», esto está aquí para hacer que la orden sea fácil de leer.

source: The output looks like this:
es: La salida tendrá este aspecto:

source: Col 1 of 0; Line 141 of 157; Word 748 of 774; Byte 4489 of 4976 ~
es: Col 1 of 0; Línea 141 of 157; Palabra 748 of 774; Carácter 4489 of 4976 ~

source: When the text is only part of a file, you could move to the start of the text, type "g CTRL-G", move to the end of the text, type "g CTRL-G" again, and then use your brain to compute the difference in the word position.
es: Cuando el texto sea sólo una parte del archivo, puede ir al comienzo del texto, pulsar «g CTRL-G», ir al final del texto y volver a escribir «g CTRL-G» y usar la cabeza para calcular la diferencia.

source: That's a good exercise, but there is an easier way.
es: Es un buen ejercicio, pero hay un modo más sencillo.

source: With Visual mode, select the text you want to count words in.
es: En el modo Visual, seleccione el texto sobre el que quiera contar las palabras.

source: Then type g CTRL-G.
es: Escriba «g CTRL-G».

source: Selected 5 of 293 Lines; 70 of 1884 Words; 359 of 10928 Bytes ~
es: Selección 5 of 293 Líneas; 70 of 1884 Palabras; 359 of 10928 Bytes ~

source: *12.6* Find a man page *find-manpage*
es: *12.6* Encontrar una página de manual *find-manpage*

source: Vim will run the external "man" program on the word.
es: Vim ejecutará el programa externo «man» sobre la palabra.

source: If the man page is found, it is displayed.
es: Si se encuentra la página de manual, se mostrará.

source: This uses the normal pager to scroll through the text (mostly the "more" program).
es: Esto usa el paginador normal para desplazarse por el texto (con el programa «more»).

source: When you get to the end pressing <Enter> will get you back into Vim.
es: Cuando llegue al final, presionando <Intro> le devolverá a Vim.

source: A disadvantage is that you can't see the man page and the text you are working on at the same time.
es: Una desventaja es que no puede ver la página de manual y el texto en el que trabaja al mismo tiempo.

source: There is a trick to make the man page appear in a Vim window.
es: Hay un truco para hacer que la página de manual aparezca en una ventana de Vim.
