Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: You can try searching with "/^the$", it will only match a single line consisting of "the".
es: Puede intentar buscar con «/^que$», que sólo se emparejará con una única línea consistente en «que».

source: White space does matter here, thus if a line contains a space after the word, like "the ", the pattern will not match.
es: El espacio en blanco se considera, por lo que si contiene un espacio tras la palabra, como «que», el patrón no coincide.

source: If you really want to match a dot, you must avoid its special meaning by putting a backslash before it.
es: Si realmente desea coinciordar un punto, debe suprimir su significado especial poniendo antes una barra inversa.

source: If you search for "ter.", you will find these matches:
es: Si busca «an.», obtendría las siguientes coincidencias:

source: *03.10* Using marks
es: *03.10* Uso de marcadores o marcas

source: When you make a jump to a position with the "G" command, Vim remembers the position from before this jump.
es: Cuando hace un salto a una posición con la orden «G», Vim recuerda la posición antes de el salto.

source: This position is called a mark.
es: Esta posición se llama marca o marcador.

source: To go back where you came from, use this command: >
es: Para volver al punto anterior del que te encuentras, use la siguiente orden: >

source: This ` is a backtick or open single-quote character.
es: Esta ` es una tilde invertida o carácter de abrir comillas simples.

source: If you use the same command a second time you will jump back again.
es: Si usa esta misma orden de nuevo, volverá hacia atrás.

source: That's because the ` command is a jump itself, and the position from before this jump is remembered.
es: Esto es porque la orden «`» es un salto en si mismo, y la posición anterior al salto también se registra.

source: The `` command jumps back and forth, between two points.
es: La orden «``» salta hacia atrás y hacia delante, entre dos puntos.

source: The CTRL-O command jumps to older positions (Hint: O for older).
es: La orden CTRL-O salta a posiciones anteriores (Truco: O de «older», viejo).

source: CTRL-I then jumps back to newer positions (Hint: I is just next to O on the keyboard).
es: CTRL-I salta de vuelta a posiciones más recientes (Truco: la I está justo al lado de la O en el teclado).

source: Consider this sequence of commands: >
es: Observe esta secuencia de órdenes: >

source: 33G /^The CTRL-O
es: 33G /^El CTRL-O

source: You first jump to line 33, then search for a line that starts with "The".
es: Primero salta a la línea 33, luego salta a una línea que comienza con «El».

source: Then with CTRL-O you jump back to line 33.
es: Entonces vuelva con CTRL-O a la línea 33.

source: Another CTRL-O takes you back to where you started.
es: Otro CTRL-O le devuelve a donde comenzó.

source: If you now use CTRL-I you jump to line 33 again.
es: Si ahora usa CTRL-I, volverá a la línea 33.

source: And to the match for "The" with another CTRL-I.
es: Con otro CTRL-I vuelve al «El» identificado.

source: | example text ^ | 33G | example text | CTRL-O | CTRL-I | example text | | V line 33 text ^ V | example text | | /^The | example text | CTRL-O | CTRL-I V There you are | V example text
es: | texto de ejemplo ^ | 33G | texto de ejemplo | CTRL-O | CTRL-I | texto de ejemplo | | V texto de la línea 33 ^ V | texto de ejemplo | | /^The | texto de ejemplo | CTRL-O | CTRL-I V Aquí estás | V texto de ejemplo

source: Note: CTRL-I is the same as <Tab>.
es: Nota: CTRL-I hace lo mismo que <Tab>.

source: The ":jumps" command gives a list of positions you jumped to.
es: La orden «:jumps» le da una lista de posiciones a las que ha saltado.

source: The entry which you used last is marked with a ">".
es: La última entrada que ha usado está marcada con un «>».

source: NAMED MARKS *bookmark*
es: MARCADORES *bookmark*

source: Vim enables you to place your own marks in the text.
es: Vim le permite colocar sus propias marcas en el texto.

source: The command "ma" marks the place under the cursor as mark a.
es: La orden «m» marca el lugar sobre el que se encuentra el cursor como «a».

source: You can place 26 marks (a through z) in your text.
es: Puede poner hasta 26 marcas (a-z).

source: You can't see them, it's just a position that Vim remembers.
es: No puede verlas, son simplemente posiciones que Vim recuerda.

source: To go to a mark, use the command `{mark}, where {mark} is the mark letter.
es: Para ir a una marca, use la orden `{marca}, donde {marca} es la letra del marcador.

source: Thus to move to the a mark: > `a
es: Para moverse a la marca «a»: > `a

source: The command 'mark (single quotation mark, or apostrophe) moves you to the beginning of the line containing the mark.
es: La orden '{marca} (apóstrofe o signo de comillas simples) le lleva al comienzo de la línea que contiene la marca.

source: This differs from the `mark command, which moves you to marked column.
es: Esto difiere de la orden `{marca}, que le desplaza a la columna donde se hizo la marca.

source: The marks can be very useful when working on two related parts in a file.
es: Los marcadores pueden ser muy útiles cuando se trabaja en dos partes del archivo relacionadas.

source: Suppose you have some text near the start of the file you need to look at, while working on some text near the end of the file.
es: Suponga que tiene un texto cerca del comienzo del archivo que necesitas mirar mientras trabaja en otra parte.

source: Move to the text at the start and place the s (start) mark there: >
es: Vaya al texto del comienzo y ponga un marcador «s» (start) allí: >

source: Then you can use '' to jump back to where you were, or 'e to jump to the text you were working on at the end.
es: Luego puede usar '' para saltar de vuelta a donde estaba, o 'e para saltar al texto donde estuvo trabajando.

source: There is nothing special about using s for start and e for end, they are just easy to remember.
es: No hay nada especial en usar s para el comienzo o e para el final, son simplemente fáciles de recordar.

source: You will notice a few special marks.
es: Verá unos cuantos marcadores especiales.

source: These include:
es: Entre ellos:

source: ' The cursor position before doing a jump " The cursor position when last editing the file [ Start of the last change ] End of the last change
es: ' La posición del cursor antes del último salto " La posición del cursor antes de la última edición [ Comienzo del último cambio ] Final del último cambio

source: *usr_27.txt* For Vim version 7.3.
es: *usr_27.esx* Para Vim version 7.3.

source: Last change: 2010 Mar 28
es: Último cambio: 28/3/2010

source: Search commands and patterns
es: Órdenes y patrones de búsqueda

source: |27.1| Ignoring case |27.2| Wrapping around the file end |27.3| Offsets |27.4| Matching multiple times |27.5| Alternatives |27.6| Character ranges |27.7| Character classes |27.8| Matching a line break |27.9| Examples
es: |27.1| Ignorar la distinción entre mayúsculas y minúsculas |27.2| Justificar el fin del archivo |27.3| Dirección relativa («offsets») |27.4| Emparejar varios elementos |27.5| Alternativas |27.6| Rangos de caracteres |27.7| Clases de caracteres |27.8| Coincidir con un salto de línea |27.9| Ejemplos

source: Next chapter: |usr_28.txt| Folding Previous chapter: |usr_26.txt| Repeating Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_28.txt| Plegar Capítulo anterior: |usr_25.esx| Repetición Tabla de contenidos: |usr_toc.esx|

source: *27.1* Ignoring case
es: *27.1* Ignorar la distinción entre mayúsculas y minúsculas

source: By default, Vim's searches are case sensitive.
es: Vim distingue entre mayúsculas y minúsculas al realizar un búsqueda de forma predeterminada.

source: Therefore, "include", "INCLUDE", and "Include" are three different words and a search will match only one of them.
es: «INCLUDE», «Include» e «include» son por ello tres palabras distintas, y una búsqueda encontraría sólo una de ellas.

source: Now switch on the 'ignorecase' option: >
es: Active ahora la opción 'ignorecase': >

source: But let's keep it set, and search for "INCLUDE".
es: Vamos a dejar esta opción activada, y realizar una búsqueda de «INCLUDE».

source: It will match exactly the same text as "include" did.
es: Encontrará el mismo texto que «include».

source: Now set the 'smartcase' option: >
es: Active ahora la opción 'smartcase': >

source: If you have a pattern with at least one uppercase character, the search becomes case sensitive.
es: Si tiene un patrón con al menos un carácter en mayúscula, la búsqueda no distinguirá entre mayúsculas y minúsculas.

source: The idea is that you didn't have to type that uppercase character, so you must have done it because you wanted case to match.
es: La idea es que no necesitaba escribir ese carácter en mayúscula, y que por ello lo que deseaba era encontrar coincidencias con distinción entre mayúsculas y minúsculas.

source: That's smart!
es: ¡Qué inteligente!

source: With these two options set you find the following matches:
es: Obtendría las siguientes coincidencias de activar ambas opciones:

source: pattern matches ~ word word, Word, WORD, WoRd, etc.
es: patrón coincidencias ~ palabra palabra, Palabra, PALABRA, PaLaBRa etc.

source: Word Word WORD WORD WoRd WoRd
es: Palabra Palabra PALABRA PALABRA PaLaBRa PaLaBRa

source: If you want to ignore case for one specific pattern, you can do this by prepending the "\c" string.
es: Puede anexar la cadena «\c» si desea ignorar esta distinción para un patrón en particular.

source: Using "\C" will make the pattern to match case.
es: Usar «\C» activará la distinción.

source: This overrules the 'ignorecase' and 'smartcase' options, when "\c" or "\C" is used their value doesn't matter.
es: Esto invalida las opciones 'ignorecase' y 'smartcase', ya que usar «\c» o «\C» obvia el valor de estas opciones.

source: pattern matches ~ \Cword word \CWord Word \cword word, Word, WORD, WoRd, etc.
es: patrón coincidencias ~ \Cpalabra palabra \CPalabra Palabra \cpalabra palabra, Palabra, PALABRA, PaLaBrA, etc.

source: \cWord word, Word, WORD, WoRd, etc.
es: \cPalabra palabra, Palabra, PALABRA, PaLaBrA, etc.

source: A big advantage of using "\c" and "\C" is that it sticks with the pattern.
es: Una enorme ventaja de usar «\c» y «\C» es que se mantienen ligadas al patrón.

source: Thus if you repeat a pattern from the search history, the same will happen, no matter if 'ignorecase' or 'smartcase' was changed.
es: Por ello, si repite un patrón desde el registro de búsquedas obtendrá el mismo resultado sin importar si cualquier cambio de 'ignorecase' y 'smartcase'.

source: Note: The use of "\" items in search patterns depends on the 'magic' option.
es: Nota: El uso del elemento «\» en patrones de búsqueda depende de la opción 'magic'.

source: In this chapter we will assume 'magic' is on, because that is the standard and recommended setting.
es: En estos capítulos daremos por sentado que 'magic' está activado, ya que es la configuración estándar y recomendad.

source: If you would change 'magic', many search patterns would suddenly become invalid.
es: De cambiar 'magic' muchos patrones de búsqueda no serían válidos.

source: Note: If your search takes much longer than you expected, you can interrupt it with CTRL-C on Unix and CTRL-Break on MS-DOS and MS-Windows.
es: Nota: Si la búsqueda lleva más tiempo del esperado, puede interrumpir esta con CTRL-C en Unix y CTRL-Break en MS-DOS y MS-Windows.

source: *27.2* Wrapping around the file end
es: *27.2* Justificar el fin del archivo

source: By default, a forward search starts searching for the given string at the current cursor location.
es: Por omisión, una búsqueda hacia adelante se inicia buscando la cadena dada en la ubicación presente del cursor.

source: It then proceeds to the end of the file.
es: Después continua hasta el final del archivo.

source: If it has not found the string by that time, it starts from the beginning and searches from the start of the file to the cursor location.
es: Si no ha encontrado ninguna cadena, vuelve al inicio y busca desde el principio del archivo.

source: Keep in mind that when repeating the "n" command to search for the next match, you eventually get back to the first match.
es: Tenga en cuenta que, de repetir la orden «n» para buscar la siguiente coincidencia, al final volverá a la primera.

source: If you don't notice this you keep searching forever!
es: ¡Buscará para siempre si no nota esto!

source: To give you a hint, Vim displays this message:
es: Vim le da una pista con la forma del siguiente mensaje:

source: search hit BOTTOM, continuing at TOP ~
es: La búsqueda ha llegado al FINAL, continuando desde el PRINCIPIO ~

source: search hit TOP, continuing at BOTTOM ~
es: La búsqueda ha llegado al FINAL, continuando desde el PRINCIPIO ~

source: Still, you don't know when you are back at the first match.
es: Aún así,no sabe cuando vuelve a la primera coincidencia.

source: One way to see this is by switching on the 'ruler' option: >
es: Una forma de ver esto es activando la opción 'ruler'.

source: Vim will display the cursor position in the lower righthand corner of the window (in the status line if there is one).
es: Muestra siempre la posición actual en la esquina inferior derecha de la ventana (en la línea de estado, de existir).

source: The first number is the line number of the cursor.
es: El primer número es el número de la línea del cursor.

source: Remember the line number where you started, so that you can check if you passed this position again.
es: Recuerde el número de la línea inicial, de manera pueda comprobar si ya pasó por esta posición.

source: E385: search hit BOTTOM without match for: forever ~
es: E385: La búsqueda ha llegado al FINAL sin una coincidencia para: forever ~

source: Thus you can find all matches by going to the start of the file with "gg" and keep searching until you see this message.
es: Así, puede encontrar todas las coincidencias desplazándose al inicio del archivo con «gg», y buscar hasta ver este mensaje.

source: If you search in the other direction, using "?", you get:
es: Si busca en otra dirección, usando, «?», obtendrá:

source: E384: search hit TOP without match for: forever ~
es: E385: La búsqueda ha llegado al PRINCIPIO sin una coincidencia para: forever ~

source: *27.3* Offsets
es: *27.3* Dirección relativa («Offsets»)

source: By default, the search command leaves the cursor positioned on the beginning of the pattern.
es: Por omisión, la orden de búsqueda posiciona el cursor al inicio del patrón.

source: You can tell Vim to leave it some other place by specifying an offset.
es: Puede hacer que Vim lo posicione en algún lugar especificando una dirección relativa.

source: For the forward search command "/", the offset is specified by appending a slash (/) and the offset: >
es: Para la orden de búsqueda hacia delante «/», la dirección relativa se especifica añadiendo una barra inversa («/») y la dirección relativa: >

source: /default/2
es: /omisión/2

source: This command searches for the pattern "default" and then moves to the beginning of the second line past the pattern.
es: Esta orden busca el patrón «omisión», y después se desplaza al inicio de la segunda línea, más allá del patrón.

source: Using this command on the paragraph above, Vim finds the word "default" in the first line.
es: De usar esta orden en el párrafo anterior, Vim encontraría la palabra «omisión» en la primera línea.

source: Then the cursor is moved two lines down and lands on "an offset".
es: Acto seguido, el cursor se posicionaría dos líneas más abajo, para acabar en la dirección relativa.

source: If the offset is a simple number, the cursor will be placed at the beginning of the line that many lines from the match.
es: El cursor se posicionara al inicio de la línea presente un número n de líneas a partir de la coincidencia, si la dirección relativa es un simple número.

source: The offset number can be positive or negative.
es: El número de dirección relativa puede ser positivo o negativo.

source: If it is positive, the cursor moves down that many lines; if negative, it moves up.
es: De ser positivo, el cursor se desplaza hacia abajo un número n de líneas; si es negativo, se desplaza hacia arriba.

source: The "e" offset indicates an offset from the end of the match.
es: La dirección relativa «e» indica una dirección a partir del final de la coincidencia.

source: It moves the cursor onto the last character of the match.
es: Desplaza el cursor al último carácter de la coincidencia.

source: puts the cursor on the "t" of "const".
es: pone el cursor sobre la «t» de «const».

source: From that position, adding a number moves forward that many characters.
es: Añadir un número le desplazará hacia delante tantos caracteres desde la posición inicial.

source: This command moves to the character just after the match: >
es: Esta orden desplaza el carácter a la posición anterior a la coincidencia: >

source: A positive number moves the cursor to the right, a negative number moves it to the left.
es: Un número positivo desplaza el cursor a la derecha, un número negativo lo desplaza a la izquierda.

source: If the offset begins with "b", the cursor moves to the beginning of the pattern.
es: Si la dirección empieza con una «b», el cursor se desplazará al inicio del patrón.

source: That's not very useful, since leaving out the "b" does the same thing.
es: No es muy útil, ya que se logra lo mismo dejando la «b».

source: It does get useful when a number is added or subtracted.
es: Es de utilidad al añadir o sustraer un número.

source: The cursor then goes forward or backward that many characters.
es: Entonces, el cursor se desplaza hacia delante o atrás tantos caracteres.

source: Moves the cursor to the beginning of the match and then two characters to the right.
es: Desplaza el cursor al principio de la coincidencia, dos caracteres a la derecha.

source: Thus it lands on the "n".
es: Por ello, finaliza en «n».

source: "n" does the same thing.
es: «n» hace lo mismo.

source: To repeat while removing a previously used offset: >
es: Para repetir mientras elimina una dirección usada anteriormente: >

source: When starting a search, it normally starts at the cursor position.
es: Al iniciar una búsqueda, generalmente comienza por la posición del cursor.

source: When you specify a line offset, this can cause trouble.
es: Esto puede causar problemas cuando especifica un desplazamiento relativo de línea.

source: This finds the next word "const" and then moves two lines up.
es: Esto encuentra la siguiente aparición de «const», y después se desplaza dos líneas haci arriba.

source: If you use "n" to search again, Vim could start at the current position and find the same "const" match.
es: Si usa «n» para repetir la búsqueda, puede que Vim la inicie en la posición actual, encontrando la misma coincidencia de «const».

source: Then using the offset again, you would be back where you started.
es: Al usar el mismo desplazamiento relativo, ha vuelto al punto inicio.

source: You would be stuck!
es: ¡Se quedaría atascado!

source: It could be worse: Suppose there is another match with "const" in the next line.
es: Aún pero: supongo que existe otra aparición de «const» en la siguiente línea.

source: Then repeating the forward search would find this match and move two lines up.
es: Repetir la búsqueda hacia adelante encontraría esta coincidencia, y desplazaría el cursor dos líneas atrás.

source: Thus you would actually move the cursor back!
es: ¡Estaría desplazando el cursor hacia atrás todo el rato!

source: When you specify a character offset, Vim will compensate for this.
es: Al especificar un carácter de desplazamiento relativo, Vim dará una compensación.

source: Thus the search starts a few characters forward or backward, so that the same match isn't found again.
es: Por ello, la búsqueda se inicia unos cuantos caracteres delante o detrás, para no encontrar otra vez la misma coincidencia.

source: *27.4* Matching multiple times
es: *27.4* Emparejar varios elementos

source: The "*" item specifies that the item before it can match any number of times.
es: El elemento «*» especifica que el elemento precedente puede emparejarse un número ilimitado de veces.

source: Thus: >
es: Por ello: >

source: matches "a", "aa", "aaa", etc.
es: coincide con «a», «aa», «aaa», etc.

source: But also "" (the empty string), because zero times is included.
es: Pero también « » (una cadena vacía), ya que se incluye por omisión cero veces.

source: The "*" only applies to the item directly before it.
es: «*» sólo afecta al su elemento precedente.

source: Thus "ab*" matches "a", "ab", "abb", "abbb", etc.
es: Por ello, «ab*» encuentra «a», «ab», «abb», «abbb», etc.

source: To match a whole string multiple times, it must be grouped into one item.
es: Para encontrar varias apariciones de una cadena completa, ésta ha de estar agrupada bajo un mismo elemento.

source: This is done by putting "\(" before it and "\)" after it.
es: Esto se hace colocando «\(» antes de la cadena, y «\)» después.

source: Thus this command: >
es: Por ello, la siguiente orden: >

source: Matches: "ab", "abab", "ababab", etc.
es: encuentra «ab», «abab», «ababab», etc.

source: And also "".
es: También « ».

source: To avoid matching the empty string, use "\+".
es: Para evitar que coincida con una cadena vacía, use «\+».

source: This makes the previous item match one or more times.
es: Esto encuentra una o más apariciones del elemento precedente.

source: Matches "ab", "abb", "abbb", etc.
es: Encuentra «ab», «abb», «abbb», etc.

source: It does not match "a" when no "b" follows.
es: No coincide con «a» si no va seguido de «b».

source: To match an optional item, use "\=".
es: Para hacer coincidir un elemento opcional, utilice «\=».

source: /folders\=
es: /directorio\=

source: To match a specific number of items use the form "\{n,m}".
es: Use la forma «\{n,m}» para emparejar un número específico de elementos.

source: "n" and "m" are numbers.
es: «n» y «m» son números.

source: The item before it will be matched "n" to "m" times |inclusive|.
es: El elemento anterior a éstos se emparejará con «n» un número «m» de veces |inclusive|.

source: matches "abbb", "abbbb" and "abbbbb".
es: empareja «abbb», «abbbb» y «abbbbb».

source: When "n" is omitted, it defaults to zero.
es: El valor predeterminado cero en ausencia de «n».

source: When "m" is omitted it defaults to infinity.
es: El valor predeterminado es infinito en ausencia de «m».

source: When ",m" is omitted, it matches exactly "n" times.
es: En ausencia de «m», se empareja exactamente «n» veces.

source: Examples:
es: Ejemplos:

source: pattern match count ~ \{,4} 0, 1, 2, 3 or 4 \{3,} 3, 4, 5, etc.
es: patrón número de coincidencias ~ \{,4} 0, 1, 2, 3 o 4 \{3,} 3, 4, 5, etc.

source: \{0,1} 0 or 1, same as \= \{0,} 0 or more, same as * \{1,} 1 or more, same as \+ \{3} 3
es: \{0,1} 0 o 1, igual que \= \{0,} 0 o más, igual que * \{1,} 1 o más, igual que \+ \{3} 3

source: Will match "ab" in "abbb".
es: Encontraría «ab» en «abbb».

source: Actually, it will never match more than one b, because there is no reason to match more.
es: En realidad, nunca coincidirá con mas de una «b», ya que no hay razón para coincidir con más.

source: It requires something else to force it to match more than the lower limit.
es: Se precisa algo más para forzar un número de coincidencias mayor que el límite más bajo.

source: The same rules apply to removing "n" and "m".
es: Las mismas reglas están presentes al eliminar «n» y «m».

source: It's even possible to remove both of the numbers, resulting in "\{-}".
es: También es posible eliminar ambos números, dejando «\{-}».
