Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: This is a useful way of working: - create folds to get overview on your file - move around to where you want to do your work - do |zi| to look at the text and edit it - do |zi| again to go back to moving around
es: Esta es una buena forma de trabajar: creación de pliegues para obtener una visión general de su archivo - desplazarse a las áreas que desea modificar - visionado y edición del texto con |zi| - repita |zi| para seguir desplazándose.

source: *28.3* Working with folds
es: *28.3* Trabajar con pliegues

source: When some folds are closed, movement commands like "j" and "k" move over a fold like it was a single, empty line.
es: De haber algunos pliegues cerrados, las órdenes de movimiento como «j» y «k» se desplazarán sobre el pliegue como si fuese una única línea vacía.

source: This allows you to quickly move around over folded text.
es: Esto permite un desplazamiento más rápido sobre texto plegado.

source: It is sometimes difficult to see or remember where a fold is located, thus where a |zo| command would actually work.
es: A veces es difícil ver o recordar la ubicación de un pliegue; la orden |zo| es de utilidad en estos caso.

source: To see the defined folds: >
es: Para ver los pliegues definidos: >

source: This will show a small column on the left of the window to indicate folds.
es: Esto muestra una pequeña columna a la izquierda de la ventana que indica los pliegues.

source: A "+" is shown for a closed fold.
es: Un «+» simboliza un pliegue cerrado.

source: A "-" is shown at the start of each open fold and "|" at following lines of the fold.
es: Un «-» aparece al principio de cada pliegue abierto y «|» simboliza líneas del pliegue a continuación.

source: You can use the mouse to open a fold by clicking on the "+" in the foldcolumn.
es: Puede usar el ratón para abrir un pliegue pulsando sobre la «+» en la columna de plegado.

source: Clicking on the "-" or a "|" below it will close an open fold.
es: Pulsar sobre «-» o el «|» que aparece debajo cierra un pliegue abierto.

source: To open all folds at the cursor line use |zO|.
es: Use |zO| para abrir todos los pliegues en la línea del cursor.

source: To close all folds at the cursor line use |zC|.
es: Use |zC| para cerrar todos los pliegues en la línea del cursor.

source: To delete a fold at the cursor line use |zd|.
es: Puede eliminar un pliegue en la línea del cursor con |zd|.

source: To delete all folds at the cursor line use |zD|.
es: Use |zD| para borrar todos los pliegues bajo la línea del cursor.

source: When in Insert mode, the fold at the cursor line is never closed.
es: La línea del cursor nunca se cierra en el modo Insertar.

source: That allows you to see what you type!
es: Esto permite ver lo que teclea.

source: Folds are opened automatically when jumping around or moving the cursor left or right.
es: Los pliegues se abren automáticamente al desplazarse o moviendo el cursor a la izquierda o a la derecha.

source: For example, the "0" command opens the fold under the cursor (if 'foldopen' contains "hor", which is the default).
es: Por ejemplo, la orden «0» abre el pliegue bajo el cursor (si 'foldopen' contiene 'hor', el valor predeterminado).

source: The 'foldopen' option can be changed to open folds for specific commands.
es: Puede modificar la opción 'foldopen' para abrir los pliegues con órdenes específicas.

source: If you want the line under the cursor always to be open, do this: >
es: Haga lo siguiente si desea que la línea bajo el cursor esté siempre abierta: >

source: Warning: You won't be able to move onto a closed fold then.
es: Aviso: en esta situación, no será capaz de desplazarse a un pliegue cerrado.

source: You might want to use this only temporarily and then set it back to the default: >
es: Puede que desea usar esto temporalmente para después devolverlo al valor original: >

source: This will re-apply 'foldlevel' to all folds that don't contain the cursor.
es: Esto ejecutará 'foldlevel' en todos los pliegues que no contengan el cursor.

source: You have to try it out if you like how this feels.
es: Tiene que probar para ver si le gusta.

source: Use |zm| to fold more and |zr| to fold less (reduce folds).
es: Use |zm| para plegar más, y |zr| para plegar menos (reducir los pliegues).

source: The folding is local to the window.
es: El pliegue es local para la ventana.

source: This allows you to open two windows on the same buffer, one with folds and one without folds.
es: Esto permite abrir dos ventanas en el mismo búfer, uno con pliegues y otro sin ellos.

source: Or one with all folds closed and one with all folds open.
es: O uno con todos los pliegues cerrados y otro con todos los pliegues abiertos.

source: *28.4* Saving and restoring folds
es: *28.4* Guardar y restaurar pliegues

source: When you abandon a file (starting to edit another one), the state of the folds is lost.
es: Al cerrar un archivo para iniciar la edición de otro, el estado del pliegue es eliminado.

source: If you come back to the same file later, all manually opened and closed folds are back to their default.
es: Si vuelve al mismo archivo más tarde, todos aquellos pliegues cerrados y abiertos manualmente volverán a su estado predeterminado.

source: When folds have been created manually, all folds are gone!
es: ¡Perderá todos los pliegues creados manualmente.

source: To save the folds use the |:mkview| command: >
es: Use la orden |:mkview| para guardar el estado de los archivos: >

source: This will store the settings and other things that influence the view on the file.
es: Esto guardará la configuración y otras que cosas que modifican el visionado del archivo.

source: You can change what is stored with the 'viewoptions' option.
es: Puede modificar lo guardado con la opción 'viewoptions'.

source: When you come back to the same file later, you can load the view again: >
es: Puede cargar el mismo visionado al volver al archivo más tarde: >

source: You can store up to ten views on one file.
es: Puede guardar hasta diez visionados distintos de un archivo.

source: For example, to save the current setup as the third view and load the second view: >
es: Por ejemplo, para guardar la configuración actual como el tercer visionado, y cargar después el segundo: >

source: Note that when you insert or delete lines the views might become invalid.
es: Tenga en cuenta que, al insertar o eliminar líneas, las vistas dejarán de ser válidas.

source: Also check out the 'viewdir' option, which specifies where the views are stored.
es: Revise también la opción 'viewdir', que define donde se guardan los visionados.

source: You might want to delete old views now and then.
es: Puede que desee eliminar viejos visionados de vez en cuando.

source: *28.5* Folding by indent
es: *28.5* Plegar según el sangrado

source: Defining folds with |zf| is a lot of work.
es: Definir pliegues con |zf| supone mucho trabajo.

source: If your text is structured by giving lower level items a larger indent, you can use the indent folding method.
es: Si el texto está estructurado de forma que los elementos de un nivel inferior tienen un mayor sangrado, puede usar el método de pliegue por sangrado.

source: This will create folds for every sequence of lines with the same indent.
es: Ésto crea pliegues para cada secuencia de líneas dentro del mismo sangrado.

source: Lines with a larger indent will become nested folds.
es: Las líneas con un sangrado mayor se convertirán en pliegues anidados.

source: This works well with many programming languages.
es: Esto funciona muy bien con varios lenguajes de programación.

source: Then you can use the |zm| and |zr| commands to fold more and reduce folding.
es: Puede después usar las órdenes |zm| y |zr| para aumentar y reducir el plegado.

source: It's easy to see on this example text:
es: Es fácil de ver con este texto de ejemplo:

source: This line is not indented This line is indented once This line is indented twice This line is indented twice This line is indented once This line is not indented This line is indented once This line is indented once
es: La línea no tiene sangrado Esta línea tiene un sangrado Esta línea tiene doble sangrado Esta línea tiene doble sangrado Esta línea tiene un sangrado La línea no tiene sangrado Esta línea tiene un sangrado Esta línea tiene un sangrado

source: Note that the relation between the amount of indent and the fold depth depends on the 'shiftwidth' option.
es: Tenga en cuenta que la relación entre la cantidad de sangrado y la profundidad del pliegue depende de la opción 'shiftwidth'.

source: Each 'shiftwidth' worth of indent adds one to the depth of the fold.
es: Cada 'shiftwidth' con el valor de un sangrado añade uno a la profundidad del pliegue.

source: This is called a fold level.
es: Este se denomina nivel de plegado.

source: When you use the |zr| and |zm| commands you actually increase or decrease the 'foldlevel' option.
es: En realidad, cuando usa las órdenes |zr| y |zm| aumento o disminuye la opción 'foldlevel'.

source: You could also set it directly: >
es: Puede también definirlo directamente: >

source: This means that all folds with three times a 'shiftwidth' indent or more will be closed.
es: Esto significa que todos los pliegues con un sangrado tres veces el valor de 'shiftwidth' se cerrarán.

source: The lower the foldlevel, the more folds will be closed.
es: Cuanto más bajo es 'foldlevel', más pliegues se cerrarán.

source: When 'foldlevel' is zero, all folds are closed.
es: Si el valor de 'foldlevel' es cero, se cerrarán todos los pliegues.

source: |zM| does set 'foldlevel' to zero.
es: |zM| define 'foldlevel' como cero.

source: The opposite command |zR| sets 'foldlevel' to the deepest fold level that is present in the file.
es: La orden opuesta |zR| define 'foldlevel' con el valor de nivel de pliegue más bajo presente en el archivo.

source: Thus there are two ways to open and close the folds: (A) By setting the fold level.
es: Por ello, hay dos maneras de abrir y cerrar los pliegues: (a) Definiendo el nivel de pliegue (foldlevel).

source: This gives a very quick way of "zooming out" to view the structure of the text, move the cursor, and "zoom in" on the text again.
es: Esto ofrece un rápida manera de alejar la vista para ver la estructura general del texto, desplazar el cursor, acercar la vista y de vuelta al texto otra vez.

source: (B) By using |zo| and |zc| commands to open or close specific folds.
es: (B) Usando las órdenes |zo| y |zc| para abrir o cerrar pliegues específicos.

source: This allows opening only those folds that you want to be open, while other folds remain closed.
es: Esto permite abrir sólo aquellos pliegues que desea abrir, manteniendo los otros cerrados.

source: This can be combined: You can first close most folds by using |zm| a few times and then open a specific fold with |zo|.
es: Esto se puede combinar: primero puede cerrar la mayoría de los pliegues usando |zm| unas cuantas veces, y después abrir un pliegue en particular con |zo|.

source: Or open all folds with |zR| and then close specific folds with |zc|.
es: O abrir todos los pliegues con |zR| y después cerrar pliegues específicos con |zc|.

source: *28.6* Folding with markers
es: *28.6* Plegar con marcadores

source: Notice that the folded line will display the text before the marker.
es: Observe que la líena plegada mostrará el texto previo al marcador.

source: This is very useful to tell what the fold contains.
es: Es útil para informar de los contenidos del pliegue.

source: It's quite annoying when the markers don't pair up correctly after moving some lines around.
es: Es bastante molesto cuando los marcadores no encajan correctamente tras desplazar algunas líneas.

source: This can be avoided by using numbered markers.
es: Esto se puede evitar usando marcadores numerados.

source: At every numbered marker a fold at the specified level begins.
es: Un pliegue se iniciará con el nivel definido por cada marcador numerado.

source: This will make any fold at a higher level stop here.
es: Esto detiene en este punto cualquier pliegue de nivel superior.

source: You can just use numbered start markers to define all folds.
es: Puede usar marcadores de inicio numerados para definir todos los pliegues.

source: Only when you want to explicitly stop a fold before another starts you need to add an end marker.
es: Tendrá que añadir un marcador de fin sólo cuando desee detener un pliegue antes de iniciar otro.

source: *28.7* Folding by syntax
es: *28.7* Plegar por sintaxis

source: *28.8* Folding by expression
es: *28.8* Plegar por expresión

source: This is similar to folding by indent, but instead of using the indent of a line a user function is called to compute the fold level of a line.
es: Es similar a plegar por sangrado pero usa una función de usuario para computar el nivel de pliegue de una línea, en lugar del sangrado.

source: You can use this for text where something in the text indicates which lines belong together.
es: Puede usar esto con texto en el que éste indica qué líneas están juntas.

source: An example is an e-mail message where the quoted text is indicated by a ">" before the line.
es: Un ejemplo es un correo electrónico en el que el texto citado se indica con un «>» al inicio de la línea.

source: To fold these quotes use this: >
es: Use esto para plegar esas citas: >

source: Explanation for the 'foldexpr' used in the example (inside out): getline(v:lnum) gets the current line substitute(...,'\\s','','g') removes all white space from the line substitute(...,'[^>].*','','') removes everything after leading '>'s strlen(...) counts the length of the string, which is the number of '>'s found
es: Explicación del 'foldexpr' usado en el ejemplo (de dentro a fuera): getline(v:lnum) obtiene la línea actual substitute(...,'\\s','','g') elimina los espacios blancos de la línea substitute(...,'[^>].*','','') elimina todo lo que '> precede strlen(...) cuenta la longitud de la cadena, el cual es el número de '>' encontrados.

source: Note that a backslash must be inserted before every space, double quote and backslash for the ":set" command.
es: Tenga en cuenta que al usar la orden «:set» debe insertar una barra inversa antes de cada espacio, comilla doble y barra inversa.

source: If this confuses you, do >
es: Si esto le confunde, haga >

source: to check the actual resulting value.
es: para revisar el valor actual resultante.

source: To correct a complicated expression, use the command-line completion: >
es: Para corregir una expresión compleja, use el auto completa de línea de órdenes: >

source: Where <Tab> is a real Tab.
es: Aquí, <Tab> es una tabulación real.

source: Vim will fill in the previous value, which you can then edit.
es: Vim rellenará el valor previo, el cual puede después editar.

source: *28.9* Folding unchanged lines
es: *28.9* Plegar líneas sin cambios

source: This is useful when you set the 'diff' option in the same window.
es: Es útil cuando define la opción 'diff' en la misma ventana.

source: The |vimdiff| command does this for you.
es: La orden |vimdiff| hace esto por usted.

source: Do this in every window that shows a different version of the same file.
es: Haga esto en cada ventana que muestre una versión distinta del mismo archivo.

source: You will clearly see the differences between the files, while the text that didn't change is folded.
es: Verá claramente las diferencias entre archivos, plegando a su vez aquellas líneas que no contienen cambios.

source: *28.10* Which fold method to use?
es: *28.10* ¿Qué método de plegado debería usar?

source: All these possibilities make you wonder which method you should choose.
es: Todas estas posibilidades le hacen preguntarse qué método escoger.

source: Unfortunately, there is no golden rule.
es: Por desgracia, no existe ninguna regla de oro.

source: Here are some hints.
es: Aquí tiene algunas pistas.

source: If there is a syntax file with folding for the language you are editing, that is probably the best choice.
es: De existir un archivo de sintaxis con plegado para el lenguaje en el que está editando, puede que sea la mejor opción.

source: If there isn't one, you might try to write it.
es: De no ser así, puede intentar crear uno.

source: This requires a good knowledge of search patterns.
es: Esto requiere un buen conocimiento de patrones de búsqueda.

source: It's not easy, but when it's working you will not have to define folds manually.
es: No resulta sencillo, pero una vez que funciona no tendrá definir los pliegues manualmente.

source: Typing commands to manually fold regions can be used for unstructured text.
es: Puede escribir órdenes para plegar manualmente ciertas regiones al tratar con un texto sin estructura.

source: Then use the |:mkview| command to save and restore your folds.
es: Use después la orden |:mkview| para guardar y restaurar los pliegues.

source: The marker method requires you to change the file.
es: El método de marcado requiere que modifique el archivo.

source: If you are sharing the files with other people or you have to meet company standards, you might not be allowed to add them.
es: Si comparte archivos con más personas, o tiene que cumplir con las directrices de una compañía, cabe que no se le permita añadirlos.

source: The main advantage of markers is that you can put them exactly where you want them.
es: La principal ventaja de los marcadores es que puede insertarlas exactamente donde desee.

source: That avoids that a few lines are missed when you cut and paste folds.
es: Esto evita que se pierdan algunas líneas al copiar y pegar pliegues.

source: And you can add a comment about what is contained in the fold.
es: Puede después añadir un comentario acerca de los contenidos del pliegue.

source: Folding by indent is something that works in many files, but not always very well.
es: Plegar por sangrado funciona en muchos ficheros, aunque con resultados variables.

source: Use it when you can't use one of the other methods.
es: Úselo cuando no puede usar ninguno de los otros métodos.

source: However, it is very useful for outlining.
es: Aún así, es de utilidad con los diseños preliminares.

source: Then you specifically use one 'shiftwidth' for each nesting level.
es: Puede entonces usar un 'shiftwidth' en particular para cada nivel de anidado.

source: Folding with expressions can make folds in almost any structured text.
es: Plegar con expresiones puede crear pliegues en prácticamente cualquier texto estructurado.

source: It is quite simple to specify, especially if the start and end of a fold can easily be recognized.
es: Es sencillo de definir, particularmente se se pueden discernir con facilidad el principio y final de un pliegue.

source: If you use the "expr" method to define folds, but they are not exactly how you want them, you could switch to the "manual" method.
es: Si al definir los pliegues usa el método «expr», pero no con los resultados deseados, puede pasar al método «manual».

source: This will not remove the defined folds.
es: Esto no elimina los pliegues ya definidos.

source: Then you can delete or add folds manually.
es: Puede entonces añadir o eliminar pliegues de manualmente.

source: *help.txt* For Vim version 7.3.
es: *help.esx* *ayuda* Para Vim versión 7.3.

source: VIM - main help file k Move around: Use the cursor keys, or "h" to go left, h l "j" to go down, "k" to go up, "l" to go right.
es: VIM - archivo principal de ayuda k Desplazamiento: Use las teclas de dirección, h l o «h» para ir a la izquierda, j «j» para ir hacia abajo, «k» hacia arriba y «l» a la derecha.

source: j Close this window: Use ":q<Enter>".
es: Cerrar esta ventana: Use «:q<Intro>».

source: Get out of Vim: Use ":qa!<Enter>" (careful, all changes are lost!).
es: Salir de Vim: Use «:qa!<Intro>» (¡Atención, perderá todos los cambios realizados!).

source: Get specific help: It is possible to go directly to whatever you want help on, by giving an argument to the |:help| command.
es: Obtener ayuda específica: Es posible acudir directamente donde necesite ayuda, introduciéndolo como un argumento de la orden |:help|.

source: It is possible to further specify the context: *help-context* WHAT PREPEND EXAMPLE ~ Normal mode command (nothing) :help x Visual mode command v_ :help v_u Insert mode command i_ :help i_<Esc> Command-line command : :help :quit Command-line editing c_ :help c_<Del> Vim command argument - :help -r Option ' :help 'textwidth' Search for help: Type ":help word", then hit CTRL-D to see matching help entries for "word".
es: Es posible especificar detalladamente el contexto: *help-context* QUÉ ANEXAR EJEMPLO ~ Orden modo Normal (nada) :help x Orden modo Visual v_ :help v_u Orden modo insertar i_ :help i_<Esc> Orden de línea de órdenes : :help :quit Edición de línea de órdenes c_ :help c_<Supr> Argumento de la orden VIM - :help -r Opción ' :help 'textwidth' Buscar ayuda: Teclee «:help palabra» y pulse CTRL-D para ver las entradas de ayuda coincidentes con «palabra».

source: Or use ":helpgrep word".
es: O use «:helpgrep palabra».

source: VIM stands for Vi IMproved.
es: VIM significa «Vi IMproved» (Vi mejorado).

source: Most of VIM was made by Bram Moolenaar, but only through the help of many others.
es: Bram Moolenaar es el principal creador de Vim, pero sólo con la ayuda de muchos otros.

source: See |credits|.
es: Véase |credits|.

source: |usr_toc.txt| Table Of Contents
es: |usr_toc.esx| Tabla de contenidos

source: REFERENCE MANUAL: These files explain every detail of Vim.
es: MANUAL DE REFERENCIA: Estos archivos explican cada detalle de Vim.

source: General subjects ~ |intro.txt| general introduction to Vim; notation used in help files |help.txt| overview and quick reference (this file) |helphelp.txt| about using the help files |index.txt| alphabetical index of all commands |help-tags| all the tags you can jump to (index of tags) |howto.txt| how to do the most common editing tasks |tips.txt| various tips on using Vim |message.txt| (error) messages and explanations |quotes.txt| remarks from users of Vim |todo.txt| known problems and desired extensions |develop.txt| development of Vim |debug.txt| debugging Vim itself |uganda.txt| Vim distribution conditions and what to do with your money
es: Temas generales ~ |intro.esx| Introducción general a Vim; notación usada en los archivos de ayuda |help.esx| Información general y referencia rápida (este archivo) |helphelp.txt| Acerca del uso de los archivos de ayuda |index.txt| Índice alfabético de todas las órdenes |help-tags| Todas las etiquetas a las que puede saltar (índice de etiquetas) |howto.txt| Como realizar las tareas de edición más comunes |tips.txt| Varios consejos de uso de Vim |message.txt| Los mensajes de error y su explicación |quotes.txt| Comentarios de usuarios de Vim |todo.txt| Problemas conocidos y extensiones deseadas |develop.txt| Desarrollo de Vim |debug.txt| Depurando fallos de Vim |uganda.txt| Las condiciones de distribución de Vim y qué hacer con su dinero.
