Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The backslash at the start of a line is used to continue the command from the previous line.
es: La barra inversa al comienzo de la línea se emplea para continuarla desde la anterior.

source: That avoids a line getting very long.
es: Esto ayuda a acortar las líneas.

source: See |line-continuation|.
es: Véase |line-continuation|.

source: This only works in a Vim script file, not when typing commands at the command-line.
es: Esto funciona sólo dentro de un script de Vim, no cuando se teclean órdenes en la línea de órdenes.

source: *05.3* Simple mappings
es: *05.3* Macros sencillas

source: A mapping enables you to bind a set of Vim commands to a single key.
es: Una macro le permite ligar un conjunto de órdenes de Vim a una sola tecla.

source: Suppose, for example, that you need to surround certain words with curly braces.
es: Suponga, por ejemplo, que necesita poner una palabra entre llaves.

source: In other words, you need to change a word such as "amount" into "{amount}".
es: En otras palabras necesita cambiar una palabra como «cantidad» a «{cantidad}».

source: With the :map command, you can tell Vim that the F5 key does this job.
es: Con la orden :map, puede decirle a Vim que la tecla F5 haga precisamente eso.

source: The command is as follows: >
es: La orden es la siguiente: >

source: :map <F5> i{<Esc>ea}<Esc> < Note: When entering this command, you must enter <F5> by typing four characters.
es: :map <F5> i{<Esc>ea}<Esc> < Nota: Cuando introduzca esta orden, debe introducir <F5> tecleando cuatro caracteres.

source: Similarly, <Esc> is not entered by pressing the <Esc> key, but by typing five characters.
es: De igual manera, <Esc> no se introduce pulsando la tecla <Esc>, sino tecleando cinco caracteres.

source: Watch out for this difference when reading the manual!
es: De hecho, ¡¡has de poner los nombres en inglés, no la versión traducida!!

source: Let's break this down: <F5> The F5 function key.
es: Veámoslo por partes: <F5> La tecla de función F5.

source: This is the trigger key that causes the command to be executed as the key is pressed.
es: Esta es la tecla que lanzará la orden para que éste se ejecute al ser pulsada.

source: i{<Esc> Insert the { character.
es: i{<Esc> Insertar el carácter {.

source: The <Esc> key ends Insert mode.
es: <Esc> sale del modo Insertar.

source: e Move to the end of the word.
es: e Moverse al final de la palabra.

source: a}<Esc> Append the } to the word.
es: a}<Esc> Añadir el } a la palabra.

source: The ":map" command (with no arguments) lists your current mappings.
es: La orden «:map» (sin argumentos) le da un listado de sus macros actuales.

source: At least the ones for Normal mode.
es: Al menos aquellos en el modo Normal.

source: More about mappings in section |40.1|.
es: Más sobre macros en la sección |40.1|.

source: *05.4* Adding a plugin *add-plugin* *plugin*
es: *05.4* Añadir una extensión *add-plugin* *plugin*

source: Vim's functionality can be extended by adding plugins.
es: La funcionalidad de Vim puede ser extendida añadiendo extensiones.

source: A plugin is nothing more than a Vim script file that is loaded automatically when Vim starts.
es: Una extensiones no es nada más que un script de Vim que se carga automáticamente cuando Vim arranca.

source: You can add a plugin very easily by dropping it in your plugin directory.
es: Puede añadir nuevas extensiones añadiéndolos al directorio de extensiones.

source: {not available when Vim was compiled without the |+eval| feature}
es: {no disponible si no se ha compilad con Vim con la opción |+eval|}.

source: global plugin: Used for all kinds of files filetype plugin: Only used for a specific type of file
es: Extensión global: Empleado para todos los tipos de archivo Extensión de tipo de archivo: Empleado para un tipo de archivo específico

source: GLOBAL PLUGINS *standard-plugin*
es: EXTENSIONES GLOBALES *standard-plugin*

source: When you start Vim, it will automatically load a number of global plugins.
es: Cuando arranque Vim, verá que carga automáticamente un grupo de extensiones globales.

source: You don't have to do anything for this.
es: No tiene que hacer nada al respecto.

source: They add functionality that most people will want to use, but which was implemented as a Vim script instead of being compiled into Vim.
es: Éstos añaden funcionalidad que le interesan a la mayoría de gente, pero que se implementaron como scripts de Vim en lugar de compilarlos en Vim.

source: You can find them listed in the help index |standard-plugin-list|.
es: Puedes verlos listados en el índice de ayuda |standard-plugin-list|.

source: Also see |load-plugins|.
es: Véase también |load-plugins|.

source: *add-global-plugin* You can add a global plugin to add functionality that will always be present when you use Vim.
es: *add-global-plugin* Puede poner un extensión global para añadir funcionalidad que deba estar siempre presente cuando use Vim.

source: There are only two steps for adding a global plugin: 1.
es: Sólo tiene que seguir dos pasos para añadir una extensión global: 1.

source: Get a copy of the plugin. 2.
es: Conseguir una copia de la extensión. 2.

source: Where can you find plugins?
es: ¿Dónde encontrar extensiones?

source: - Some come with Vim.
es: - Algunos vienen con Vim.

source: You can find them in the directory $VIMRUNTIME/macros and its sub-directories.
es: Puede encontrarlos en el directorio $VIMRUNTIME/macro y sus subdirectorios.

source: - Download from the net.
es: - Descargarlos de la red.

source: There is a large collection on http://www.vim.org.
es: Hay una buena colección en http://www.vim.org.

source: - They are sometimes posted in a Vim |maillist|.
es: - Algunas veces se envían a la |maillist| de Vim.

source: - You could write one yourself, see |write-plugin|.
es: - Puede escribir uno usted mismo, consulte |write-plugin|.

source: Some plugins come as a vimball archive, see |vimball|.
es: Algunas extensiones vienen como un archivo comprimido, consulte |vimball|.

source: Some plugins can be updated automatically, see |getscript|.
es: Algunas extensiones pueden ser actualizados automáticamente, consulte |getscript|.

source: First read the text in the plugin itself to check for any special conditions.
es: Lea primero el texto en la extensión descargada para comprobar cualquier requerimiento.

source: Then copy the file to your plugin directory:
es: A continuación copielo al directorio de extensiones:

source: system plugin directory ~ Unix ~/.vim/plugin/ PC and OS/2 $HOME/vimfiles/plugin or $VIM/vimfiles/plugin Amiga s:vimfiles/plugin Macintosh $VIM:vimfiles:plugin Mac OS X ~/.vim/plugin/ RISC-OS Choices:vimfiles.plugin
es: sistema directorio de extensiones ~ Unix ~/.vim/plugin/ PC and OS/2 $HOME/vimfiles/plugin or $VIM/vimfiles/plugin Amiga s:vimfiles/plugin Macintosh $VIM:vimfiles:plugin Mac OS X ~/.vim/plugin/ RISC-OS Choices:vimfiles.plugin

source: Now you can use the commands defined in this plugin to justify text.
es: Ahora puede usar las órdenes definidas en esta extensión para justificar texto.

source: Instead of putting plugins directly into the plugin/ directory, you may better organize them by putting them into subdirectories under plugin/.
es: En lugar de poner las extensiones directamente en el directorio «plugins/», quizá prefiera organizarlos poniéndolos en subdirectorios dentro de «plugins/».

source: As an example, consider using "~/.vim/plugin/perl/*.vim" for all your Perl plugins.
es: Por ejemplo, ponga todas sus extensiones de Perl bajo el subdirectorio «~/.vim/plugin/perl/*.vim».

source: FILETYPE PLUGINS *add-filetype-plugin* *ftplugins*
es: EXTENSIONES DE TIPO DE ARCHIVO *add-filetype-plugin* *ftplugins*

source: See |vimrc-filetype|.
es: Véase |vimrc-filetype|.

source: If you are missing a plugin for a filetype you are using, or you found a better one, you can add it.
es: Si echa de menos una extensión para un tipo de archivo que esté usando, o encontró uno mejor, puede añadirlo.

source: There are two steps for adding a filetype plugin: 1.
es: Hay dos pasos para conseguirlo: 1.

source: Get a copy of the plugin.
es: Conseguir una copia de la extensión.

source: You can find them in the same places as the global plugins.
es: Puede encontrarlos en los mismos sitios que las extensiones globales.

source: Watch out if the type of file is mentioned, then you know if the plugin is a global or a filetype one.
es: Compruebe si el tipo de archivo se menciona o no, de ese modo puede saber si la extensión es global o de tipo de archivo.

source: The scripts in $VIMRUNTIME/macros are global ones, the filetype plugins are in $VIMRUNTIME/ftplugin.
es: Los scripts en «$VIMRUNTIME/macros» son globales, los específicos están en «$VIMRUNTIME/ftplugin».

source: USING A FILETYPE PLUGIN *ftplugin-name*
es: USAR UNA EXTENSIÓN DE TIPO DE ARCHIVO *ftplugin-name*

source: You can add a filetype plugin by dropping it in the right directory.
es: Puede añadir una extensión de tipo de archivo ubicándolo en el directorio adecuado.

source: The name of this directory is in the same directory mentioned above for global plugins, but the last part is "ftplugin".
es: El nombre de este directorio está en el mismo directorio mencionado previamente para extensiones globales, pero la última parte es «ftplugin».

source: Suppose you have found a plugin for the "stuff" filetype, and you are on Unix.
es: Suponga que ha encontrado una extensión para el tipo de archivo «cosas» y que está bajo Unix.

source: Then you can move this file to the ftplugin directory: >
es: Puede mover este archivo al directorio «ftplugin/»: >

source: mv thefile ~/.vim/ftplugin/stuff.vim
es: mv thefile ~/.vim/ftplugin/cosas.vim

source: If that file already exists you already have a plugin for "stuff".
es: Si ese archivo ya existe, es que ya tiene una extensión para «cosas».

source: You might want to check if the existing plugin doesn't conflict with the one you are adding.
es: Tal vez desee comprobar si la extensión existente no es conflictivo con el que añade.

source: If it's OK, you can give the new one another name: >
es: Si no hay conflicto, puede darle otro nombre:

source: mv thefile ~/.vim/ftplugin/stuff_too.vim
es: mv thefile ~/.vim/ftplugin/cosas_dos.vim

source: The underscore is used to separate the name of the filetype from the rest, which can be anything.
es: El guión bajo se usa para separar el nombre del tipo de archivo del resto, que puede ser cualquier cosa.

source: If you use "otherstuff.vim" it wouldn't work, it would be loaded for the "otherstuff" filetype.
es: Si usa «otrascosas.vim» no funcionaría, ya que se cargaría como tipo de archivo «otrascosas».

source: On MS-DOS you cannot use long filenames.
es: En MS-DOS no puede usar nombres de archivo largos.

source: You would run into trouble if you add a second plugin and the filetype has more than six characters.
es: Tendrá problemas si añades una segunda extensión el tipo de archivo tiene más de seis caracteres.

source: You can use an extra directory to get around this: >
es: Puede añadir un directorio extra para evitar este problema: >

source: mkdir $VIM/vimfiles/ftplugin/fortran copy thefile $VIM/vimfiles/ftplugin/fortran/too.vim
es: mkdir $VIM/vimfiles/ftplugin/fortran copy thefile $VIM/vimfiles/ftplugin/fortran/dos.vim

source: ftplugin/<filetype>.vim ftplugin/<filetype>_<name>.vim ftplugin/<filetype>/<name>.vim
es: ftplugin/<tipo_de_archivo>.vim ftplugin/<tipo_de_archivo>_<nombre>.vim ftplugin/<tipo_de_archivo>/<nombre>.vim

source: Here "<name>" can be any name that you prefer.
es: Aquí, «<nombre>» puede ser cualquier nombre que quieras.

source: Examples for the "stuff" filetype on Unix: >
es: Ejemplos para el tipo de archivo «cosas» en Unix: >

source: ~/.vim/ftplugin/stuff.vim ~/.vim/ftplugin/stuff_def.vim ~/.vim/ftplugin/stuff/header.vim
es: ~/.vim/ftplugin/cosas.vim ~/.vim/ftplugin/cosas_def.vim ~/.vim/ftplugin/cosas/header.vim

source: The <filetype> part is the name of the filetype the plugin is to be used for.
es: La parte <tipo_de_archivo> es el nombre del tipo de archivo para el cuál se usa la extensión.

source: Only files of this filetype will use the settings from the plugin.
es: Sólo los archivos de este tipo cargarán esta extensión.

source: The <name> part of the plugin file doesn't matter, you can use it to have several plugins for the same filetype.
es: La parte <nombre> de la extensión no importa, puede usarlo para tener varias extensiones del mismo tipo de archivo.

source: Note that it must end in ".vim".
es: Tenga en cuenta que debe terminar con la extensión «.vim».

source: Further reading: |filetype-plugins| Documentation for the filetype plugins and information about how to avoid that mappings cause problems.
es: Lecturas de ampliación: |filetype-plugins| Documentación para las extensiones de tipo de archivo e información sobre como evitar problemas con macros.

source: |load-plugins| When the global plugins are loaded during startup.
es: |load-plugins| Cuándo las extensiones globales se cargan.

source: |ftplugin-overrule| Overruling the settings from a global plugin.
es: |ftplugin-overrule| Sobreescribir las opciones de una extensión global.

source: |write-plugin| How to write a plugin script.
es: |write-plugin| Cómo escribir un script de extensión.

source: |plugin-details| For more information about using plugins or when your plugin doesn't work.
es: |plugin-details| Para más información sobre cómo usar extensiones o cuando la extensión no funciona.

source: |new-filetype| How to detect a new file type.
es: |new-filetype| Cómo detectar un nuevo tipo de archivo.

source: *05.5* Adding a help file *add-local-help* *matchit-install*
es: *05.5* Añadir un archivo de ayuda *add-local-help* *matchit-install*

source: If you are lucky, the plugin you installed also comes with a help file.
es: Si tiene suerte, la extensión que instaló viene con un archivo de ayuda.

source: We will explain how to install the help file, so that you can easily find help for your new plugin.
es: Le explicaremos cómo instalar el archivo de ayuda, para que pueda encontrar ayuda fácilmente para su nueva extensión.

source: Let us use the "matchit.vim" plugin as an example (it is included with Vim).
es: Usemos el plugin «matchit.vim» como ejemplo (viene incluido con Vim).

source: This plugin makes the "%" command jump to matching HTML tags, if/else/endif in Vim scripts, etc.
es: Esta extensión hace que la orden «%» salte a tags emparejados de HTML, «if/else/endif» en scripts de Vim, etc.

source: Very useful, although it's not backwards compatible (that's why it is not enabled by default).
es: Muy útil, pero no es compatible con versiones anteriores (por lo que no está activado por defecto).

source: This plugin comes with documentation: "matchit.txt".
es: Esta extensión viene con la documentación «matchit.txt».

source: Let's first copy the plugin to the right directory.
es: Primero copiemos la extensión al directorio adecuado.

source: This time we will do it from inside Vim, so that we can use $VIMRUNTIME.
es: Esta vez lo haremos desde dentro de Vim, así podremos usar $VIMRUNTIME.

source: (You may skip some of the "mkdir" commands if you already have the directory.) >
es: (Puede omitir la orden «mkdir» si ya tiene el directorio.) >

source: Now create a "doc" directory in one of the directories in 'runtimepath'.
es: Ahora cree un directorio «doc» en una de los directorios de 'runtimepath'.

source: Copy the help file to the "doc" directory.
es: Copie el archivo de ayuda al directorio «doc».

source: Now comes the trick, which allows you to jump to the subjects in the new help file: Generate the local tags file with the |:helptags| command.
es: Por último el truco que le permite ir a los temas en el nuevo archivo de ayuda: Genere el archivo de tags locales con la orden |:helptags|.

source: command to find help for "g%" in the help file you just added.
es: para buscar ayuda para «g%» en el archivo de ayuda que acaba de añadir.

source: You can see an entry for the local help file when you do: >
es: Puede ver una entrada correspondiente al archivo local cuando escriba: >

source: The title lines from the local help files are automagically added to this section.
es: Las líneas con los títulos de los archivos de ayuda locales son añadidos automágicamente a la sección.

source: There you can see which local help files have been added and jump to them through the tag.
es: Allí puede ver que archivos locales se han añadido e ir a ellos a través del tag creado.

source: *05.6* The option window
es: *05.6* La ventana de opciones

source: If you are looking for an option that does what you want, you can search in the help files here: |options|.
es: Si busca una opción que haga lo que quiere, puede buscarla en los archivos de ayuda aquí: |options|.

source: Another way is by using this command: >
es: Otra forma es usar la orden: >

source: You can change the value of an option.
es: Puede cambiar el valor de una opción.

source: For example, move to the "displaying text" subject.
es: Por ejemplo, vaya al tema «displaying text».

source: Then move the cursor down to this line:
es: Luego ponga el cursor abajo, en esta línea:

source: Just above this line is a short description of the 'wrap' option.
es: Justo sobre esta línea hay una descripción corta de la opción 'wrap'.

source: Move the cursor one line up to place it in this line.
es: Ponga el cursor una línea arriba para colocarlos sobre esta línea.

source: Now hit <Enter> and you jump to the full help on the 'wrap' option.
es: Ahora pulse <Intro> e irá hacia la descripción completa de la opción 'wrap'.

source: For options that take a number or string argument you can edit the value.
es: Para opciones que toman un número o una cadena de caracteres puede editar el valor.

source: For example, move the cursor a few lines up to this line:
es: Por ejemplo, mueva el cursor unas cuantas líneas arriba hasta esta línea:

source: Position the cursor on the zero with "$".
es: Posicione el cursor sobre el cero con «$».

source: Change it into a five with "r5".
es: Modifiqueló a un cinco con «r5».

source: When you now move the cursor around you will notice that the text starts scrolling before you reach the border.
es: Cuando mueva el cursor por un texto, notará que el texto se desplazará (scroll) antes de que llegue al borde.

source: This is what the 'scrolloff' option does, it specifies an offset from the window border where scrolling starts.
es: Esto es lo que la opción 'scrolloff' hace, especifica una compensación (offset) del punto donde comienza el desplazamiento (respecto al borde).

source: *05.7* Often used options
es: *05.7* Opciones más comunes

source: There are an awful lot of options.
es: Hay una cantidad de opciones inmensa.

source: Most of them you will hardly ever use.
es: Difícilmente llegará a usar gran parte de ellas.

source: Some of the more useful ones will be mentioned here.
es: Algunas de las más comunes se citarán a continuación.

source: Don't forget you can find more help on these options with the ":help" command, with single quotes before and after the option name.
es: No se olvide de que puede encontrar más ayuda con la orden «:help», con comillas simples alrededor del nombre de la opción.

source: In case you have messed up an option value, you can set it back to the default by putting an ampersand (&) after the option name.
es: En caso de que haya descolocado el valor de una opción, puede devolverlo a la opción por defecto con un et (&) tras el nombre de la opción.

source: Vim normally wraps long lines, so that you can see all of the text.
es: Vim normalmente dobla líneas largas, de forma que pueda ver todo el texto.

source: Sometimes it's better to let the text continue right of the window.
es: A veces es mejor dejar que el texto continúe a la derecha de la ventana.

source: Then you need to scroll the text left-right to see all of a long line.
es: De este modo tiene que desplazarse de izquierda a derecha para ver toda una línea larga.

source: Switch wrapping off with this command: >
es: Puede intercambiar el valor con la siguiente orden: >

source: Vim will automatically scroll the text when you move to text that is not displayed.
es: Vim automáticamente desplazará el texto cuando se desplace hacia el texto que no se muestra en pantalla.

source: To see a context of ten characters, do this: >
es: Para ver un contexto de diez caracteres: >

source: Most commands for moving around will stop moving at the start and end of a line.
es: La mayoría de las órdenes para desplazarse dejarán de funcionar al comienzo o al final de una línea.

source: You can change that with the 'whichwrap' option.
es: Puede cambiar esto con la opción 'whichwrap'.

source: This sets it to the default value: >
es: Esto la cambia al valor predeterminado: >

source: This allows the <BS> key, when used in the first position of a line, to move the cursor to the end of the previous line.
es: Esto permite que la tecla <Retroceso>, cuando se emplea en la primera posición de una línea se mueva al final de la línea anterior.

source: And the <Space> key moves from the end of a line to the start of the next one.
es: También la tecla <Espacio> le desplazará desde el final de una línea hasta el comienzo de la siguiente.

source: This is still only for Normal mode.
es: Esto es exclusivamente en el modo Normal.

source: To let <Left> and <Right> do this in Insert mode as well: >
es: Para permitir que <Izq> y <Der> haga esto en también modo Insertar, escriba: >

source: When there are tabs in a file, you cannot see where they are.
es: Cuando hay pestañas en un archivo, no puede ver dónde están.

source: To make them visible: >
es: Para hacerlas visibles: >

source: Now every tab is displayed as ^I.
es: Ahora todas las pestañas se mostrarán como ^I.

source: And a $ is displayed at the end of each line, so that you can spot trailing spaces that would otherwise go unnoticed.
es: Un «$» se mostrará al final de cada línea, permitiéndole ver espacios finales que de otra forma pasarían desapercibidos.

source: A disadvantage is that this looks ugly when there are many Tabs in a file.
es: Una desventaja de esto es que tiene una apariencia desagradable cuando hay muchas pestañas.

source: If you have a color terminal, or are using the GUI, Vim can show the spaces and tabs as highlighted characters.
es: Si tiene una terminal con colores o usa GVim, puede ver los espacios y las pestañas como marcas de color.

source: Use the 'listchars' option: >
es: Use la opción 'listchars': >

source: Now every tab will be displayed as ">---" (with more or less "-") and trailing white space as "-".
es: Ahora cada pestaña se mostrará como «>---» (con más o menos «-») y los espacios al final de la línea como «-».

source: Looks a lot better, doesn't it?
es: Más agradable, o no?

source: The "@" stands for all alphabetic letters.
es: El «@» implica todas las letras del alfabeto.

source: "48-57" stands for ASCII characters 48 to 57, which are the numbers 0 to 9.
es: «48-57» significa los caracteres ASCII 48 a 57, que son los números 0 a 9.

source: "192-255" are the printable latin characters.
es: «192-255» son los caracteres latinos imprimibles.

source: Sometimes you will want to include a dash in keywords, so that commands like "w" consider "upper-case" to be one word.
es: A veces querrá incluir un guión en las palabras clave, para que órdenes como «w» consideren «upper-case» como una sola palabra.

source: You can do it like this: >
es: Puede hacerlo así: >

source: If you look at the new value, you will see that Vim has added a comma for you.
es: Si miras el nuevo valor, comprobará que Vim ha añadido una coma por Ud.

source: To remove a character use "-=".
es: Para eliminar un carácter usa «-=».
