Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: First, load the man filetype plugin: >
es: Primero cargue la extensión del tipo de archivo man: >

source: Put this command in your vimrc file if you intend to do this often.
es: Ponga esta orden en su archivo «vimrc» si tiene la intención de hacer esto a menudo.

source: Now you can use the ":Man" command to open a window on a man page: >
es: Ahora puede usar «:Man» para ver una página man en una ventana: >

source: You can scroll around and the text is highlighted.
es: Puede desplazarse alrededor y el texto se resaltará.

source: This allows you to find the help you were looking for.
es: Esto le permite encontrar la ayuda que estaba buscando.

source: Use CTRL-W w to jump to the window with the text you were working on.
es: Use «CTRL-W w» para saltar a la ventana con el texto en el que trabajaba.

source: To find a man page in a specific section, put the section number first.
es: Para encontrar la página de manual en una sección específica, ponga el número de sección primero.

source: For example, to look in section 3 for "echo": >
es: Por ejemplo, para ver «echo» en la sección 3: >

source: To jump to another man page, which is in the text with the typical form "word(1)", press CTRL-] on it.
es: Para saltar a otra página de manual, la cuál está en el texto con la forma típica «word(1)», pulse «CTRL-]» sobre ella.

source: Further ":Man" commands will use the same window.
es: Otras llamadas a «:Man» emplearán la misma ventana.

source: (If you redefined the <Leader>, use it instead of the backslash).
es: (Si ha redefinido <Leader>, úselo en lugar de la barra inversa).

source: For example, you want to know the return value of "strstr()" while editing this line:
es: Por ejemplo, puede que quiera saber el valor que le devuelve «strstr()» mientras edita esta línea:

source: Move the cursor to somewhere on "strstr" and type "\K".
es: Ponga el cursor en alguna parte de «strstr» y escriba «\K».

source: A window will open to display the man page for strstr().
es: Una ventana se abrirá a continuación para mostrar la página de manual de «strstr()».

source: *12.7* Trim blanks
es: *12.7* Eliminar espacios en blanco sobrantes

source: Some people find spaces and tabs at the end of a line useless, wasteful, and ugly.
es: Algunas personas encuentran los espacios y los tabuladores al final de línea inútiles y feos.

source: To remove whitespace at the end of every line, execute the following command: >
es: Para eliminar el espacio en blanco al final de cada línea, ejecute la siguiente orden: >

source: The line range "%" is used, thus this works on the whole file.
es: El rango de línea «%» es empleado, funcionando sobre todo en el archivo completo.

source: The pattern that the ":substitute" command matches with is "\s\+$".
es: El patrón que la orden «:substitute» concuerda es el «\s\+$».

source: This finds white space characters (\s), 1 or more of them (\+), before the end-of-line ($).
es: Esto encuentra los caracteres en blanco (\s), 1 o más (\+), antes del final de línea ($).

source: Later will be explained how you write patterns like this |usr_27.txt|.
es: Más tarde explicaremos cómo se escriben patrones como este |usr_27.txt|.

source: The "to" part of the substitute command is empty: "//".
es: La parte «hacia» de la orden de sustituxión está vacía: «//».

source: Thus it replaces with nothing, effectively deleting the matched white space.
es: Por lo tanto reemplaza con nada, lo que de hecho elimina el espacio en blanco.

source: Another wasteful use of spaces is placing them before a tab.
es: Otro uso desafortunado de los espacios es colocarlos antes de un tabulador.

source: Often these can be deleted without changing the amount of white space.
es: A menudo, se pueden eliminar sin cambiar la cantidad de espacio en blanco.

source: But not always!
es: ¡Pero no siempre!

source: Therefore, you can best do this manually.
es: Por lo tanto, lo mejor es que lo haga a mano.

source: Use this search command: >
es: Use esta orden de búsqueda: >

source: You cannot see it, but there is a space before a tab in this command.
es: No puede verlo, pero hay un espacio antes de un tabulador en esta orden.

source: Thus it's "/<Space><Tab>".
es: De hecho, es «/<Espacio><Tabulador>».

source: Now use "x" to delete the space and check that the amount of white space doesn't change.
es: Use ahora «x» para eliminar el espacio y comprobar que la cantidad de espacio en blanco no cambia.

source: You might have to insert a tab if it does change.
es: Puede que tenga que insertar un tabulador si cambia.

source: Type "n" to find the next match.
es: Teclee «n» para encontrar la próxima coincidencia.

source: Repeat this until no more matches can be found.
es: Repita esto hasta que no se encuentren más concordancias.

source: *12.8* Find where a word is used
es: *12.8* Buscar donde se emplea una palabra

source: If you are a UNIX user, you can use a combination of Vim and the grep command to edit all the files that contain a given word.
es: Si eres un usuario de sistemas UNIX, puede usar una combinación de Vim y «grep» para editar todos los archivos que contengan la palabra dada.

source: This is extremely useful if you are working on a program and want to view or edit all the files that contain a specific variable.
es: Esto es extremadamente útil si está trabajando en un programa y quiere ver o editar todos los archivos que contienen una variable específica.

source: For example, suppose you want to edit all the C program files that contain the word "frame_counter".
es: Por ejemplo, suponga que desea editar todos los archivos C que contengan la palabra «frame_counter».

source: To do this you use the command: >
es: Para hacer esto, use la orden: >

source: The above command only finds the files in which the word is found.
es: La orden anterior sólo dice los archivos en los cuáles se encuentra la palabra.

source: You still have to find the word within the files.
es: Todavía tendrás que encontrar la palabra entre los archivos.

source: Vim has a built-in command that you can use to search a set of files for a given string.
es: Vim tiene una orden integrada que puede usar para buscar una cadena en un conjunto de archivos.

source: If you want to find all occurrences of "error_string" in all C program files, for example, enter the following command: >
es: Si desea encontrar todas las coincidencias de «error_string» en todos los archivos C, por ejemplo, introduzca lo siguiente: >

source: This causes Vim to search for the string "error_string" in all the specified files (*.c).
es: Esto hace que Vim busque la cadena «error_string» en cada uno de los archivos especificados (*.c).

source: The editor will now open the first file where a match is found and position the cursor on the first matching line.
es: El editor abrirá el primer archivo donde se produzca una concordancia y posicionará el cursor en la primera línea coincidente.

source: To go to the next matching line (no matter in what file it is), use the ":cnext" command.
es: Para ir a la siguiente línea (no importa en que archivo se encuentre), use la orden «:cnext».

source: To go to the previous match, use the ":cprev" command.
es: Para ir a la anterior, use «:cprev».

source: Use ":clist" to see all the matches and where they are.
es: Use «:clist» para ver todas las coincidencias y dónde están.

source: The ":grep" command uses the external commands grep (on Unix) or findstr (on Windows).
es: La orden «:grep"» usa la orden externa «grep» en Unix y «findstr» en Windows.

source: You can change this by setting the option 'grepprg'.
es: Puedes cambiar esto modificando la opción 'grepprg'.

source: *usr_04.txt* For Vim version 7.3.
es: *usr_04.esx* Para Vim versión 7.3.

source: Last change: 2008 Sep 06
es: Último cambio: 7/6/2008

source: Making small changes
es: Hacer cambios pequeños

source: This chapter shows you several ways of making corrections and moving text around.
es: Este capítulo le muestra diferentes formas de hacer correcciones y moverse en el texto.

source: It teaches you the three basic ways to change text: operator-motion, Visual mode and text objects.
es: Le muestra los tres modos básicos de cambiar texto: operador-movimiento, modo Visual y objetos de texto.

source: |04.1| Operators and motions |04.2| Changing text |04.3| Repeating a change |04.4| Visual mode |04.5| Moving text |04.6| Copying text |04.7| Using the clipboard |04.8| Text objects |04.9| Replace mode |04.10| Conclusion
es: |04.1| Operadores y movimiento |04.2| Cambiar texto |04.3| Repetir un cambio |04.4| Modo Visual |04.5| Mover texto |04.6| Copiar texto |04.7| Uso del portapapeles |04.8| Objetos de texto |04.9| Modo reemplazar |04.10| Conclusión

source: Next chapter: |usr_05.txt| Set your settings Previous chapter: |usr_03.txt| Moving around Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_05.esx| Configuración Capítulo anterior: |usr_03.esx| Desplazamiento Tabla de contenidos: |usr_toc.esx|

source: *04.1* Operators and motions
es: *04.1* Operadores y movimiento

source: In chapter 2 you learned the "x" command to delete a single character.
es: En el capítulo 2 aprendió que la orden «x» elimina un único carácter.

source: And using a count: "4x" deletes four characters.
es: Y que usar un multiplicador: «4x» elimina cuatro caracteres.

source: The "dw" command deletes a word.
es: La orden «dw» elimina una palabra.

source: You may recognize the "w" command as the move word command.
es: Reconocerá la orden «w» como el de movimiento sobre palabras.

source: In fact, the "d" command may be followed by any motion command, and it deletes from the current location to the place where the cursor winds up.
es: De hecho, la orden «d» se ha completar con una orden de movimiento, y elimina desde la posición actual hasta donde marque el movimiento.

source: The "4w" command, for example, moves the cursor over four words.
es: La orden «4w», por ejemplo, mueve el cursor cuatro palabras.

source: The d4w command deletes four words.
es: La orden d4w elimina cuatro palabras.

source: Vim only deletes up to the position where the motion takes the cursor.
es: Vim sólo elimina hasta la posición donde la orden de movimiento le lleva.

source: That's because Vim knows that you probably don't want to delete the first character of a word.
es: Eso es porque Vim sabe que probablemente no desea eliminar la primera letra de una palabra.

source: If you use the "e" command to move to the end of a word, Vim guesses that you do want to include that last character:
es: Si usa la orden «ex para desplazarse hasta el final de una palabra, Vim adivina que quiere incluir el último carácter:

source: Whether the character under the cursor is included depends on the command you used to move to that character.
es: El que el carácter bajo el cursor se incluya o no depende de la orden de movimiento empleado.

source: The reference manual calls this "exclusive" when the character isn't included and "inclusive" when it is.
es: El manual de referencia llama a esto «exclusivo» cuando el carácter no se incluye e «inclusivo» en caso contrario.

source: The "$" command moves to the end of a line.
es: La orden «$» le desplaza hasta el final de la línea.

source: The "d$" command deletes from the cursor to the end of the line.
es: La orden «d$» elimina desde el cursor hasta el final de la línea.

source: This is an inclusive motion, thus the last character of the line is included in the delete operation:
es: Este es un movimiento inclusivo, por lo que el último carácter de la línea se incluye en la operación:

source: To err is human ~
es: Errar es humano ~

source: There is a pattern here: operator-motion.
es: Esto sigue siempre la misma estructura: operador-movimiento.

source: You first type an operator command.
es: Primero introduce el operador.

source: For example, "d" is the delete operator.
es: Por ejemplo, «d» es el operador de eliminación.

source: Then you type a motion command like "4l" or "w".
es: Luego introduce una orden de movimiento «4l» o «w».

source: This way you can operate on any text you can move over.
es: De esta manera, puede operar sobre cualquier texto en el que se pueda desplazar.

source: *04.2* Changing text
es: *04.2* Cambiar texto

source: Another operator is "c", change.
es: Otro operador es «c», cambiar (change).

source: It acts just like the "d" operator, except it leaves you in Insert mode.
es: Actúa justo como el operador «d», excepto que le deja en modo Insertar.

source: For example, "cw" changes a word.
es: Por ejemplo «cw» cambia una palabra.

source: Or more specifically, it deletes a word and then puts you in Insert mode.
es: Es decir, elimina una palabra y le deja en modo Insertar.

source: To err is human ~ -------> c2wbe<Esc>
es: Errar es humano ~ ---------> c2wEl ser<Esc>

source: To be human ~
es: El ser humano ~

source: c the change operator 2w move two words (they are deleted and Insert mode started) be insert this text <Esc> back to Normal mode
es: c el operador de cambio 2w moverse dos palabras (se eliminan y va al modo Insertar) El ser inserta el siguiente texto <Esc> de vuelta al modo Normal

source: If you have paid attention, you will have noticed something strange: The space before "human" isn't deleted.
es: Si ha prestado atención, se habrá dado cuenta de que hay algo raro: El espacio antes de «humano» no se ha eliminado.

source: There is a saying that for every problem there is an answer that is simple, clear, and wrong.
es: Hay un dicho: para cada problema hay una solución que es simple, clara y errónea.

source: That is the case with the example used here for the "cw" command.
es: Este es el caso con el ejemplo usado aquí con la orden «cw».

source: The c operator works just like the d operator, with one exception: "cw".
es: El operador «c» funciona justo como el operador «d», con una excepción: «cw».

source: It actually works like "ce", change to end of word.
es: De hecho, funciona justo igual que «ce», cambiar hasta el final de la palabra.

source: Thus the space after the word isn't included.
es: El espacio después de la palabra no se incluye.

source: This is an exception that dates back to the old Vi.
es: Esta excepción data de Vi.

source: Since many people are used to it now, the inconsistency has remained in Vim.
es: Ya que mucha gente se ha acostumbrado a ella, ha permanecido con Vim.

source: Like "dd" deletes a whole line, "cc" changes a whole line.
es: Del mismo modo que «dd» elimina una línea completa, «cc» la cambia.

source: It keeps the existing indent (leading white space) though.
es: Además, mantiene la sangría (los espacios en blanco precedentes).

source: Just like "d$" deletes until the end of the line, "c$" changes until the end of the line.
es: Así como «d$» elimina hasta el final de la línea, «c$» la cambia hasta el final.

source: It's like doing "d$" to delete the text and then "a" to start Insert mode and append new text.
es: Es como pulsar «d$» para eliminar el texto y luego «a» para activar el modo Insertar y añadir más texto.

source: x stands for dl (delete character under the cursor) X stands for dh (delete character left of the cursor) D stands for d$ (delete to end of the line) C stands for c$ (change to end of the line) s stands for cl (change one character) S stands for cc (change a whole line)
es: x equivale a dl (eliminar carácter bajo el cursor) X equivale a dh (eliminar carácter a la izquierda del cursor) D equivale a d$ (eliminar hasta el final de la línea) C equivale a c$ (cambiar hasta el final de la línea) s equivale a cl (cambiar un carácter) S equivale a cc (cambiar una única línea)

source: The commands "3dw" and "d3w" delete three words.
es: Las órdenes «3dw» y «d3wx eliminan tres palabras.

source: If you want to get really picky about things, the first command, "3dw", deletes one word three times; the command "d3w" deletes three words once.
es: Si quiere ponerse detallista, la primera ordem, «3dw», elimina una palabra tres veces; la orden «d3w» elimina tres palabras de una vez.

source: This is a difference without a distinction.
es: Esta diferencia no se puede distinguir.

source: You can actually put in two counts, however.
es: Sin embargo, puede poner dos multiplicadores.

source: For example, "3d2w" deletes two words, repeated three times, for a total of six words.
es: Por ejemplo «3d2w» elimina dos palabras y lo repite 3 veces, un total de seis palabras.

source: The "r" command is not an operator.
es: La orden «r» no es un operador.

source: It waits for you to type a character, and will replace the character under the cursor with it.
es: Espera a que introduzca un carácter, y reemplazará el carácter bajo el cursor con él.

source: You could do the same with "cl" or with the "s" command, but with "r" you don't have to press <Esc>
es: Puedes hacer lo mismo con la orden «cl» o con «s», pero con «r» no tendrá que pulsar <Esc>

source: there is somerhing grong here ~ rT rt rw
es: aquí hay algo tue esná mal ~ rA rq rt

source: There is something wrong here ~
es: Aquí hay algo que está mal ~

source: Using a count with "r" causes that many characters to be replaced with the same character.
es: Usar un multiplicador con «r» causa que se reemplacen muchos caracteres con el mismo carácter.

source: There is something wrong here ~ 5rx
es: Aquí hay algo que está mal ~ 5rx

source: There is something xxxxx here ~
es: Aquí hay algo que exxxxxal ~

source: To replace a character with a line break use "r<Enter>".
es: Para reemplazar un carácter con un salto de línea use «r<Entrar>».

source: This deletes one character and inserts a line break.
es: Esto elimina un carácter e inserta un salto.

source: Using a count here only applies to the number of characters deleted: "4r<Enter>" replaces four characters with one line break.
es: Usar un multiplicador aquí sólo afecta al número de caracteres eliminados: «4r<Entrar>» reemplaza cuatro caracteres con un salto.

source: *04.3* Repeating a change
es: *04.3* Repetir un cambio

source: The "." command is one of the most simple yet powerful commands in Vim.
es: La orden «.» es uno de los más sencillos pero más potentes de Vim.

source: It repeats the last change.
es: Repite el último cambio.

source: For instance, suppose you are editing an HTML file and want to delete all the <B> tags.
es: Por ejemplo, suponga que está editando un archivo HTML y desea eliminar todas las etiquetas <B>.

source: You position the cursor on the first < and delete the <B> with the command "df>".
es: Para ello, coloque el cursor sobre el primer < y luego elimine el <B> con la orden «df>».

source: You then go to the < of the next </B> and kill it using the "." command.
es: Entonces va al < del </B> y lo elimina con la orden «.».

source: The "." command executes the last change command (in this case, "df>").
es: La orden «.» ejecuta el último cambio (en este caso «df>»).

source: To delete another tag, position the cursor on the < and use the "." command.
es: Para eliminar otra etiqueta, coloque el cursor sobre el < y vuelve a pulsar la orden «.».

source: To <B>generate</B> a table of <B>contents ~ f< find first < ---> df> delete to > --> f< find next < ---------> .
es: Para <B>generar</B> una tabla de <B>contenidos ~ f< ir al primer < ---> df> elimina hasta > --> f< ir al segundo < ----------> .

source: repeat df> ---> f< find next < -------------> .
es: repetir df> ---> f< ir al siguiente < ------------------> .

source: repeat df> -->
es: repetir df> -->

source: Another example: You want to change the word "four" to "five".
es: Otro ejemplo: Desea cambiar la palabra «cuatro» por «cinco».

source: It appears several times in your text.
es: Aparece varias veces en su texto.

source: You can do this quickly with this sequence of commands:
es: Puede hacer esto rápidamente en una secuencia de órdenes:

source: /four<Enter> find the first string "four" cwfive<Esc> change the word to "five" n find the next "four" .
es: /cuatro<Entrar> encuentra la primera cadena «cuatro» cwcinco<Esc> cambia la palabra a «cinco» n encuentra la siguiente cadena «cuatro» .

source: repeat the change to "five' n find the next "four" .
es: repite el cambio a «cinco» n encuentra la siguiente cadena «cuatro» .

source: repeat the change etc.
es: repite el cambio etc.

source: *04.4* Visual mode
es: *04.4* Modo visual

source: To delete simple items the operator-motion changes work quite well.
es: Los cambios operador-movimiento funcionan bastante bien para eliminar elementos sencillos.

source: But often it's not so easy to decide which command will move over the text you want to change.
es: Pero a menudo, no es fácil decidir que orden de movimiento le desplazará hasta el texto que quiere modificar.

source: Then you can use Visual mode.
es: Es el momento de usar el modo Visual.

source: You start Visual mode by pressing "v".
es: Puede iniciar el modo Visual pulsando «v».

source: You move the cursor over the text you want to work on.
es: Puede mover el cursor sobre el texto que desea modificar.

source: While you do this, the text is highlighted.
es: Mientras haces esto, el texto se resalta.

source: Finally type the operator command.
es: Finalmente, teclee la orden del operador.

source: For example, to delete from halfway one word to halfway another word:
es: Por ejemplo, para eliminar de la mitad de una palabra a la mitad de otra:

source: This is an examination sample of visual mode ~ ----------> velllld
es: Esto es una muestra cualquiera del modo Visual ~ ----------> veehhd

source: This is an example of visual mode ~
es: Esto es una muestra del modo Visual ~

source: When doing this you don't really have to count how many times you have to press "l" to end up in the right position.
es: Cuando hace esto, no tiene que contar cuántas veces pulsa «e» o «h» para llegar a la posición deseada.

source: You can immediately see what text will be deleted when you press "d".
es: Puede verlo de forma inmediata antes de pulsar «d».

source: If you want to work on whole lines, use "V" to start Visual mode.
es: Si quiere trabajar con líneas completas, use «V» para iniciar el modo Visual.

source: You will see right away that the whole line is highlighted, without moving around.
es: Verá que toda la línea se resalta, sin ni siquiera mover el cursor.

source: When you move left or right nothing changes.
es: Cuando mueva el cursor a la izquierda o derecha, nada cambiará.

source: When you move up or down the selection is extended whole lines at a time.
es: Si lo mueve hacia arriba o hacia abajo, la selección se extenderá a líneas completas.

source: For example, select three lines with "Vjj":
es: Por ejemplo, seleccione tres líneas con «Vjj»:

source: +------------------------+ | text more text | >> | more text more text | | selected lines >> | text text text | | Vjj >> | text more | V | more text more | +------------------------+
es: +------------------------+ | texto más texto | >> | más texto más texto | | líneas seleccionadas >> | texto texto texto | | Vjj >> | texto más | V | más texto más | +------------------------+

source: If you want to work on a rectangular block of characters, use CTRL-V to start Visual mode.
es: Si desea trabajar en un bloque rectangular de caracteres, use CTRL-V para iniciar el modo Visual.

source: This is very useful when working on tables.
es: Esto es muy útil si trabaja con tablas.

source: name Q1 Q2 Q3 pierre 123 455 234 john 0 90 39 steve 392 63 334
es: nombre Q1 Q2 Q3 pedro 123 455 234 juan 0 90 39 estéban 392 63 334

source: To delete the middle "Q2" column, move the cursor to the "Q" of "Q2".
es: Para eliminar la columna central «Q2» desplaze el cursor a la «Q» de «Q2».

source: Press CTRL-V to start blockwise Visual mode.
es: Pulse CTRL-V para iniciar el modo Visual de bloques.
