Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: A disadvantage of using 'nowrap' is that you can't see the whole sentence you are working on.
es: Una desventaja de usar 'nowrap' es que no puede ver la oración completa sobre la que trabaja.

source: When 'wrap' is on, words are broken halfway, which makes them hard to read.
es: Si 'wrap' está, activada, las palabras se dividen por la mitad, dificultando la lectura.

source: A good solution for editing this kind of paragraph is setting the 'linebreak' option.
es: Una buena solución para editar este tipo de párrafos es definir la opción 'linebreak'.

source: Vim then breaks lines at an appropriate place when displaying the line.
es: Vim dividirá las líneas en los puntos apropiados al mostrar la línea.

source: The text in the file remains unchanged.
es: El texto en el archivo no se modifica.

source: Without 'linebreak' text might look like this:
es: Sin 'linebreak', el texto presentará este aspecto:

source: Unfo| |rtunately for the programmer, he | +---------------------------------+ After: >
es: Unfo| |rtunately for the programmer, he | +---------------------------------+ Después: >

source: Related options: 'breakat' specifies the characters where a break can be inserted.
es: Opciones relacionadas: 'breakat' especifica los caracteres donde insertar el salto de línea.

source: 'showbreak' specifies a string to show at the start of broken line.
es: 'showbreak' especifica una cadena a mostrar al principio de una línea dividida.

source: Set 'textwidth' to zero to avoid a paragraph to be split.
es: Defina 'textwitdh' como cero para evitar dividir un párrafo.

source: The "j" and "k" commands move to the next and previous lines.
es: Las órdenes «j» y «k» desplazan el cursor.

source: When used on a long line, this means moving a lot of screen lines at once.
es: Esto desplaza varias líneas en la pantalla en caso de usarlo sobre una larga línea.

source: To move only one screen line, use the "gj" and "gk" commands.
es: Para desplazarse sólo una línea en la pantalla, use las órdenes «gj» y «gk».

source: When a line doesn't wrap they do the same as "j" and "k".
es: Estas órdenes hacen lo mismo que «j» y «k» si la línea no está justificada.

source: When the line does wrap, they move to a character displayed one line below or above.
es: De activar 'wrap', se desplazan a un carácter visible en una línea inferior o superior.

source: You might like to use these mappings, which bind these movement commands to the cursor keys: >
es: Puede que desee usar estas macros, que relacionan estas órdenes de desplazamiento a las teclas de cursor: >

source: If you want to import text into a program like MS-Word, each paragraph should be a single line.
es: Si desea importar texto desde un programa como MS-Word, cada párrafo debería ser una sola línea.

source: If your paragraphs are currently separated with empty lines, this is how you turn each paragraph into a single line: >
es: De existir una separación entre los párrafos en forma de de líneas vacías, debe realizar lo siguiente para convertir cada párrafo en una sola línea: >

source: That looks complicated.
es: Parece complicado.

source: Let's break it up in pieces:
es: Vamos a dividirlo:

source: :g/./ A ":global" command that finds all lines that contain at least one character.
es: :g/./ Una orden «:global» que encuentra todas las cadenas que contienen al menos un carácter.

source: ,/^$/ A range, starting from the current line (the non-empty line) until an empty line.
es: ,/^$/ Un rango, que empieza en la línea actual (no vacía), y acaba en una línea vacía.

source: join The ":join" command joins the range of lines together into one line.
es: join La orden «:join» (unir) une el rango de líneas en una sola línea.

source: Note that this doesn't work when the separating line is blank but not empty; when it contains spaces and/or tabs.
es: Tenga en cuenta que esto no funciona si la línea de separación está en blanco, pero no vacía; cuando contiene espacios y/o tabulados.

source: This command does work with blank lines: > :g/\S/,/^\s*$/join
es: Esta orden funciona con líneas en blanco: > :g/\S/,/^\s*$/join

source: *25.5* Editing tables
es: *25.5* Editar tablas

source: nice table test 1 test 2 test 3 ~ input A 0.534 ~ input B 0.913 ~
es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 ~ entrada B 0.913 ~

source: You need to enter numbers in the third column.
es: Necesita introducir números en la tercera columna.

source: You could move to the second line, use "A", enter a lot of spaces and type the text.
es: Podría desplazarse a la segunda línea, usar «A», introducir espacios y escribir el texto.

source: For this kind of editing there is a special option: >
es: Existe una orden especial para este tipo de edición: >

source: Now press "j" and you are right where you can enter the value for "input A".
es: Pulse ahora «j» y estará dónde puede introducir el valor para «input A».

source: Typing "0.693" results in:
es: Teclear «0.693» da como resultado:

source: nice table test 1 test 2 test 3 ~ input A 0.534 0.693 ~ input B 0.913 ~
es: Tabla ordenada test 1 test 2 test 3 ~ entrada A 0.534 0.693 ~ entrada B 0.913 ~

source: Vim has automatically filled the gap in front of the new text for you.
es: Vim a rellenado automáticamente el espacio en frente del texto.

source: Now, to enter the next field in this column use "Bj".
es: Ahora, para introducir el siguiente campo de esta columna use «Bj».

source: "B" moves back to the start of a white space separated word.
es: «B» le devuelve al inicio de una palabra separada por un espacio en blanco.

source: Then "j" moves to the place where the next field can be entered.
es: «j» le desplaza al lugar dónde puede introducir el siguiente campo.

source: Note: You can move the cursor anywhere in the display, also beyond the end of a line.
es: Nota: Puede mover el cursor a cualquier lugar de la pantalla, también más allá del final de línea.

source: But Vim will not insert spaces there, until you insert a character in that position.
es: Pero Vim no insertará aquí espacios hasta que inserte un carácter en esa posición.

source: You want to add a column, which should be a copy of the third column and placed before the "test 1" column.
es: Si desea añadir una columna, que debe ser la copia de la tercera columna y deberá situarse antes de la columna «test 1».

source: Do this in seven steps: 1.
es: Haga estos 7 pasos: 1.

source: Move the cursor to the left upper corner of this column, e.g., with "/test 3". 2.
es: Mueva el cursor a la esquina superior izquierda de esta columna, p. ej., con «/test 3». 2.

source: Press CTRL-V to start blockwise Visual mode. 3.
es: Pulse CTRL-V para empezar el modo de bloque visual. 3.

source: Move the cursor down two lines with "2j".
es: Mueva el cursor dos líneas hacia abajo con «2j».

source: You are now in "virtual space": the "input B" line of the "test 3" column. 4.
es: Ahora se encuentra en espacio virtual («virtual space»): la línea «entrada B» de la columna «test 3». 4.

source: Move the cursor right, to include the whole column in the selection, plus the space that you want between the columns.
es: Mueva el cursor a la derecha para incluir toda la columna en la selección además del espacio que desea entre las columnas.

source: "9l" should do it. 5.
es: «9l» hará esto. 5.

source: Yank the selected rectangle with "y". 6.
es: Copie el rectángulo seleccionado con «y» (yank). 6.

source: Move the cursor to "test 1", where the new column must be placed. 7.
es: Mueva el cursor a «test 1», donde se debería situar la nueva columna. 7.

source: Press "P".
es: Pulse «P».

source: nice table test 3 test 1 test 2 test 3 ~ input A 0.693 0.534 0.693 ~ input B 0.913 ~
es: Tabla ordenada test 3 test 1 test 2 test 3 ~ entrada A 0.693 0.534 0.693 ~ entrada B 0.913 ~

source: The disadvantage of using 'virtualedit' is that it "feels" different.
es: La desventaja de usar 'virtualedit' es que parece distinto.

source: You can't recognize tabs or spaces beyond the end of line when moving the cursor around.
es: No puede reconocer tabulados o espacios más allá del final de línea si desplaza el cursor.

source: Another method can be used: Virtual Replace mode.
es: Puede usar otro método: Modo Virtual de Reemplazar.

source: Suppose you have a line in a table that contains both tabs and other characters.
es: Suponga que tiene una línea en una tabla que contienen tabulados y otros caracteres.

source: Use "rx" on the first tab:
es: Use «rx» en el primer tabulado:

source: The layout is messed up.
es: EL diseño está desordenado.

source: To avoid that, use the "gr" command:
es: Use la orden «gr» para evitarlo:

source: What happens is that the "gr" command makes sure the new character takes the right amount of screen space.
es: Lo que ocurre es que la orden «gr» se asegura que el nuevo carácter tomará la cantidad de espacio de pantalla correcta.

source: Extra spaces or tabs are inserted to fill the gap.
es: Los espacios y tabulados adicionales se insertarán en el hueco.

source: Thus what actually happens is that a tab is replaced by "x" and then blanks added to make the text after it keep its place.
es: Por ello, lo que realmente ocurre es que el tabulado se reemplaza por «x», y después se añaden espacios en blanco para que el texto a continuación siga en el mismo sitio.

source: In this case a tab is inserted.
es: En este caso se inserta un tabulado.

source: When you need to replace more than one character, you use the "R" command to go to Replace mode (see |04.9|).
es: Cuando necesita reemplazar más de un carácter, use la orden «R» para pasar al modo Reemplazar (consulte |04.9|).

source: This messes up the layout and replaces the wrong characters:
es: Esto desordena la presentación y reemplaza los caracteres erróneos:

source: The "gR" command uses Virtual Replace mode.
es: La orden «gR» usa el modo Virtual Reemplazar.

source: This preserves the layout:
es: Esto respeta el diseño:

source: *usr_09.txt* For Vim version 7.3.
es: *usr_09.esx* Para Vim versión 7.3.

source: Using the GUI
es: Uso de la interfaz gráfica (GUI)

source: Vim works in an ordinary terminal.
es: Vim funciona en una terminal normal.

source: GVim can do the same things and a few more.
es: GVim puede hacer las mismas cosas y algunas más.

source: The GUI offers menus, a toolbar, scrollbars and other items.
es: La interfaz gráfica ofrece menús, una barra de menú, barras de desplazamiento y otros.

source: This chapter is about these extra things that the GUI offers.
es: Este capítulo trata de las funcionalidades adicionales que la interfaz gráfica ofrece.

source: |09.1| Parts of the GUI |09.2| Using the mouse |09.3| The clipboard |09.4| Select mode
es: |09.1| Partes de la interfaz gráfica |09.2| Uso del ratón |09.3| El portapapeles |09.4| Modo Seleccionar

source: Next chapter: |usr_10.txt| Making big changes Previous chapter: |usr_08.txt| Splitting windows Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_10.esx| Realizar grandes cambios Capítulo anterior: |usr_08.esx| Dividir en ventanas Tabla de contenidos: |usr_toc.esx|

source: *09.1* Parts of the GUI
es: *09.1* Partes de la interfaz gráfica (GUI)

source: You might have an icon on your desktop that starts gVim.
es: Puede que tenga un icono en su escritorio que arranca gVim.

source: Otherwise, one of these commands should do it: >
es: En caso contrario, una de estas órdenes lo hará: >

source: gvim file.txt vim -g file.txt
es: gvim archivo.txt vim -g archivo.txt

source: If this doesn't work you don't have a version of Vim with GUI support.
es: Si esto no funciona es que no tiene la versión de Vim con soporte para GUI.

source: You will have to install one first.
es: Tendrá que instalar una primero.

source: Vim will open a window and display "file.txt" in it.
es: Vim abrirá una ventana y mostrará «archivo.txt».

source: What the window looks like depends on the version of Vim.
es: El aspecto de la ventana dependerá de la versión de Vim.

source: It should resemble the following picture (for as far as this can be shown in ASCII!).
es: Se debería parecer a la siguiente figura (¡tanto como se pueda parecer con texto ASCII!).

source: The largest space is occupied by the file text.
es: El espacio más grande está ocupado por el archivo de texto.

source: This shows the file in the same way as in a terminal.
es: Esto muestra el archivo de una manera similar a una terminal.

source: With some different colors and another font perhaps.
es: Con algunas diferencias de tipo de letra y color, quizá.

source: - The file cannot be modified (e.g., a help file) + The file contains changes = The file is read-only =+ The file is read-only, contains changes anyway
es: - El archivo no se puede modificar (por ej. la ayuda) + El archivo contiene cambios = El archivo es de sólo lectura =+ El archivo es de sólo lectura pero contiene cambios

source: You know how menus work, right?
es: Ya sabe como funcionan los menús, ¿no?

source: Vim has the usual items, plus a few more.
es: Vim tiene los elementos habituales, además de otros.

source: Browse them to get an idea of what you can use them for.
es: Explórelos para tener una idea de cómo podría usarlos.

source: A relevant submenu is Edit/Global Settings.
es: Un submenú relevante es «Editar/Opciones globlales».

source: You will find these entries:
es: Encontrará los siguientes elementos:

source: This contains icons for the most often used actions.
es: Este contiene los iconos para las acciones más empleadas.

source: Hopefully the icons are self-explanatory.
es: La intención es que los iconos se expliquen a sí mismos.

source: There are tooltips to get an extra hint (move the mouse pointer to the icon without clicking and don't move it for a second).
es: Hay globos de ayuda que le aconsejan (pon el puntero sobre un botón y no lo muevas durante un segundo).

source: The "Edit/Global Settings/Toggle Toolbar" menu item can be used to make the toolbar disappear.
es: La opción «Editar/Opciones globales/Ocultar/Mostrar barra de herramientas» se puede emplear para hacer que la barra de herramientas desaparezca.

source: If you never want a toolbar, use this command in your vimrc file: >
es: Si no desea tener una barra de herramientas en ningún momento, escriba esto en su «vimrc»: >

source: This removes the 'T' flag from the 'guioptions' option.
es: Esto elimina la opción 'T' de la opción 'guioptions'.

source: Other parts of the GUI can also be enabled or disabled with this option.
es: Otras partes de la interfaz gráfica se pueden también activar o desactivar del mismo modo.

source: See the help for it.
es: Consulte la ayuda.

source: By default there is one scrollbar on the right.
es: Por omisión sólo hay una barra de desplazamiento en la derecha.

source: It does the obvious thing.
es: Hace lo que se espera de ella.

source: When you split the window, each window will get its own scrollbar.
es: Cada ventana tendrá su barra de desplazamiento.

source: You can make a horizontal scrollbar appear with the menu item Edit/Global Settings/Toggle Bottom Scrollbar.
es: Puede hacer que una barra horizontal aparezca con la opción «Editar/ Opciones globales/Ocultar/Mostrar barra de desplazamiento inferior».

source: This is useful in diff mode, or when the 'wrap' option has been reset (more about that later).
es: Esto es útil en el modo diff, o cuando la opción 'wrap' está desactivada (eso lo veremos más adelante).

source: When there are vertically split windows, only the windows on the right side will have a scrollbar.
es: Cuando hay ventanas divididas verticalmente, sólo las de la derecha tendrán barra de desplazamiento.

source: However, when you move the cursor to a window on the left, it will be this one the that scrollbar controls.
es: Sin embargo, si mueve el cursor a una ventana en la izquierda, será esta la que la barra controle.

source: This takes a bit of time to get used to.
es: Lleva cierto tiempo acostumbrarse a esto.

source: When you work with vertically split windows, consider adding a scrollbar on the left.
es: Cuando trabaje con ventanas divididas verticalmente, considere la posibilidad de añadir barras en la izquierda.

source: This can be done with a menu item, or with the 'guioptions' option: > :set guioptions+=l
es: Pruebe con esta opción: > :set guioptions+=1

source: *09.2* Using the mouse
es: *09.2* Uso del ratón

source: Standards are wonderful.
es: Los estándares son maravillosos.

source: In Microsoft Windows, you can use the mouse to select text in a standard manner.
es: En Microsoft Windows, puede usar el ratón para seleccionar texto de una forma estándar.

source: The X Window system also has a standard system for using the mouse.
es: El sistema de ventanas X Window System también tiene un estándar para el uso del ratón.

source: Unfortunately, these two standards are not the same.
es: Por desgracia, estos dos estándares no son compatibles.

source: Fortunately, you can customize Vim.
es: Afortunadamente, puede personalizarlo en Vim.

source: You can make the behavior of the mouse work like an X Window system mouse or a Microsoft Windows mouse.
es: Puede hacer que el comportamiento del ratón sea el mismo que bajo X o el de Windows.

source: The following command makes the mouse behave like an X Window mouse: >
es: La siguiente orden hace que el ratón se comporte como bajo X: >

source: The default behavior of the mouse on UNIX systems is xterm.
es: El comportamiento predeterminado de un ratón en los sistemas UNIX es xterm.

source: The default behavior on a Microsoft Windows system is selected during the installation process.
es: El comportamiento predeterminado en un sistema Windows se selecciona durante la instalación.

source: For details about what the two behaviors are, see |:behave|.
es: Para más detalles sobre estos comportamientos, consulte |:behave|.

source: Here follows a summary.
es: Aquí tiene un pequeño resumen:

source: Left mouse click position the cursor Left mouse drag select text in Visual mode Middle mouse click paste text from the clipboard Right mouse click extend the selected text until the mouse pointer
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Visual Click botón central pegar texto desde el portapapeles Click botón derecho extender el texto seleccionado hasta el puntero del ratón

source: Left mouse click position the cursor Left mouse drag select text in Select mode (see |09.4|) Left mouse click, with Shift extend the selected text until the mouse pointer Middle mouse click paste text from the clipboard Right mouse click display a pop-up menu
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Seleccionar (|09.4|) Click botón izquierdo, con May. extender el texto seleccionado hasta el puntero del ratón Click botón central pegar texto desde el portapapeles Click botón derecho mostrar un menú pop-up

source: The mouse can be further tuned.
es: Puede configurar el ratón con más detalle.

source: Check out these options if you want to change the way how the mouse works:
es: Consulte estas opciones si desea cambiar el funcionamiento del ratón:

source: 'mouse' in which mode the mouse is used by Vim 'mousemodel' what effect a mouse click has 'mousetime' time between clicks for a double-click 'mousehide' hide the mouse while typing 'selectmode' whether the mouse starts Visual or Select mode
es: 'mouse' en qué modo Vim usa el ratón 'mousemodel' qué efectos tiene pulsar con el ratón 'mousetime' tiempo entre dos pulsacionespara un doble click 'mousehide' esconde el ratón mientras teclea 'selectmode' si el ratón comienza el modo Visual o Seleccionar

source: *09.3* The clipboard
es: *09.3* El portapapeles

source: In section |04.7| the basic use of the clipboard was explained.
es: En la sección |04.7| se explica el uso básico del portapapeles.

source: There is one essential thing to explain about X-windows: There are actually two places to exchange text between programs.
es: Hay algo esencial que debe ser explicado sobre las X-windows: Hay dos lugares para intercambiar texto entre programas.

source: MS-Windows doesn't have this.
es: MS-Windows sólo tiene uno.

source: In X-Windows there is the "current selection".
es: En X-Windows hay una «selección actual».

source: This is the text that is currently highlighted.
es: Esto es el texto que está actualmente marcado.

source: In Vim this is the Visual area (this assumes you are using the default option settings).
es: En Vim esto es el área Visual (suponiendo que usa las opciones predeterminadas).

source: You can paste this selection in another application without any further action.
es: Puede pegar esta selección en otra aplicación sin ninguna acción posterior.

source: For example, in this text select a few words with the mouse.
es: Por ejemplo, en este texto seleccione unas cuantas palabras con el ratón.

source: Vim will switch to Visual mode and highlight the text.
es: Vim pasará al modo Visual y resaltará el texto.

source: Now start another gVim, without a file name argument, so that it displays an empty window.
es: Ahora inicie otro gVim, sin un nombre de archivo, de forma que muestre una ventana vacía.

source: Click the middle mouse button.
es: Pulse el botón central del ratón.

source: The selected text will be inserted.
es: El texto seleccionado se insertará.

source: The "current selection" will only remain valid until some other text is selected.
es: La «selección actual» sólo será válida hasta que seleccione otro texto.

source: After doing the paste in the other gVim, now select some characters in that window.
es: Tras pegar el texto en otro gVim, seleccione ahora algunos caracteres en esa ventana.

source: You will notice that the words that were previously selected in the other gVim window are displayed differently.
es: Se dará cuenta de que las palabras que estaban previamente seleccionadas en otra ventana gVim se muestran de otro modo.

source: This means that it no longer is the current selection.
es: Esto significa que ya no están en la «selección actual».

source: This use of both the "current selection" and the "real clipboard" might sound a bit confusing.
es: Esto de usar simultáneamente la «selección actual» y el «verdadero portapapeles» puede sonar un poco confuso.

source: But it is very useful.
es: Pero es muy útil.

source: Let's show this with an example.
es: Veámoslo con un ejemplo.

source: Use one gVim with a text file and perform these actions:
es: Abra un gVim con un archivo de texto y haga lo siguiente:

source: If you don't like using the mouse, you can access the current selection and the real clipboard with two registers.
es: Si no le gusta usar el ratón, puede acceder a la selección actual y al verdadero portapapeles con dos registros.

source: The "* register is for the current selection.
es: El registro "* es para la selección actual.

source: To make text become the current selection, use Visual mode.
es: Para hacer que el texto se convierta en selección actual, use el modo Visual.

source: For example, to select a whole line just press "V".
es: Por ejemplo, para seleccionar una línea completa use «V».

source: To insert the current selection before the cursor: >
es: Para insertar la selección actual antes del cursor: >

source: Notice the uppercase "P".
es: Observe que es una «P» mayúscula.

source: The lowercase "p" puts the text after the cursor.
es: La «p» minúscula la pone tras el cursor.

source: The "+ register is used for the real clipboard.
es: El registro "+ se usa para el verdadero portapapeles.

source: For example, to copy the text from the cursor position until the end of the line to the clipboard: >
es: Por ejemplo, para copiar el texto desde la posición del cursor hasta el final de línea: >
