Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: 2. Using filetype plugin files Many different filetypes are edited with different options. For example, when you edit a "c" file, it's very useful to set the 'cindent' option to automatically indent the lines. These commonly useful option settings are included with Vim in filetype plugins. You can also add your own, see |write-filetype-plugin|.
es: 2. Usar extensiones de tipo de archivo («filetype plugin») Muchos tipos de archivo se editan con diferentes opciones. Por ejemplo, cuando edita un archivo «c», es muy útil activar la opción «cindent» para sangrar las líneas automáticamente. Estas opciones empleadas comúnmente están incluidas con Vim en las extensiones de tipos de archivo. También puede incluir las tuyas propias, consulte |write-filetype-plugin|.

source: 3. Using indent files When editing programs, the indent of a line can often be computed automatically. Vim comes with these indent rules for a number of filetypes. See |:filetype-indent-on| and 'indentexpr'.
es: 3. Usar archivos de tabulación Cuando edita programas, la sangría de una línea puede a menudo ser computada de manera automática. Vim viene con esas reglas de sangrado para diversos tipos de archivo. Véase |:filetype-indent-on| y 'indentexpr'.

source: This makes Vim break text to avoid lines getting longer than 78 characters. But only for files that have been detected to be plain text. There are actually two parts here. "autocmd FileType text" is an autocommand. This defines that when the file type is set to "text" the following command is automatically executed. "setlocal textwidth=78" sets the 'textwidth' option to 78, but only locally in one file.
es: Esto hace que Vim divida el texto para evitar que las líneas sean más largas de 78 caracteres. Pero sólo para archivos que se han identificado como de texto regular. Aqui hay dos aspectos. «autocmd FileType text» es una autoorden. Esto define que cuando el tipo de archivo sea «texto», la orden posterior se ejecute automáticamente. «setlocal textwidth=78» ajusta la opción 'textwidth' a 78, pero sólo localmente a un archivo.

source: Another autocommand. This time it is used after reading any file. The complicated stuff after it checks if the '" mark is defined, and jumps to it if so. The backslash at the start of a line is used to continue the command from the previous line. That avoids a line getting very long. See |line-continuation|. This only works in a Vim script file, not when typing commands at the command-line.
es: Otra autoorden. Esta vez se ejecuta tras leer cualquier archivo. Las cosas tan complicadas que hay después de él comprueban si la marca '" está definida, y salta hacia ella si lo está. La barra inversa al comienzo de la línea se emplea para continuarla desde la anterior. Esto ayuda a acortar las líneas. Véase |line-continuation|. Esto funciona sólo dentro de un script de Vim, no cuando se teclean órdenes en la línea de órdenes.

source: *05.3* Simple mappings
es: *05.3* Macros sencillas

source: A mapping enables you to bind a set of Vim commands to a single key. Suppose, for example, that you need to surround certain words with curly braces. In other words, you need to change a word such as "amount" into "{amount}". With the :map command, you can tell Vim that the F5 key does this job. The command is as follows: >
es: Una macro le permite ligar un conjunto de órdenes de Vim a una sola tecla. Suponga, por ejemplo, que necesita poner una palabra entre llaves. En otras palabras necesita cambiar una palabra como «cantidad» a «{cantidad}». Con la orden :map, puede decirle a Vim que la tecla F5 haga precisamente eso. La orden es la siguiente: >

source: :map <F5> i{<Esc>ea}<Esc> < Note: When entering this command, you must enter <F5> by typing four characters. Similarly, <Esc> is not entered by pressing the <Esc> key, but by typing five characters. Watch out for this difference when reading the manual!
es: :map <F5> i{<Esc>ea}<Esc> < Nota: Cuando introduzca esta orden, debe introducir <F5> tecleando cuatro caracteres. De igual manera, <Esc> no se introduce pulsando la tecla <Esc>, sino tecleando cinco caracteres. De hecho, ¡¡has de poner los nombres en inglés, no la versión traducida!!

source: Let's break this down: <F5> The F5 function key. This is the trigger key that causes the command to be executed as the key is pressed.
es: Veámoslo por partes: <F5> La tecla de función F5. Esta es la tecla que lanzará la orden para que éste se ejecute al ser pulsada.

source: i{<Esc> Insert the { character. The <Esc> key ends Insert mode.
es: i{<Esc> Insertar el carácter {. <Esc> sale del modo Insertar.

source: e Move to the end of the word.
es: e Moverse al final de la palabra.

source: a}<Esc> Append the } to the word.
es: a}<Esc> Añadir el } a la palabra.

source: The ":map" command (with no arguments) lists your current mappings. At least the ones for Normal mode. More about mappings in section |40.1|.
es: La orden «:map» (sin argumentos) le da un listado de sus macros actuales. Al menos aquellos en el modo Normal. Más sobre macros en la sección |40.1|.

source: *05.4* Adding a plugin *add-plugin* *plugin*
es: *05.4* Añadir una extensión *add-plugin* *plugin*

source: Vim's functionality can be extended by adding plugins. A plugin is nothing more than a Vim script file that is loaded automatically when Vim starts. You can add a plugin very easily by dropping it in your plugin directory. {not available when Vim was compiled without the |+eval| feature}
es: La funcionalidad de Vim puede ser extendida añadiendo extensiones. Una extensiones no es nada más que un script de Vim que se carga automáticamente cuando Vim arranca. Puede añadir nuevas extensiones añadiéndolos al directorio de extensiones. {no disponible si no se ha compilad con Vim con la opción |+eval|}.

source: global plugin: Used for all kinds of files filetype plugin: Only used for a specific type of file
es: Extensión global: Empleado para todos los tipos de archivo Extensión de tipo de archivo: Empleado para un tipo de archivo específico

source: GLOBAL PLUGINS *standard-plugin*
es: EXTENSIONES GLOBALES *standard-plugin*

source: When you start Vim, it will automatically load a number of global plugins. You don't have to do anything for this. They add functionality that most people will want to use, but which was implemented as a Vim script instead of being compiled into Vim. You can find them listed in the help index |standard-plugin-list|. Also see |load-plugins|.
es: Cuando arranque Vim, verá que carga automáticamente un grupo de extensiones globales. No tiene que hacer nada al respecto. Éstos añaden funcionalidad que le interesan a la mayoría de gente, pero que se implementaron como scripts de Vim en lugar de compilarlos en Vim. Puedes verlos listados en el índice de ayuda |standard-plugin-list|. Véase también |load-plugins|.

source: *add-global-plugin* You can add a global plugin to add functionality that will always be present when you use Vim. There are only two steps for adding a global plugin: 1. Get a copy of the plugin. 2. Drop it in the right directory.
es: *add-global-plugin* Puede poner un extensión global para añadir funcionalidad que deba estar siempre presente cuando use Vim. Sólo tiene que seguir dos pasos para añadir una extensión global: 1. Conseguir una copia de la extensión. 2. Ubicar en el directorio adecuado

source: Where can you find plugins? - Some come with Vim. You can find them in the directory $VIMRUNTIME/macros and its sub-directories. - Download from the net. There is a large collection on http://www.vim.org. - They are sometimes posted in a Vim |maillist|. - You could write one yourself, see |write-plugin|.
es: ¿Dónde encontrar extensiones? - Algunos vienen con Vim. Puede encontrarlos en el directorio $VIMRUNTIME/macro y sus subdirectorios. - Descargarlos de la red. Hay una buena colección en http://www.vim.org. - Algunas veces se envían a la |maillist| de Vim. - Puede escribir uno usted mismo, consulte |write-plugin|.

source: Some plugins come as a vimball archive, see |vimball|. Some plugins can be updated automatically, see |getscript|.
es: Algunas extensiones vienen como un archivo comprimido, consulte |vimball|. Algunas extensiones pueden ser actualizados automáticamente, consulte |getscript|.

source: First read the text in the plugin itself to check for any special conditions. Then copy the file to your plugin directory:
es: Lea primero el texto en la extensión descargada para comprobar cualquier requerimiento. A continuación copielo al directorio de extensiones:

source: system plugin directory ~ Unix ~/.vim/plugin/ PC and OS/2 $HOME/vimfiles/plugin or $VIM/vimfiles/plugin Amiga s:vimfiles/plugin Macintosh $VIM:vimfiles:plugin Mac OS X ~/.vim/plugin/ RISC-OS Choices:vimfiles.plugin
es: sistema directorio de extensiones ~ Unix ~/.vim/plugin/ PC and OS/2 $HOME/vimfiles/plugin or $VIM/vimfiles/plugin Amiga s:vimfiles/plugin Macintosh $VIM:vimfiles:plugin Mac OS X ~/.vim/plugin/ RISC-OS Choices:vimfiles.plugin

source: That's all! Now you can use the commands defined in this plugin to justify text.
es: ¡Esto es todo! Ahora puede usar las órdenes definidas en esta extensión para justificar texto.

source: Instead of putting plugins directly into the plugin/ directory, you may better organize them by putting them into subdirectories under plugin/. As an example, consider using "~/.vim/plugin/perl/*.vim" for all your Perl plugins.
es: En lugar de poner las extensiones directamente en el directorio «plugins/», quizá prefiera organizarlos poniéndolos en subdirectorios dentro de «plugins/». Por ejemplo, ponga todas sus extensiones de Perl bajo el subdirectorio «~/.vim/plugin/perl/*.vim».

source: FILETYPE PLUGINS *add-filetype-plugin* *ftplugins*
es: EXTENSIONES DE TIPO DE ARCHIVO *add-filetype-plugin* *ftplugins*

source: That's all! See |vimrc-filetype|.
es: Eso es todo. Véase |vimrc-filetype|.

source: If you are missing a plugin for a filetype you are using, or you found a better one, you can add it. There are two steps for adding a filetype plugin: 1. Get a copy of the plugin. 2. Drop it in the right directory.
es: Si echa de menos una extensión para un tipo de archivo que esté usando, o encontró uno mejor, puede añadirlo. Hay dos pasos para conseguirlo: 1. Conseguir una copia de la extensión. 2. Copiar en el directorio adecuado.

source: You can find them in the same places as the global plugins. Watch out if the type of file is mentioned, then you know if the plugin is a global or a filetype one. The scripts in $VIMRUNTIME/macros are global ones, the filetype plugins are in $VIMRUNTIME/ftplugin.
es: Puede encontrarlos en los mismos sitios que las extensiones globales. Compruebe si el tipo de archivo se menciona o no, de ese modo puede saber si la extensión es global o de tipo de archivo. Los scripts en «$VIMRUNTIME/macros» son globales, los específicos están en «$VIMRUNTIME/ftplugin».

source: USING A FILETYPE PLUGIN *ftplugin-name*
es: USAR UNA EXTENSIÓN DE TIPO DE ARCHIVO *ftplugin-name*

source: You can add a filetype plugin by dropping it in the right directory. The name of this directory is in the same directory mentioned above for global plugins, but the last part is "ftplugin". Suppose you have found a plugin for the "stuff" filetype, and you are on Unix. Then you can move this file to the ftplugin directory: >
es: Puede añadir una extensión de tipo de archivo ubicándolo en el directorio adecuado. El nombre de este directorio está en el mismo directorio mencionado previamente para extensiones globales, pero la última parte es «ftplugin». Suponga que ha encontrado una extensión para el tipo de archivo «cosas» y que está bajo Unix. Puede mover este archivo al directorio «ftplugin/»: >

source: mv thefile ~/.vim/ftplugin/stuff.vim
es: mv thefile ~/.vim/ftplugin/cosas.vim

source: If that file already exists you already have a plugin for "stuff". You might want to check if the existing plugin doesn't conflict with the one you are adding. If it's OK, you can give the new one another name: >
es: Si ese archivo ya existe, es que ya tiene una extensión para «cosas». Tal vez desee comprobar si la extensión existente no es conflictivo con el que añade. Si no hay conflicto, puede darle otro nombre:

source: mv thefile ~/.vim/ftplugin/stuff_too.vim
es: mv thefile ~/.vim/ftplugin/cosas_dos.vim

source: The underscore is used to separate the name of the filetype from the rest, which can be anything. If you use "otherstuff.vim" it wouldn't work, it would be loaded for the "otherstuff" filetype.
es: El guión bajo se usa para separar el nombre del tipo de archivo del resto, que puede ser cualquier cosa. Si usa «otrascosas.vim» no funcionaría, ya que se cargaría como tipo de archivo «otrascosas».

source: On MS-DOS you cannot use long filenames. You would run into trouble if you add a second plugin and the filetype has more than six characters. You can use an extra directory to get around this: >
es: En MS-DOS no puede usar nombres de archivo largos. Tendrá problemas si añades una segunda extensión el tipo de archivo tiene más de seis caracteres. Puede añadir un directorio extra para evitar este problema: >

source: mkdir $VIM/vimfiles/ftplugin/fortran copy thefile $VIM/vimfiles/ftplugin/fortran/too.vim
es: mkdir $VIM/vimfiles/ftplugin/fortran copy thefile $VIM/vimfiles/ftplugin/fortran/dos.vim

source: ftplugin/<filetype>.vim ftplugin/<filetype>_<name>.vim ftplugin/<filetype>/<name>.vim
es: ftplugin/<tipo_de_archivo>.vim ftplugin/<tipo_de_archivo>_<nombre>.vim ftplugin/<tipo_de_archivo>/<nombre>.vim

source: Here "<name>" can be any name that you prefer. Examples for the "stuff" filetype on Unix: >
es: Aquí, «<nombre>» puede ser cualquier nombre que quieras. Ejemplos para el tipo de archivo «cosas» en Unix: >

source: ~/.vim/ftplugin/stuff.vim ~/.vim/ftplugin/stuff_def.vim ~/.vim/ftplugin/stuff/header.vim
es: ~/.vim/ftplugin/cosas.vim ~/.vim/ftplugin/cosas_def.vim ~/.vim/ftplugin/cosas/header.vim

source: The <filetype> part is the name of the filetype the plugin is to be used for. Only files of this filetype will use the settings from the plugin. The <name> part of the plugin file doesn't matter, you can use it to have several plugins for the same filetype. Note that it must end in ".vim".
es: La parte <tipo_de_archivo> es el nombre del tipo de archivo para el cuál se usa la extensión. Sólo los archivos de este tipo cargarán esta extensión. La parte <nombre> de la extensión no importa, puede usarlo para tener varias extensiones del mismo tipo de archivo. Tenga en cuenta que debe terminar con la extensión «.vim».

source: Further reading: |filetype-plugins| Documentation for the filetype plugins and information about how to avoid that mappings cause problems. |load-plugins| When the global plugins are loaded during startup. |ftplugin-overrule| Overruling the settings from a global plugin. |write-plugin| How to write a plugin script. |plugin-details| For more information about using plugins or when your plugin doesn't work. |new-filetype| How to detect a new file type.
es: Lecturas de ampliación: |filetype-plugins| Documentación para las extensiones de tipo de archivo e información sobre como evitar problemas con macros. |load-plugins| Cuándo las extensiones globales se cargan. |ftplugin-overrule| Sobreescribir las opciones de una extensión global. |write-plugin| Cómo escribir un script de extensión. |plugin-details| Para más información sobre cómo usar extensiones o cuando la extensión no funciona. |new-filetype| Cómo detectar un nuevo tipo de archivo.

source: *05.5* Adding a help file *add-local-help* *matchit-install*
es: *05.5* Añadir un archivo de ayuda *add-local-help* *matchit-install*

source: If you are lucky, the plugin you installed also comes with a help file. We will explain how to install the help file, so that you can easily find help for your new plugin. Let us use the "matchit.vim" plugin as an example (it is included with Vim). This plugin makes the "%" command jump to matching HTML tags, if/else/endif in Vim scripts, etc. Very useful, although it's not backwards compatible (that's why it is not enabled by default). This plugin comes with documentation: "matchit.txt". Let's first copy the plugin to the right directory. This time we will do it from inside Vim, so that we can use $VIMRUNTIME. (You may skip some of the "mkdir" commands if you already have the directory.) >
es: Si tiene suerte, la extensión que instaló viene con un archivo de ayuda. Le explicaremos cómo instalar el archivo de ayuda, para que pueda encontrar ayuda fácilmente para su nueva extensión. Usemos el plugin «matchit.vim» como ejemplo (viene incluido con Vim). Esta extensión hace que la orden «%» salte a tags emparejados de HTML, «if/else/endif» en scripts de Vim, etc. Muy útil, pero no es compatible con versiones anteriores (por lo que no está activado por defecto). Esta extensión viene con la documentación «matchit.txt». Primero copiemos la extensión al directorio adecuado. Esta vez lo haremos desde dentro de Vim, así podremos usar $VIMRUNTIME. (Puede omitir la orden «mkdir» si ya tiene el directorio.) >

source: Now create a "doc" directory in one of the directories in 'runtimepath'. >
es: Ahora cree un directorio «doc» en una de los directorios de 'runtimepath'. >

source: Copy the help file to the "doc" directory. >
es: Copie el archivo de ayuda al directorio «doc». >

source: Now comes the trick, which allows you to jump to the subjects in the new help file: Generate the local tags file with the |:helptags| command. >
es: Por último el truco que le permite ir a los temas en el nuevo archivo de ayuda: Genere el archivo de tags locales con la orden |:helptags|. >

source: command to find help for "g%" in the help file you just added. You can see an entry for the local help file when you do: >
es: para buscar ayuda para «g%» en el archivo de ayuda que acaba de añadir. Puede ver una entrada correspondiente al archivo local cuando escriba: >

source: The title lines from the local help files are automagically added to this section. There you can see which local help files have been added and jump to them through the tag.
es: Las líneas con los títulos de los archivos de ayuda locales son añadidos automágicamente a la sección. Allí puede ver que archivos locales se han añadido e ir a ellos a través del tag creado.

source: *05.6* The option window
es: *05.6* La ventana de opciones

source: If you are looking for an option that does what you want, you can search in the help files here: |options|. Another way is by using this command: >
es: Si busca una opción que haga lo que quiere, puede buscarla en los archivos de ayuda aquí: |options|. Otra forma es usar la orden: >

source: You can change the value of an option. For example, move to the "displaying text" subject. Then move the cursor down to this line:
es: Puede cambiar el valor de una opción. Por ejemplo, vaya al tema «displaying text». Luego ponga el cursor abajo, en esta línea:

source: Just above this line is a short description of the 'wrap' option. Move the cursor one line up to place it in this line. Now hit <Enter> and you jump to the full help on the 'wrap' option.
es: Justo sobre esta línea hay una descripción corta de la opción 'wrap'. Ponga el cursor una línea arriba para colocarlos sobre esta línea. Ahora pulse <Intro> e irá hacia la descripción completa de la opción 'wrap'.

source: For options that take a number or string argument you can edit the value. Then press <Enter> to apply the new value. For example, move the cursor a few lines up to this line:
es: Para opciones que toman un número o una cadena de caracteres puede editar el valor. Pulse <Intro> para aplicar el nuevo valor. Por ejemplo, mueva el cursor unas cuantas líneas arriba hasta esta línea:

source: Position the cursor on the zero with "$". Change it into a five with "r5". Then press <Enter> to apply the new value. When you now move the cursor around you will notice that the text starts scrolling before you reach the border. This is what the 'scrolloff' option does, it specifies an offset from the window border where scrolling starts.
es: Posicione el cursor sobre el cero con «$». Modifiqueló a un cinco con «r5». Luego pulse <Intro> para aplicar el nuevo valor. Cuando mueva el cursor por un texto, notará que el texto se desplazará (scroll) antes de que llegue al borde. Esto es lo que la opción 'scrolloff' hace, especifica una compensación (offset) del punto donde comienza el desplazamiento (respecto al borde).

source: *05.7* Often used options
es: *05.7* Opciones más comunes

source: There are an awful lot of options. Most of them you will hardly ever use. Some of the more useful ones will be mentioned here. Don't forget you can find more help on these options with the ":help" command, with single quotes before and after the option name. For example: >
es: Hay una cantidad de opciones inmensa. Difícilmente llegará a usar gran parte de ellas. Algunas de las más comunes se citarán a continuación. No se olvide de que puede encontrar más ayuda con la orden «:help», con comillas simples alrededor del nombre de la opción. Por ejemplo: >

source: In case you have messed up an option value, you can set it back to the default by putting an ampersand (&) after the option name. Example: >
es: En caso de que haya descolocado el valor de una opción, puede devolverlo a la opción por defecto con un et (&) tras el nombre de la opción. Por ejemplo: >

source: Vim normally wraps long lines, so that you can see all of the text. Sometimes it's better to let the text continue right of the window. Then you need to scroll the text left-right to see all of a long line. Switch wrapping off with this command: >
es: Vim normalmente dobla líneas largas, de forma que pueda ver todo el texto. A veces es mejor dejar que el texto continúe a la derecha de la ventana. De este modo tiene que desplazarse de izquierda a derecha para ver toda una línea larga. Puede intercambiar el valor con la siguiente orden: >

source: Vim will automatically scroll the text when you move to text that is not displayed. To see a context of ten characters, do this: >
es: Vim automáticamente desplazará el texto cuando se desplace hacia el texto que no se muestra en pantalla. Para ver un contexto de diez caracteres: >

source: Most commands for moving around will stop moving at the start and end of a line. You can change that with the 'whichwrap' option. This sets it to the default value: >
es: La mayoría de las órdenes para desplazarse dejarán de funcionar al comienzo o al final de una línea. Puede cambiar esto con la opción 'whichwrap'. Esto la cambia al valor predeterminado: >

source: This allows the <BS> key, when used in the first position of a line, to move the cursor to the end of the previous line. And the <Space> key moves from the end of a line to the start of the next one.
es: Esto permite que la tecla <Retroceso>, cuando se emplea en la primera posición de una línea se mueva al final de la línea anterior. También la tecla <Espacio> le desplazará desde el final de una línea hasta el comienzo de la siguiente.

source: This is still only for Normal mode. To let <Left> and <Right> do this in Insert mode as well: >
es: Esto es exclusivamente en el modo Normal. Para permitir que <Izq> y <Der> haga esto en también modo Insertar, escriba: >

source: When there are tabs in a file, you cannot see where they are. To make them visible: >
es: Cuando hay pestañas en un archivo, no puede ver dónde están. Para hacerlas visibles: >
