Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Variables: *var-functions* type() type of a variable islocked() check if a variable is locked function() get a Funcref for a function name getbufvar() get a variable value from a specific buffer setbufvar() set a variable in a specific buffer getwinvar() get a variable from specific window gettabvar() get a variable from specific tab page gettabwinvar() get a variable from specific window & tab page setwinvar() set a variable in a specific window settabvar() set a variable in a specific tab page settabwinvar() set a variable in a specific window & tab page garbagecollect() possibly free memory
es: Variables: *var-functions* type() tipo de una variable islocked() comprueba si una variable ha sido bloqueada function() obtiene una referencia a función para el nombre de función dado getbufvar() obtiene una variable de un búfer específico setbufvar() define una variable en un búfer específico getwinvar() obtiene una variable de una ventana específica gettabvar() obtiene una variable de una pestaña específica gettabwinvar() obtiene una variable de una ventana y pestaña específicas setwinvar() define una variable en una ventana específica settabvar() define una variable en una pestaña específica settabwinvar() define una variable en una ventana y pestaña específicas garbagecollect() potencialmente libera memoria

source: Cursor and mark position: *cursor-functions* *mark-functions* col() column number of the cursor or a mark virtcol() screen column of the cursor or a mark line() line number of the cursor or mark wincol() window column number of the cursor winline() window line number of the cursor cursor() position the cursor at a line/column getpos() get position of cursor, mark, etc.
es: Posición de marcas y del cursor: *cursor-functions* *mark-functions* col() número de columna del cursor o de una marca virtcol() número de columna en pantalla del cursor o de una marca line() número de línea del cursor o de una marca wincol() número de columna de ventana del cursor winline() número de línea de ventana del cursor cursor() ubica el cursor en una linea/columna getpos() obtiene la posición del cursor, marca, etc.

source: setpos() set position of cursor, mark, etc.
es: setpos() define la posición del cursor, marca, etc.

source: byte2line() get line number at a specific byte count line2byte() byte count at a specific line diff_filler() get the number of filler lines above a line
es: byte2line() obtiene el número de línea correspondiente a un índice en bytes line2byte() índice en bytes correspondiente a una línea específica diff_filler() obtiene la cantidad de líneas de relleno encima de una línea

source: Working with text in the current buffer: *text-functions* getline() get a line or list of lines from the buffer setline() replace a line in the buffer append() append line or list of lines in the buffer indent() indent of a specific line cindent() indent according to C indenting lispindent() indent according to Lisp indenting nextnonblank() find next non-blank line prevnonblank() find previous non-blank line search() find a match for a pattern searchpos() find a match for a pattern searchpair() find the other end of a start/skip/end searchpairpos() find the other end of a start/skip/end searchdecl() search for the declaration of a name
es: Manipulación de texto en el búfer actual: *text-functions* getline() obtiene una línea o lista de líneas del búfer setline() reemplaza una línea del búfer append() añade una línea o lista de líneas al búfer indent() sangrado de una línea específica cindent() sangrado de una línea de acuerdo al estilo para C lispindent() sangrado de una línea de acuerdo al estilo para Lisp nextnonblank() ubica la siguiente línea no vacía prevnonblank() ubica la anterior línea no vacía search() ubica una coincidencia para un patrón searchpos() ubica una coincidencia para un patrón searchpair() ubica la parte correspondiente a un inicio/medio/final searchpairpos() ubica la parte correspondiente a un inicio/medio/final searchdecl() busca la declaración de un nombre

source: *system-functions* *file-functions* System functions and manipulation of files: glob() expand wildcards globpath() expand wildcards in a number of directories findfile() find a file in a list of directories finddir() find a directory in a list of directories resolve() find out where a shortcut points to fnamemodify() modify a file name pathshorten() shorten directory names in a path simplify() simplify a path without changing its meaning executable() check if an executable program exists filereadable() check if a file can be read filewritable() check if a file can be written to getfperm() get the permissions of a file getftype() get the kind of a file isdirectory() check if a directory exists getfsize() get the size of a file getcwd() get the current working directory haslocaldir() check if current window used |:lcd| tempname() get the name of a temporary file mkdir() create a new directory delete() delete a file rename() rename a file system() get the result of a shell command hostname() name of the system readfile() read a file into a List of lines writefile() write a List of lines into a file
es: *system-functions* *file-functions* Funciones del sistema y manipulación de archivos: glob() expande comodines globpath() expande comodines en múltiples directorios findfile() ubica un archivo en una lista de directorios finddir() ubica un directorio en una lista de directorios resolve() determina a dónde apunta un acceso o enlace directo fnamemodify() modifica un nombre de archivo pathshorten() abrevia nombres de directorio en una ruta simplify() simplifica una ruta sin cambiar su significado executable() comprueba si un programa ejecutable existe filereadable() comprueba si se puede leer un archivo filewritable() comprueba si se puede escribir a un archivo getfperm() obtiene los permisos para un archivo getftype() obtiene el tipo de un archivo isdirectory() comprueba si un directorio existe getfsize() obtiene el tamaño de un archivo getcwd() obtiene el directorio de trabajo actual haslocaldir() comprueba si se ha usado |:lcd| en la ventana actual tempname() obtiene un nombre para un archivo temporal mkdir() crea un nuevo directorio delete() borra un archivo rename() renombra un archivo system() obtiene el resultado de una orden de consola hostname() nombre del sistema readfile() lee un archivo y devuelve una Lista de líneas writefile() escribe una Lista de líneas a un archivo

source: Date and Time: *date-functions* *time-functions* getftime() get last modification time of a file localtime() get current time in seconds strftime() convert time to a string reltime() get the current or elapsed time accurately reltimestr() convert reltime() result to a string
es: Fecha y Hora: *date-functions* *time-functions* getftime() obtiene la hora de la última modificación de un archivo localtime() obtiene la hora actual en segundos strftime() convierte la hora a una cadena reltime() devuelve la hora actual o el tiempo transcurrido desde una hora reltimestr() convierte el resultado de reltime() a una cadena

source: *buffer-functions* *window-functions* *arg-functions* Buffers, windows and the argument list: argc() number of entries in the argument list argidx() current position in the argument list argv() get one entry from the argument list bufexists() check if a buffer exists buflisted() check if a buffer exists and is listed bufloaded() check if a buffer exists and is loaded bufname() get the name of a specific buffer bufnr() get the buffer number of a specific buffer tabpagebuflist() return List of buffers in a tab page tabpagenr() get the number of a tab page tabpagewinnr() like winnr() for a specified tab page winnr() get the window number for the current window bufwinnr() get the window number of a specific buffer winbufnr() get the buffer number of a specific window getbufline() get a list of lines from the specified buffer
es: *buffer-functions* *window-functions* *arg-functions* Búferes, ventanas, y la lista de argumentos: argc() número de entradas en la lista de argumentos argidx() posición actual en la lista de argumentos argv() obtiene un elemento de la lista de argumentos bufexists() comprueba si un búfer existe buflisted() comprueba si un búfer existe y está listado bufloaded() comprueba si un búfer existe y está cargado bufname() obtiene el nombre de un búfer específico bufnr() obtiene el número de búfer de un búfer específico tabpagebuflist() devuelve la Lista de búfers de una pestaña tabpagenr() obtiene el número de una pestaña tabpagewinnr() similar a winnr(), pero especificando la pestaña winnr() obtiene el número de ventana de la ventana actual bufwinnr() obtiene el número de ventana del búfer especificado winbufnr() obtiene el número de búfer de una ventana específica getbufline() obtiene una lista de líneas del búfer especificado

source: Command line: *command-line-functions* getcmdline() get the current command line getcmdpos() get position of the cursor in the command line setcmdpos() set position of the cursor in the command line getcmdtype() return the current command-line type
es: Línea de órdenes: *command-line-functions* getcmdline() obtiene la línea de órdenes actual getcmdpos() obtiene la posición del cursor en la línea de órdenes setcmdpos() cambia la posición del cursor en la línea de órdenes getcmdtype() devuelve el tipo de la línea de órdenes actual

source: Quickfix and location lists: *quickfix-functions* getqflist() list of quickfix errors setqflist() modify a quickfix list getloclist() list of location list items setloclist() modify a location list
es: Listas de corrección rápida y de ubicación: *quickfix-functions* getqflist() obtiene una lista de errores de corrección rápida setqflist() modifica una lista de corrección rápida getloclist() obtiene la lista de elementos de una lista de ubicación setloclist() modifica una lista de ubicación

source: Insert mode completion: *completion-functions* complete() set found matches complete_add() add to found matches complete_check() check if completion should be aborted pumvisible() check if the popup menu is displayed
es: Completado automático en modo Insertar: *completion-functions* complete() define coincidencias encontradas complete_add() añade elementos a la lista de coincidencias encontradas complete_check() comprueba si debería interrumpir el completado pumvisible() comprueba si se está mostrando el menú contextual

source: Folding: *folding-functions* foldclosed() check for a closed fold at a specific line foldclosedend() like foldclosed() but return the last line foldlevel() check for the fold level at a specific line foldtext() generate the line displayed for a closed fold foldtextresult() get the text displayed for a closed fold
es: Plegado: *folding-functions* foldclosed() comprueba si hay un pliegue cerrado en una línea específica foldclosedend() similar a foldclosed() pero devuelve la última línea foldlevel() obtiene el nivel de plegado de la línea especificada foldtext() genera el texto mostrado en un pliegue cerrado foldtextresult() obtiene el texto mostrado en un pliegue cerrado

source: Syntax and highlighting: *syntax-functions* *highlighting-functions* clearmatches() clear all matches defined by |matchadd()| and the |:match| commands getmatches() get all matches defined by |matchadd()| and the |:match| commands hlexists() check if a highlight group exists hlID() get ID of a highlight group synID() get syntax ID at a specific position synIDattr() get a specific attribute of a syntax ID synIDtrans() get translated syntax ID diff_hlID() get highlight ID for diff mode at a position matchadd() define a pattern to highlight (a "match") matcharg() get info about |:match| arguments matchdelete() delete a match defined by |matchadd()| or a |:match| command setmatches() restore a list of matches saved by |getmatches()|
es: Sintaxis y resaltado: *syntax-functions* *highlighting-functions* clearmatches() elimina las coincidencias definidas por |matchadd()| y las órdenes |:match| getmatches() obtiene todas las coincidencias definidas por |matchadd()| y las órdenes |:match| hlexists() comprueba la existencia de un grupo de resaltado hlID() obtiene el ID de un grupo de resaltado synID() obtiene el ID de sintaxis en una posición específica synIDattr() obtiene un atributo específico correspondiente a un ID de sintaxis synIDtrans() obtiene un ID de sintaxis traducido diff_hlID() obtiene el ID de resaltado para el modo diff en una posición dada matchadd() define un patrón a resaltar (una «coincidencia») matcharg() obtiene información acerca de los argumentos para |:match| matchdelete() borra una coincidencia definida por |matchadd()| o una orden |:match| setmatches() restaura una lista de coincidencias guardada por |getmatches()|

source: Spelling: *spell-functions* spellbadword() locate badly spelled word at or after cursor spellsuggest() return suggested spelling corrections soundfold() return the sound-a-like equivalent of a word
es: Corrección ortográfica: *spell-functions* spellbadword() ubica palabras mal escritas a partir de la posición actual del cursor spellsuggest() devuelve las correcciones ortográficas sugeridas soundfold() retorna el homófono de una palabra

source: History: *history-functions* histadd() add an item to a history histdel() delete an item from a history histget() get an item from a history histnr() get highest index of a history list
es: Historia: *history-functions* histadd() añade un elemento a la historia histdel() elimina un elemento a la historia histget() obtiene un elemento a la historia histnr() obtiene el índice más grande de la lista de una historia

source: Interactive: *interactive-functions* browse() put up a file requester browsedir() put up a directory requester confirm() let the user make a choice getchar() get a character from the user getcharmod() get modifiers for the last typed character feedkeys() put characters in the typeahead queue input() get a line from the user inputlist() let the user pick an entry from a list inputsecret() get a line from the user without showing it inputdialog() get a line from the user in a dialog inputsave() save and clear typeahead inputrestore() restore typeahead
es: Interacción: *interactive-functions* browse() despliega un diálogo de selección de archivos browsedir() despliega un diálogo de selección de directorios confirm() solicita al usuario hacer una elección getchar() solicita un carácter al usuario getcharmod() obtiene los modificadores usados en el último carácter digitado feedkeys() inserta caracteres en la cola de inserción input() solicita una línea de texto al usuario inputlist() permite al usuario elegir un elemento de una lista inputsecret() solicita una línea de texto al usuario, sin mostrarla inputdialog() solicita una línea de texto al usuario usando un diálogo inputsave() guarda y limpia el búfer de cola de inserción inputrestore() restaura el búfer de la línea de inserción

source: GUI: *gui-functions* getfontname() get name of current font being used getwinposx() X position of the GUI Vim window getwinposy() Y position of the GUI Vim window
es: Interfaz gráfica: *gui-functions* getfontname() obtiene el nombre del tipo de letra actual getwinposx() posición X de la ventana gráfica de Vim getwinposy() posición Y de la ventana gráfica de Vim

source: Vim server: *server-functions* serverlist() return the list of server names remote_send() send command characters to a Vim server remote_expr() evaluate an expression in a Vim server server2client() send a reply to a client of a Vim server remote_peek() check if there is a reply from a Vim server remote_read() read a reply from a Vim server foreground() move the Vim window to the foreground remote_foreground() move the Vim server window to the foreground
es: Servidor Vim: *server-functions* serverlist() devuelve una lista con nombres de servidores remote_send() envía órdenes (caracteres) a un servidor Vim remote_expr() evalúa una expresión en un servidor Vim server2client() envía una respuesta a un cliente de un servidor Vim remote_peek() comprueba si hay respuestas de un servidor Vim remote_read() lee una respuesta de un servidor Vim foreground() desplaza la ventana de Vim a primer plano remote_foreground() desplaza la ventana de un servidor Vim a primer plano

source: Window size and position: *window-size-functions* winheight() get height of a specific window winwidth() get width of a specific window winrestcmd() return command to restore window sizes winsaveview() get view of current window winrestview() restore saved view of current window
es: Tamaño y posición de ventanas: *window-size-functions* winheight() obtiene la altura de una ventana específica winwidth() obtiene el ancho de una ventana específica winrestcmd() devuelve una orden para restaurar los tamaños de ventana winsaveview() obtiene una vista de la ventana actual winrestview() devuelve una vista almacenada en la ventana actual

source: Various: *various-functions* mode() get current editing mode visualmode() last visual mode used hasmapto() check if a mapping exists mapcheck() check if a matching mapping exists maparg() get rhs of a mapping exists() check if a variable, function, etc. exists has() check if a feature is supported in Vim changenr() return number of most recent change cscope_connection() check if a cscope connection exists did_filetype() check if a FileType autocommand was used eventhandler() check if invoked by an event handler getpid() get process ID of Vim
es: Varios: *various-functions* mode() obtiene el modo de edición actual visualmode() último modo visual usado hasmapto() comprueba la existencia de una macro mapcheck() comprueba la existencia de una macro que coincida con el argumento dado maparg() obtiene el rhs de una macro exists() comprueba si la variable, función, etc., existe has() comprueba si Vim cuenta con la característica dada changenr() devuelve el número correspondiente al cambio más reciente cscope_connection() comprueba si hay una conexión a cscope did_filetype() comprueba si se ha usado una orden automática FileType eventhandler() comprueba si se ha sido invocado desde un manejador de eventos getpid() obtiene el ID de proceso de Vim

source: libcall() call a function in an external library libcallnr() idem, returning a number
es: libcall() llama a una función en una biblioteca externa libcallnr() idéntica, pero devuelve un número en vez de una cadena

source: getreg() get contents of a register getregtype() get type of a register setreg() set contents and type of a register
es: getreg() obtiene el contenido de un registro getregtype() obtiene el tipo de un registro setreg() asigna el tipo y contenido de un registro

source: taglist() get list of matching tags tagfiles() get a list of tags files
es: taglist() obtiene una lista de etiquetas coincidentes tagfiles() obtiene una lista de archivos de etiquetas

source: mzeval() evaluate |MzScheme| expression
es: mzeval() evalúa una expresión |MzScheme|

source: *41.7* Defining a function
es: *41.7* Definición de funciones

source: Vim enables you to define your own functions.
es: Vim permite definir nuevas funciones.

source: The basic function declaration begins as follows: >
es: La definición básica de una función corresponde a lo siguiente: >

source: :function {name}({var1}, {var2}, ...) : {body} :endfunction < Note: Function names must begin with a capital letter.
es: :function {nombre}({var1}, {var2}, ...) : {instrucciones} :endfunction < Nota: Los nombres de funciones deben empezar con una letra mayúscula.

source: Let's define a short function to return the smaller of two numbers.
es: Vamos a definir una función pequeña que retorne el más pequeño de dos números.

source: It starts with this line: >
es: Su definición empieza con esta línea: >

source: This tells Vim that the function is named "Min" and it takes two arguments: "num1" and "num2".
es: Ésta le indica a Vim que la función se llama «Min» y que recibe dos argumentos: «num1» y «num2».

source: The first thing you need to do is to check to see which number is smaller: > : if a:num1 < a:num2
es: El primer paso es comprobar qué número es el más pequeño: > : if a:num1 < a:num2

source: The special prefix "a:" tells Vim that the variable is a function argument.
es: El prefijo especial «a:» le indica a Vim que la variable es un argumento de la función.

source: Let's assign the variable "smaller" the value of the smallest number: >
es: Asignemos ahora a la variable «menor» el valor del menor número: >

source: : if a:num1 < a:num2 : let smaller = a:num1 : else : let smaller = a:num2 : endif
es: : if a:num1 < a:num2 : let menor = a:num1 : else : let menor = a:num2 : endif

source: The variable "smaller" is a local variable.
es: La variable «menor» es una variable local.

source: Variables used inside a function are local unless prefixed by something like "g:", "a:", or "s:".
es: Las variables usadas dentro de una función son locales a menos que tengan un prefijo como «g:», «a:», o «s:».

source: Note: To access a global variable from inside a function you must prepend "g:" to it.
es: Nota: Para usar una variable global dentro de una función debe anteponer «g:» a su nombre.

source: Thus "g:today" inside a function is used for the global variable "today", and "today" is another variable, local to the function.
es: Dentro de una función, «g:hoy» corresponde a la variable global «hoy», y «hoy» es otra variable, local respecto a la función.

source: You now use the ":return" statement to return the smallest number to the user.
es: Ahora usamos la instrucción «:return» para devolver el menor de los dos números al usuario.

source: Finally, you end the function: >
es: Finalmente, terminamos la función: >

source: : return smaller :endfunction
es: : return menor :endfunction

source: :function Min(num1, num2) : if a:num1 < a:num2 : let smaller = a:num1 : else : let smaller = a:num2 : endif : return smaller :endfunction
es: :function Min(num1, num2) : if a:num1 < a:num2 : let menor = a:num1 : else : let menor = a:num2 : endif : return menor :endfunction

source: A user defined function is called in exactly the same way as a built-in function.
es: Las funciones definidas por el usuario se invocan exactamente de la misma forma que las funciones internas.

source: Only the name is different.
es: La única diferencia es el nombre.

source: The Min function can be used like this: >
es: Puede usar la función Min como sigue: >

source: Only now will the function be executed and the lines be interpreted by Vim.
es: Sólo en este momento se ejecutará la función y Vim interpretará las instrucciones que la componen.

source: If there are mistakes, like using an undefined variable or function, you will now get an error message.
es: Si hay errores, como usar una variable o función no definida, se mostrará un mensaje de error.

source: When defining the function these errors are not detected.
es: Al definir una función estos errores no son detectados.

source: The ":call" command can be given a line range.
es: La orden «:call» puede recibir un rango de líneas.

source: This can have one of two meanings.
es: Este rango puede tener dos significados.

source: When a function has been defined with the "range" keyword, it will take care of the line range itself.
es: Cuando la definición de una función tiene la palabra clave «range», ésta se hará cargo del rango de líneas.

source: The function will be passed the variables "a:firstline" and "a:lastline".
es: La función recibirá las variables «a:firstline» y «a:lastline».

source: These will have the line numbers from the range the function was called with.
es: Éstas contendrán los números de línea del rango con el cual se invoca la función.
