Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: :function Count_words() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "found " . n .
es: :function Contar_palabras() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "encontradas " . n .

source: " words" :endfunction
es: " palabras" :endfunction

source: :10,30call Count_words()
es: :10,30call Contar_palabras()

source: It will be executed once and echo the number of words.
es: La función se ejecutará una vez, y mostrará en la pantalla el número de palabras.

source: The other way to use a line range is by defining a function without the "range" keyword.
es: La otra forma de usar un rango de líneas es definiendo una función sin la palabra clave «range».

source: The function will be called once for every line in the range, with the cursor in that line.
es: Se invocará la función una vez por cada línea en el rango, y el cursor estará en la línea correspondiente a cada invocación.

source: :function Number() : echo "line " . line(".") .
es: :function Numero() : echo "la línea " . line(".") .

source: " contains: " . getline(".") :endfunction
es: " contiene: " . getline(".") :endfunction

source: :10,15call Number()
es: :10,15call Numero()

source: Vim enables you to define functions that have a variable number of arguments.
es: Vim permite la definición de funciones que reciben una cantidad variable de argumentos.

source: The following command, for instance, defines a function that must have 1 argument (start) and can have up to 20 additional arguments: >
es: Por ejemplo, la siguiente orden define una función que debe recibir un argumento (inicio) y puede recibir hasta 20 argumentos adicionales: >

source: :function Show(start, ...)
es: :function Mostrar(inicio, ...)

source: The variable "a:1" contains the first optional argument, "a:2" the second, and so on.
es: La variable «a:1» contiene el primer argumento opcional, «a:2» contiene el segundo, y así sucesivamente.

source: The variable "a:0" contains the number of extra arguments.
es: La variable «a:0» contiene la cantidad de argumentos adicionales.

source: :function Show(start, ...) : echohl Title : echo "Show is " . a:start : echohl None : let index = 1 : while index <= a:0 : echo " Arg " . index .
es: :function Mostrar(inicio, ...) : echohl Title : echo "inicio es " . a:inicio : echohl None : let indice = 1 : while indice <= a:0 : echo " Arg " . indice .

source: " is " . a:{index} : let index = index + 1 : endwhile : echo "" :endfunction
es: " is " . a:{indice} : let indice = indice + 1 : endwhile : echo "" :endfunction

source: This uses the ":echohl" command to specify the highlighting used for the following ":echo" command.
es: Aquí se usa la orden «:echohl», que especifica el resaltado a usar en la siguiente orden «:echo».

source: ":echohl None" stops it again.
es: «:echohl None» hace que no se use resaltado alguno.

source: The ":echon" command works like ":echo", but doesn't output a line break.
es: La orden «:echon» es similar a «:echo» pero no imprime el cambio de línea final.

source: :function < function Show(start, ...) ~ function GetVimIndent() ~ function SetSyn(name) ~
es: :function < function Mostrar(inicio, ...) ~ function ObtenerSangradoVim() ~ function DefinirSintaxis(nombre) ~

source: :function SetSyn < 1 if &syntax == '' ~ 2 let &syntax = a:name ~ 3 endif ~ endfunction ~
es: :function DefinirSintaxis < 1 if &syntax == '' ~ 2 let &syntax = a:nombre ~ 3 endif ~ endfunction ~

source: The line number is useful for when you get an error message or when debugging.
es: El número de línea de una instrucción es información útil cuando aparece un mensaje de error o al depurar scripts.

source: See |debug-scripts| about debugging mode.
es: Acerca del modo de depurado, consulte |debug-scripts|.

source: You can also set the 'verbose' option to 12 or higher to see all function calls.
es: Puede darle un valor de 12 o más a la opción 'verbose' para ver todas las invocaciones a funciones.

source: Set it to 15 or higher to see every executed line.
es: Con un valor de 15 o más verá cada línea ejecutada.

source: :delfunction Show
es: :delfunction Mostrar

source: Sometimes it can be useful to have a variable point to one function or another.
es: En ocasiones es útil que una variable pueda hacer referencia a una u otra función .

source: You can do it with the function() function.
es: Puede hacerlo usando la función function().

source: It turns the name of a function into a reference: >
es: Ésta función convierte el nombre de una función en una referencia a la misma: >

source: :let result = 0 " or 1 :function!
es: :let resultado = 0 " o 1 :function!

source: Right() : return 'Right!' :endfunc :function!
es: Bien() : return '¡Bien!' :endfunc :function!

source: Wrong() : return 'Wrong!' :endfunc : :if result == 1 : let Afunc = function('Right') :else : let Afunc = function('Wrong') :endif :echo call(Afunc, []) < Wrong!
es: Mal() : return '¡Mal!' :endfunc : :if resultado == 1 : let Unafunc = function('Bien') :else : let Unafunc = function('Mal') :endif :echo call(Unafunc, []) < ¡Mal!

source: Note that the name of a variable that holds a function reference must start with a capital.
es: Tenga en cuenta que el nombre de la variable que contiene la referencia a la función debe empezar con una letra mayúscula.

source: Otherwise it could be confused with the name of a builtin function.
es: En caso contrario, es posible que se confunda con el nombre de una de las funciones integradas de Vim.

source: The way to invoke a function that a variable refers to is with the call() function.
es: Para invocar una función usando una variable con una referencia a función se usa la función call().

source: Its first argument is the function reference, the second argument is a List with arguments.
es: Como primer argumento recibe la referencia a la función, y como segundo argumento una Lista con los argumentos para la función a invocar.

source: *41.8* Lists and Dictionaries
es: *41.8* Listas y Diccionarios

source: So far we have used the basic types String and Number.
es: Hasta ahora hemos usado los tipos básicos, Cadena de texto y Número.

source: Vim also supports two composite types: List and Dictionary.
es: Vim también ofrece otros dos: Lista y Diccionario.

source: A List is an ordered sequence of things.
es: Una Lista es una secuencia ordenada de elementos.

source: The things can be any kind of value, thus you can make a List of numbers, a List of Lists and even a List of mixed items.
es: Los elementos pueden ser de cualquier tipo, así que puede crear una Lista de números, una Lista de Listas e incluso una Lista de elementos de tipos diferentes.

source: To create a List with three strings: >
es: Para crear una Lista con tres cadenas de texto: >

source: :let alist = ['aap', 'mies', 'noot']
es: :let lista = ['aap', 'mies', 'noot']

source: The List items are enclosed in square brackets and separated by commas.
es: Los elementos de la Lista se rodean con corchetes y se separan con comas.

source: To create an empty List: >
es: Para crear una Lista vacía: >

source: :let alist = []
es: :let lista = []

source: :let alist = [] :call add(alist, 'foo') :call add(alist, 'bar') :echo alist < ['foo', 'bar'] ~
es: :let lista = [] :call add(lista, 'foo') :call add(lista, 'bar') :echo lista < ['foo', 'bar'] ~

source: :echo alist + ['foo', 'bar'] < ['foo', 'bar', 'foo', 'bar'] ~
es: :echo lista + ['foo', 'bar'] < ['foo', 'bar', 'foo', 'bar'] ~

source: :let alist = ['one'] :call extend(alist, ['two', 'three']) :echo alist < ['one', 'two', 'three'] ~
es: :let lista = ['uno'] :call extend(lista, ['dos', 'tres']) :echo lista < ['uno', 'dos', 'tres'] ~

source: :let alist = ['one'] :call add(alist, ['two', 'three']) :echo alist < ['one', ['two', 'three']] ~
es: :let lista = ['uno'] :call add(lista, ['dos', 'tres']) :echo lista < ['uno', ['dos', 'tres']] ~

source: :let alist = ['one', 'two', 'three'] :for n in alist : echo n :endfor < one ~ two ~ three ~
es: :let lista = ['uno', 'dos', 'tres'] :for n in lista : echo n :endfor < uno ~ dos ~ tres ~

source: This will loop over each element in List "alist", assigning the value to variable "n".
es: El código mostrado iterará sobre cada elemento en la Lista «lista», asignando el valor del elemento a la variable «n».

source: The generic form of a for loop is: >
es: La forma genérica de un ciclo «for» es: >

source: :for {varname} in {listexpression} : {commands} :endfor
es: :for {nombrevar} in {expresiónlista} : {instrucciones} :endfor

source: To loop a certain number of times you need a List of a specific length.
es: Para iterar una cantidad determinada de veces necesita una Lista con una longitud específica.

source: The range() function creates one for you: >
es: La función range() puede crearla por usted: >

source: Notice that the first item of the List that range() produces is zero, thus the last item is one less than the length of the list.
es: Observe que el primer elemento de la Lista creada por range() es cero, y por tanto el último elemento tiene un valor de uno menos que la longitud de la lista.

source: You can also specify the maximum value, the stride and even go backwards: >
es: También puede especificar el valor máximo, y el incremento o decremento deseado: >

source: :for line in getline(1, 20) : if line =~ "Date: " : echo matchstr(line, 'Date: \zs.*') : endif :endfor
es: :for line in getline(1, 20) : if line =~ "Fecha: " : echo matchstr(line, 'Fecha: \zs.*') : endif :endfor

source: A Dictionary stores key-value pairs.
es: Un Diccionario almacena pares clave-valor.

source: You can quickly lookup a value if you know the key.
es: Esto le permite obtener un valor almacenado de manera rápida, si conoce la clave del mismo.

source: A Dictionary is created with curly braces: >
es: Los Diccionarios se crean usando llaves: >

source: :let uk2nl = {'one': 'een', 'two': 'twee', 'three': 'drie'}
es: :let es2nl = {'uno': 'een', 'dos': 'twee', 'tres': 'drie'}

source: :echo uk2nl['two'] < twee ~
es: :echo es2nl['dos'] < twee ~

source: {<key> : <value>, ...}
es: {<clave> : <valor>, ...}

source: The possibilities with Dictionaries are numerous.
es: Los Diccionarios ofrecen numerosas posibilidades.

source: There are various functions for them as well.
es: También dispone de varias funciones para operar sobre ellos.

source: For example, you can obtain a list of the keys and loop over them: >
es: Por ejemplo, puede obtener una lista de las claves e iterar sobre ellas: >

source: :for key in keys(uk2nl) : echo key :endfor < three ~ one ~ two ~
es: :for clave in keys(es2nl) : echo clave :endfor < tres ~ uno ~ dos ~

source: You will notice the keys are not ordered.
es: Habrá notado que las claves no están ordenadas.

source: You can sort the list to get a specific order: >
es: Puede ordenar la lista para obtener un orden específico: >

source: :for key in sort(keys(uk2nl)) : echo key :endfor < one ~ three ~ two ~
es: :for clave in sort(keys(es2nl)) : echo clave :endfor < dos ~ tres ~ uno ~

source: But you can never get back the order in which items are defined.
es: No es posible recuperar el orden en el cual se definieron los elementos del Diccionario.

source: For that you need to use a List, it stores items in an ordered sequence.
es: Para eso necesita una Lista, que almacena los elementos en una secuencia ordenada.

source: :echo uk2nl['one'] < een ~
es: :echo es2nl['uno'] < een ~

source: :echo uk2nl.one < een ~
es: :echo es2nl.uno < een ~

source: This only works for a key that is made of ASCII letters, digits and the underscore.
es: Esto sólo funciona con claves compuestas de caracteres ASCII, dígitos, y el guión bajo.

source: You can also assign a new value this way: >
es: También puede usar esta notación para asignar valores: >

source: :let uk2nl.four = 'vier' :echo uk2nl < {'three': 'drie', 'four': 'vier', 'one': 'een', 'two': 'twee'} ~
es: :let es2nl.cuatro = 'vier' :echo es2nl < {'tres': 'drie', 'cuatro': 'vier', 'uno': 'een', 'dos': 'twee'} ~

source: :function uk2nl.translate(line) dict : return join(map(split(a:line), 'get(self, v:val, "???")')) :endfunction
es: :function es2nl.traducir(linea) dict : return join(map(split(a:linea), 'get(self, v:val, "???")')) :endfunction

source: :echo uk2nl.translate('three two five one') < drie twee ??? een ~
es: :echo es2nl.traducir('tres dos cinco uno') < drie twee ??? een ~

source: The first special thing you notice is the "dict" at the end of the ":function" line.
es: Lo que habrá notado primero es el «dict» al final de la línea «:function».

source: This marks the function as being used from a Dictionary.
es: Así se indica que la función será usada desde un Diccionario.

source: The "self" local variable will then refer to that Dictionary.
es: La variable local «self» se referirá a dicho diccionario.

source: Now let's break up the complicated return command: >
es: Ahora, dividamos esa compleja instrucción de retorno: >

source: split(a:line)
es: split(a:linea)

source: The split() function takes a string, chops it into white separated words and returns a list with these words.
es: La función split() toma una cadena, la divide en palabras separadas por espacios en blanco, y entrega una lista con estas palabras.

source: Thus in the example it returns: >
es: En el ejemplo previo, entrega: >

source: :echo split('three two five one') < ['three', 'two', 'five', 'one'] ~
es: :echo split('tres dos cinco uno') < ['tres', 'dos', 'cinco', 'uno'] ~

source: This list is the first argument to the map() function.
es: Esta lista es el primer argumento para la función map().

source: This will go through the list, evaluating its second argument with "v:val" set to the value of each item.
es: Dicha función analizará la lista, evaluando su segundo argumento con la variable «v:val» definida con el valor de cada elemento en la lista.

source: This is a shortcut to using a for loop.
es: Es una abreviación de un ciclo for.

source: This command: >
es: Esta instrucción: >

source: :let alist = map(split(a:line), 'get(self, v:val, "???")')
es: :let lista = map(split(a:linea), 'get(self, v:val, "???")')

source: :let alist = split(a:line) :for idx in range(len(alist)) : let alist[idx] = get(self, alist[idx], "???") :endfor
es: :let lista = split(a:linea) :for ind in range(len(lista)) : let lista[ind] = get(self, lista[ind], "???") :endfor

source: The get() function checks if a key is present in a Dictionary.
es: La función get() comprueba si una clave existe en un Diccionario.

source: If it is, then the value is retrieved.
es: Si existe, devuelve el valor asociado a la clave.

source: If it isn't, then the default value is returned, in the example it's '???'.
es: Si no existe, devuelve el valor definido como predeterminado, que en el ejemplo es '???'.

source: This is a convenient way to handle situations where a key may not be present and you don't want an error message.
es: Esto permite manejar de una forma conveniente las situaciones en que una clave no existe y no desea hacer el manejo del error que provocaría dicha situación.

source: The join() function does the opposite of split(): it joins together a list of words, putting a space in between.
es: La función join() es el complemento de split(): une una lista de palabras, separándolas con un espacio.

source: This combination of split(), map() and join() is a nice way to filter a line of words in a very compact way.
es: La combinación de split(), map(), y join() es una forma elegante de filtrar una cadena de palabras de manera sucinta.

source: Now that you can put both values and functions in a Dictionary, you can actually use a Dictionary like an object.
es: Ahora que podemos guardar valores y funciones en un Diccionario, podemos usar un Diccionario como un objeto.

source: Above we used a Dictionary for translating Dutch to English.
es: Anteriormente hicimos uso de un Diccionario para traducir texto de Holandés a Español.

source: We might want to do the same for other languages.
es: Querríamos hacer lo mismo para otros idiomas.

source: Let's first make an object (aka Dictionary) that has the translate function, but no words to translate: >
es: Primero crearemos un objeto (esto es, un Diccionario) que tenga la función traducir, pero no tenga palabras para traducir: >

source: :let transdict = {} :function transdict.translate(line) dict : return join(map(split(a:line), 'get(self.words, v:val, "???")')) :endfunction
es: :let dicctraductor = {} :function dicctraductor.traducir(linea) dict : return join(map(split(a:linea), \ 'get(self.palabras, v:val, "???")')) :endfunction

source: It's slightly different from the function above, using 'self.words' to lookup word translations.
es: La definición es ligeramente diferente de la función anterior, ya que usa 'self.words' para buscar las traducciones de palabras.

source: But we don't have a self.words.
es: Pero no hay un self.words.

source: Thus you could call this an abstract class.
es: Por esto decir que el Diccionario es una clase abstracta.

source: :let uk2nl = copy(transdict) :let uk2nl.words = {'one': 'een', 'two': 'twee', 'three': 'drie'} :echo uk2nl.translate('three one') < drie een ~
es: :let es2nl = copy(dicctraductor) :let es2nl.words = {'uno': 'een', 'dos': 'twee', 'tres': 'drie'} :echo es2nl.translate('tres uno') < drie een ~

source: :let uk2de = copy(transdict) :let uk2de.words = {'one': 'ein', 'two': 'zwei', 'three': 'drei'} :echo uk2de.translate('three one') < drei ein ~
es: :let es2de = copy(dicctraductor) :let es2de.words = {'uno': 'ein', 'dos': 'zwei', 'tres': 'drei'} :echo es2de.translate('tres uno') < drei ein ~

source: You see that the copy() function is used to make a copy of the "transdict" Dictionary and then the copy is changed to add the words.
es: Puede ver que la función copy() se usa para crear una copia del Diccionario «dicctraductor» y luego se cambia la copia, añadiendo las palabras.

source: The original remains the same, of course.
es: El original, por supuesto, permanece intacto.

source: :if $LANG =~ "de" : let trans = uk2de :else : let trans = uk2nl :endif :echo trans.translate('one two three') < een twee drie ~
es: :if $LANG =~ "de" : let trad = es2de :else : let trad = es2nl :endif :echo trad.traducir('uno dos tres') < een twee drie ~

source: Here "trans" refers to one of the two objects (Dictionaries).
es: Aquí «trad» se refiere a uno de dos posibles objetos (Diccionarios).

source: No copy is made.
es: No se hace ninguna copia.

source: More about List and Dictionary identity can be found at |list-identity| and |dict-identity|.
es: Puede encontrar más información acerca de la identidad de Listas y Diccionarios en |list-identity| y |dict-identity|.

source: Now you might use a language that isn't supported.
es: Puede que use un idioma que aún no esté incluido.

source: You can overrule the translate() function to do nothing: >
es: Para este caso, puede redefinir la función traducir() para que no haga nada: >

source: :let uk2uk = copy(transdict) :function! uk2uk.translate(line) : return a:line :endfunction :echo uk2uk.translate('three one wladiwostok') < three one wladiwostok ~
es: :let es2es = copy(dicctraductor) :function! es2es.traducir(linea) : return a:linea :endfunction :echo es2es.traducir('tres one wladiwostok') < tres uno wladiwostok ~

source: Notice that a ! was used to overwrite the existing function reference.
es: Note el «!» utilizado para redefinir la referencia a función existente.

source: Now use "uk2uk" when no recognized language is found: >
es: Ahora puede usar «es2es» cuando no se encuentra ningún idioma reconocido: >

source: :if $LANG =~ "de" : let trans = uk2de :elseif $LANG =~ "nl" : let trans = uk2nl :else : let trans = uk2uk :endif :echo trans.translate('one two three') < one two three ~
es: :if $LANG =~ "de" : let trad = es2de :elseif $LANG =~ "nl" : let trad = es2nl :else : let trad = es2es :endif :echo trad.traducir('uno dos tres') < uno dos tres ~

source: *41.9* Exceptions
es: *41.9* Excepciones

source: :try : read ~/templates/pascal.tmpl :catch /E484:/ : echo "Sorry, the Pascal template file cannot be found." :endtry
es: :try : read ~/plantillas/pascal.tmpl :catch /E484:/ : echo «Lo siento, no encuentro el archivo plantilla para Pascal.» :endtry

source: The ":read" command will fail if the file does not exist.
es: La orden «:read» (leer) fallará si el archivo no existe.

source: Instead of generating an error message, this code catches the error and gives the user a nice message instead.
es: En vez de mostrar un mensaje de error, este código atrapa el error y le muestra al usuario un mensaje más agradable.

source: For the commands in between ":try" and ":endtry" errors are turned into exceptions.
es: Para las instrucciones entre «:try» y «:endtry» los errores se convierten en excepciones.

source: An exception is a string.
es: Una excepción es una cadena de texto.

source: In the case of an error the string contains the error message.
es: Cuando aparece un error esta cadena contiene el mensaje de error.

source: And every error message has a number.
es: Y cada mensaje de error tiene un número.

source: In this case, the error we catch contains "E484:".
es: En este caso, el error que atrapamos contiene «E484:».

source: This number is guaranteed to stay the same (the text may change, e.g., it may be translated).
es: Vim garantiza que este número permanece inalterado (el texto del mensaje de error puede cambiar, por ejemplo, puede haber sido traducido.)

source: When the ":read" command causes another error, the pattern "E484:" will not match in it.
es: Cuando la orden «:read» genera un error distinto, el patrón «E484:» no coincidirá con él.

source: Thus this exception will not be caught and result in the usual error message.
es: La excepción no será atrapada y aparecerá el mensaje de error habitual en esos casos.

source: :try : read ~/templates/pascal.tmpl :catch : echo "Sorry, the Pascal template file cannot be found." :endtry
es: :try : read ~/plantillas/pascal.tmpl :catch : echo «Lo siento, no encuentro el archivo plantilla para Pascal.» :endtry

source: This means all errors are caught.
es: De esta forma se atrapan todos los errores.

source: But then you will not see errors that are useful, such as "E21: Cannot make changes, 'modifiable' is off".
es: Pero al hacerlo no verá errores que son útiles, como por ejemplo «E21: No se pudo modificar, 'modifiable' está desactivado»

source: This filters the lines from the cursor until the end of the file through the "filter" command, which takes a file name argument.
es: Aquí se filtran las líneas desde el cursor hasta el final del archivo usando la orden «filter», que toma como argumento un nombre de archivo.

source: No matter if the filtering works, something goes wrong in between ":try" and ":finally" or the user cancels the filtering by pressing CTRL-C, the "call delete(tmp)" is always executed.
es: No importa si el filtrado funciona, si algo sale mal entre «:try» y «:finally», o si el usuario cancela el filtrado presionando CTRL-C, la instrucción «call delete(tmp)» siempre se ejecuta.

source: This makes sure you don't leave the temporary file behind.
es: Así se asegura de que no queden archivos temporales al acabar el proceso.

source: *41.10* Various remarks
es: *41.10* Observaciones

source: Here is a summary of items that apply to Vim scripts.
es: A continuación tiene un resumen de los elementos relevantes para escribir scripts de Vim.

source: They are also mentioned elsewhere, but form a nice checklist.
es: También se los menciona en otros lugares de la documentación, pero aquí se presentan como una conveniente lista.
