Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Make it at least 40 characters wide to be able to read most messages on the last line.
es: Haga que tenga, por lo menos, un ancho de 40 columnas para poder leer la mayoría de mensajes en la última línea.

source: On most Unix systems, resizing the window is recognized and handled correctly by Vim.
es: En la mayoría de sistemas Unix Vim trata adecuadamente redimensionar las ventanas.

source: {Vi: not ok}
es: {Vi: no tan bien.}

source: Definitions *definitions*
es: Definiciones *definiciones* *definitions*

source: screen The whole area that Vim uses to work in.
es: pantalla El área completa que usa Vim.

source: This can be a terminal emulator window.
es: Puede ser la ventana de un emulador de terminal.

source: Also called "the Vim window".
es: También llamada la «ventana de Vim».

source: window A view on a buffer.
es: ventana El área de visión de un búfer.

source: +-------------------------------+ screen | window 1 | window 2 | | | | | | | |= status line =|= status line =| | window 3 | | | | | |==== status line ==============| |command line | +-------------------------------+
es: +-------------------------------+ pantalla| ventana 1 | ventana 2 | | | | | | | |línea de estado|línea de estado| | ventana 3 | | | | | |==== línea de estado ==========| |línea de órdenes | +-------------------------------+

source: The command line is also used for messages.
es: La línea de órdenes se usa también para mensajes.

source: It scrolls up the screen when there is not enough room in the command line.
es: Desplaza la pantalla hacia arriba cuando no hay suficiente espacio para la línea de órdenes.

source: buffer lines logical lines window lines screen lines ~
es: líneas de búfer líneas lógicas líneas de ventana líneas de pantalla ~

source: 1. one 1. one 1.
es: 1. uno 1. uno 1.

source: +-- folded 1.
es: +-- plegado 1.

source: +-- folded 2. two 2.
es: +-- plegado 2. dos 2.

source: +-- folded 2. five 2.
es: +-- plegado 2. cinco 2.

source: five 3. three 3. five 3. six 3.
es: cinco 3. tres 3. cinco 3. seis 3.

source: six 4. four 4. six 4. seven 4.
es: seis 4. cuatro 4. seis 4. siete 4.

source: seven 5. five 5. seven 5.
es: siete 5. cinco 5. siete 5.

source: === status line === 6. six 6.
es: === línea de estado === 6. seis 6.

source: aaa 7. seven 7.
es: aaa 7. siete 7.

source: === status line === 5. ddd 13.
es: === línea de estado === 5. ddd 13.

source: (command line) 6.
es: (línea de órdenes) 6.

source: *usr_21.txt* For Vim version 7.3.
es: *usr_21.esx* Para Vim version 7.3.

source: Last change: 2008 Nov 09
es: Último cambio: 9/11/2008

source: Go away and come back
es: Abandonar el editor y volver

source: |21.1| Suspend and resume |21.2| Executing shell commands |21.3| Remembering information; viminfo |21.4| Sessions |21.5| Views |21.6| Modelines
es: |21.1| Suspender y continuar |21.2| Ejecutar órdenes de consola |21.3| Recordar información; viminfo |21.4| Sesiones |21.5| Vistas |21.6| «Modelines»

source: Next chapter: |usr_22.txt| Finding the file to edit Previous chapter: |usr_20.txt| Typing command-line commands quickly Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_22.esx| Encontrar el archivo a editar Capítulo anterior: |usr_20.esx| Teclear con rapidez órdenes de consola Tabla de contenidos: |usr_toc.esx|

source: *21.1* Suspend and resume
es: *21.1* Suspender y continuar

source: CTRL-Z {any sequence of shell commands} fg
es: CTRL-Z {cualquier secuencia de órdenes de consola} fg

source: Only Unix has support for this.
es: Solo Unix es compatible con esta función.

source: On other systems Vim will start a shell for you.
es: Vim iniciará una consola en otros sistemas.

source: This also has the functionality of being able to execute shell commands.
es: Esto también tiene la funcionalidad de permitirle ejecutar órdenes de consola.

source: But it's a new shell, not the one that you started Vim from.
es: Pero esta es una nueva consola, no desde la que inició Vim.

source: When you are running the GUI you can't go back to the shell where Vim was started.
es: Cuando está ejecutando la interfaz gráfica no puede volver a la consola desde la que se inició Vim.

source: CTRL-Z will minimize the Vim window instead.
es: En esta situación, CTRL-Z minimizará la ventana de Vim.

source: *21.2* Executing shell commands
es: *21.2* Ejecutar órdenes de consola

source: To execute a single shell command from Vim use ":!{command}".
es: Use «:!{orden}» para ejecutar una sola orden de consola desde Vim.

source: For example, to see a directory listing: >
es: Por ejemplo, para ver el listado de un directorio: >

source: The first one is for Unix, the second one for MS-Windows.
es: El primero es para Unix, el segundo para MS-Windows.

source: Vim will execute the program.
es: Vim ejecutará el programa.

source: When it ends you will get a prompt to hit <Enter>.
es: Cuando finalice, obtendrá un dialogo para pulsar <Intro>.

source: This allows you to have a look at the output from the command before returning to the text you were editing.
es: Esto le permite ver la salida de la orden antes de volver al texto que estaba editando.

source: The "!" is also used in other places where a program is run.
es: El signo «!» también se usa en otros sitios cuando se ejecuta un programa.

source: Let's take a look at an overview:
es: Veamos com funciona esto de una manera general.

source: :!{program} execute {program} :r !{program} execute {program} and read its output :w !{program} execute {program} and send text to its input :[range]!{program} filter text through {program}
es: :!{programa} execute {programa} :r !{programa} execute {programa} y lea su salida :w !{programa} execute {programa} y envíe texto a su entrada :[range]!{programa} filtra texto a través de {programa}

source: Notice that the presence of a range before "!{program}" makes a big difference.
es: Nótese que la presencia de un rango antes de «!{programa}» marca una gran diferencia.

source: Without it executes the program normally, with the range a number of text lines is filtered through the program.
es: Sin él, ejecuta el programa de manera normal, con el rango se filtran un número de líneas a través del programa.

source: Executing a whole row of programs this way is possible.
es: Es imposible ejecutar una fila de programas de esta manera.

source: But a shell is much better at it.
es: Pero una consola es mejor para estas funciones.

source: You can start a new shell this way: >
es: Puede iniciar una nueva consola de la siguiente manera: >

source: This is similar to using CTRL-Z to suspend Vim.
es: Esto es parecido al uso de «CTRL-Z» para suspender Vim.

source: The difference is that a new shell is started.
es: La diferencia es que se inicia una nueva consola.

source: When using the GUI the shell will be using the Vim window for its input and output.
es: Al usar la GUI, la consola usará la ventana de Vim para entrada y salida.

source: Since Vim is not a terminal emulator, this will not work perfectly.
es: Ya que Vim no es una terminal, esto no funcionará perfectamente.

source: If you have trouble, try toggling the 'guipty' option.
es: Si tiene un problema, pruebe a conmutar la opción 'guipty'.

source: If this still doesn't work well enough, start a new terminal to run the shell in.
es: Si esto tampoco funciona, inicie una nueva terminal para iniciar el intérprete de órdenes.

source: For example with: > :!xterm&
es: Por ejemplo, con: > :!xterm&

source: *21.3* Remembering information; viminfo
es: *21.3* Recordar información; viminfo

source: Command-line and Search pattern history Text in registers Marks for various files The buffer list Global variables
es: Histórico de la línea de órdenes y patrones de búsqueda Texto en registros Marcas para varios archivos La lista de búfers Variables globales

source: Each time you exit Vim it will store this information in a file, the viminfo file.
es: Cada vez que cierre Vim, este guardará esta información en un archivo, el archivo viminfo.

source: When Vim starts again, the viminfo file is read and the information restored.
es: Cuando inicie Vim otra vez, leerá el archivo viminfo y restaurará la información.

source: The 'viminfo' option is set by default to restore a limited number of items.
es: La opción 'viminfo' esta configurada por omisión para almacenar un limitado número de elementos.

source: You might want to set it to remember more information.
es: Puede que desee configurarlo para que recuerde más información.

source: This is done through the following command: >
es: Esto se hace con la siguiente orden: >

source: The f option controls whether global marks (A-Z and 0-9) are stored.
es: La opción «f» controla si se guardan las marcas globales (A-Z y 0-9).

source: If this option is 0, none are stored.
es: Si esta opción es 0, no se guarda nada.

source: If it is 1 or you do not specify an f option, the marks are stored.
es: Si es 1 o no especificó una opción «f», las marcas se guardan.

source: You want this feature, so now you have this: >
es: Desea esta función, y por ello ahora obtiene esto: >

source: The < option controls how many lines are saved for each of the registers.
es: La opción «<» define el número de líneas a guardar por cada registro.

source: By default, all the lines are saved.
es: Por omisión, todas las líneas se guardan.

source: If 0, nothing is saved.
es: Si es 0, nada se guarda.

source: To avoid adding thousands of lines to your viminfo file (which might never get used and makes starting Vim slower) you use a maximum of 500 lines: >
es: Para evitar que se añadan miles de líneas a su archivo viminfo (que puede que nunca se usen, y ralenticen el arranque de Vim) puede usar un máximo de 500 líneas: >

source: :set viminfo='1000,f1,<500 < Other options you might want to use: : number of lines to save from the command line history @ number of lines to save from the input line history / number of lines to save from the search history r removable media, for which no marks will be stored (can be used several times) ! global variables that start with an uppercase letter and don't contain lowercase letters h disable 'hlsearch' highlighting when starting % the buffer list (only restored when starting Vim without file arguments) c convert the text using 'encoding' n name used for the viminfo file (must be the last option)
es: :set viminfo='1000,f1,<500 < Otras opciones que puede que desee usar: : número de líneas a guardar del historial de la línea de órdenes @ número de líneas a guardar de la línea de entrada del historial / número de líneas a guardar del historial de búsquedas r dispositivos extraíbles, del cual no se guardan marcas (se puede introducir varias veces) ! variables globales que comienzan con mayúscula y que no contienen minúsculas h desactivar el resaltado de 'hlsearch' al inicio % la lista de búfers (solo se restaura si inicia Vim sin argumentos de archivo) c convertir el texto usando 'encoding' n nombre usado para el archivo viminfo (tiene que ser la última opción)

source: If you want to go back to a file that you edited recently, but not when exiting Vim, there is a slightly more complicated way.
es: Si desea volver a un archivo que editó recientemente, pero no al cerrar Vim, hay una manera un tanto más complicada.

source: You can see a list of files by typing the command: >
es: Puede ver una lista de archivos tecleando la orden: >

source: Now you would like to edit the second file, which is in the list preceded by "2:".
es: Ahora le gustaría editar el segundo archivo, que está en la lista precedido por «2:».

source: You type: >
es: Teclee: >

source: Instead of ":e" you can use any command that has a file name argument, the "#<2" item works in the same place as "%" (current file name) and "#" (alternate file name).
es: En lugar de «:e», puede usar cualquier orden que tiene un nombre de archivo como argumento, el elemento «#<2» funciona en el mismo lugar que «%» (nombre del archivo actual) y «#» (nombre de archivo alterno).

source: So you can also split the window to edit the third file: >
es: Puede también dividir la ventana para editar el tercer archivo: >

source: That #<123 thing is a bit complicated when you just want to edit a file.
es: Usar #<123 es poco complicado cuando solo quiere editar un archivo.

source: Fortunately there is a simpler way: >
es: Afortunadamente, hay una manera más simple: >

source: :browse oldfiles < 1: ~/.viminfo ~ 2: ~/text/resume.txt ~ 3: /tmp/draft ~ -- More --
es: :browse oldfiles < 1: ~/.viminfo ~ 2: ~/text/resume.txt ~ 3: /tmp/draft ~ -- Más --

source: You get the same list of files as with |:oldfiles|.
es: Obtendrá la misma lista de archivos que con |:oldfiles|.

source: If you want to edit "resume.txt" first press "q" to stop the listing.
es: Si desea editar «resume.txt», pulse primero «q» para detener el listado.

source: You will get a prompt:
es: Obtendrá un dialogo:

source: Type number and <Enter> (empty cancels): ~
es: Teclee el número y pulse <Intro> (vaciar cancelaciones): ~

source: You can use the ":wviminfo" and ":rviminfo" commands to save and restore the information while still running Vim.
es: Puede emplear las órdenes «:wviminfo» y «:rviminfo» para guardar y restaurar la información mientras Vim se está ejecutando.

source: This is useful for exchanging register contents between two instances of Vim, for example.
es: Ésto es útil para intercambiar los contenidos del registro de dos instancias de Vim, por ejemplo.

source: In the first Vim do: >
es: En el primer Vim, haga: >

source: Obviously, the "w" stands for "write" and the "r" for "read".
es: Obviamente, «w» significa «write», y «r», «read».

source: The ! character is used by ":wviminfo" to forcefully overwrite an existing file.
es: El caracter «!» se usa por «:wviminfo» para forzar la sobreescritura de un archivo existente.

source: When it is omitted, and the file exists, the information is merged into the file.
es: Cuando se omite, y el archivo existe, la información es fusionada en el archivo.

source: The ! character used for ":rviminfo" means that all the information is used, this may overwrite existing information.
es: El caracter «!» usado por «:rviminfo» significa que se usa toda la información, y esto puede sobreescribir información ya presente.

source: Without the ! only information that wasn't set is used.
es: Sin «!» sólo se usa la información que no estaba definida.

source: These commands can also be used to store info and use it again later.
es: Estas órdenes se pueden usar también para guardar info y usarlo más tarde.

source: You could make a directory full of viminfo files, each containing info for a different purpose.
es: Puede crear un directorio lleno de archivos «viminfo», cada uno con info dependiendo del propósito.

source: *21.4* Sessions
es: *21.4* Sesiones

source: This tells Vim to read a specific file on startup.
es: Esto le dice a Vim que lea un archivo en particular al inicio.

source: The 'S' stands for session (actually, you can source any Vim script with -S, thus it might as well stand for "source").
es: La «S» significa sesión (en realidad, puede introducir cualquier script a Vim con «-S», por ello también puede significar «source», fuente).

source: The windows that were open are restored, with the same position and size as before.
es: Las ventanas que estaban abiertas se restauran, con la misma posición y tamaño que antes.

source: Mappings and option values are like before.
es: Las macros y valores de opciones son también las mismas.

source: What exactly is restored depends on the 'sessionoptions' option.
es: Lo que se restaura exactamente depende de la opción 'sessionoptions'.

source: The default value is "blank,buffers,curdir,folds,help,options,winsize".
es: El valor predeterminado es «blank,buffers,curdir,folds,help,options,winsize».

source: blank keep empty windows buffers all buffers, not only the ones in a window curdir the current directory folds folds, also manually created ones help the help window options all options and mappings winsize window sizes
es: blank mantener ventanas vacías buffers todos los «buffers», no sólo los de una ventana curdir el directorio actual folds pliegues, también los manualmente creados help la ventana de ayuda options todas las opciones y macros winsize tamaño de ventanas

source: Change this to your liking.
es: Modifique esto según su convenienvia.

source: To also restore the size of the Vim window, for example, use: >
es: Para también restaurar el tamaño de la ventana de Vim use, por ejemplo: >

source: The obvious way to use sessions is when working on different projects.
es: La manera obvia de usar sesiones es cuando trabaja en diferenes proyetos.

source: Suppose you store you session files in the directory "~/.vim".
es: Suponga que guarda sus archivos de sesión en el directorio «~/.vim».

source: You are currently working on the "secret" project and have to switch to the "boring" project: >
es: Está trabajando actualmente en el proyecto «secreto» y tiene que cambiar al proyecto «aburrido»: >

source: ~/.vim/secret.vim :source ~/.vim/boring.vim
es: ~/.vim/secreto.vim :source ~/.vim/aburrido.vim

source: :source ~/.vim/boring.vim
es: :source ~/.vim/aburrido.vim

source: Thus you have complete control over whether you want to continue next time where you are now, by saving the current setup in a session, or keep the session file as a starting point.
es: Por ello, ahora tiene un completo control sobre continuar en el mismo punto la siguiente vez que lo abra, guardando la configuración actual en una sesión, o mantener el archivo de sesión como un punto de partida.

source: Another way of using sessions is to create a window layout that you like to use, and save this in a session.
es: Otra manera de usar sesiones es crear una organización de ventana que le gusta usar, y guardarla en una sesión.

source: Then you can go back to this layout whenever you want.
es: Después podrá volver a este orden siempre que quiera.

source: For example, this is a nice layout to use:
es: Por ejemplo, esta es una bonita organización que puede usar:

source: +----------------------------------------+ | VIM - main help file | | | |Move around: Use the cursor keys, or "h| |help.txt================================| |explorer | | |dir |~ | |dir |~ | |file |~ | |file |~ | |file |~ | |file |~ | |~/=========|[No File]===================| | | +----------------------------------------+
es: +----------------------------------------+ | VIM - main help file | | | |Desplazarse: Use las teclas de direcció| |help.txt================================| |explorer | | |dir |~ | |dir |~ | |file |~ | |file |~ | |file |~ | |file |~ | |~/=========|[No File]===================| | | +----------------------------------------+

source: This has a help window at the top, so that you can read this text.
es: Ésta tiene una ventana de ayuda en la parte superior, para que pueda leer este texto.

source: The narrow vertical window on the left contains a file explorer.
es: La estrecha ventana vertical a la izquierda contiene un explorador de archivos.

source: This is a Vim plugin that lists the contents of a directory.
es: Esta es una extensión de Vim que lista los contenidos de un directorio.

source: You can select files to edit there.
es: Puede seleccionar qué archivos editar ahí.

source: More about this in the next chapter.
es: Más acerca de esto en el siguiente capítulo.

source: Create this from a just started Vim with: >
es: Puede crear esto con una instancia nueva de Vim con: >

source: You can resize the windows a bit to your liking.
es: Puede redimensionar las ventanas a su gusto.

source: Then save the session with: > :mksession ~/.vim/mine.vim
es: Guarde entonces la sesión con: > :mksession ~/.vim/mio.vim

source: vim -S ~/.vim/mine.vim
es: vim -S ~/.vim/mio.vim

source: Hint: To open a file you see listed in the explorer window in the empty window, move the cursor to the filename and press "O".
es: Pista: Para abrir un archivo que vea listado en la ventana del explorador en la ventana vacía, mueva el cursor al nombre del archivo y pulse «O».

source: Double clicking with the mouse will also do this.
es: Pulsar dos veces con el ratón le daría el mismo resultado.

source: Some people have to do work on MS-Windows systems one day and on Unix another day.
es: Hay gente que tiene que trabajar un día con sistemas MS-WINDOWS y con Unix al siguiente.

source: If you are one of them, consider adding "slash" and "unix" to 'sessionoptions'.
es: Si es uno de ellos, considere añadir «slash» y «unix» a 'sessionoptions'.

source: The session files will then be written in a format that can be used on both systems.
es: Los archivos de sesión se guardarán en un formato que les permita ser usados en ambos sistemas.

source: This is the command to put in your vimrc file: >
es: Esta es una orden para poner en su archivo vimrc: >

source: Vim will use the Unix format then, because the MS-Windows Vim can read and write Unix files, but Unix Vim can't read MS-Windows format session files.
es: Vim usará el formato Unix, porque Vim para MS-Windows puede leer y escribir archivos de Unix, pero Vim para Unix no puede leer los archivos de sesión con formato de MS-Windows.

source: Similarly, MS-Windows Vim understands file names with / to separate names, but Unix Vim doesn't understand \.
es: De manera similar, Vim para MS-Windows entiene los nombres de archivo con «/» como diferentes palabras, pero Vim para Unix no entiende «\».

source: Sessions store many things, but not the position of marks, contents of registers and the command line history.
es: Las sesiones guardan muchas cosas, pero no la posición de las marcas, contenidos de registros e historiales de la línea de órdenes.

source: You need to use the viminfo feature for these things.
es: Precisa emplear «viminfo» para estas cosas.

source: In most situations you will want to use sessions separately from viminfo.
es: En la mayoría de las situaciones deseará usar sesiones separadas de «viminfo».

source: This can be used to switch to another session, but keep the command line history.
es: Puede emplear esto para pasar a otra sesión, pero manteniendo el historial de la línea de órdenes.

source: And yank text into registers in one session, and paste it back in another session.
es: También puede copiar el texto de los registros de una sesión, y pegarlos en otra sesión diferente.

source: You might prefer to keep the info with the session.
es: Puede que prefiera mantener el información en la sesión.

source: You will have to do this yourself then.
es: Tendrá que hacer esto usted mismo.

source: ~/.vim/secret.vim :wviminfo!
es: ~/.vim/secreto.vim :wviminfo!

source: :source ~/.vim/secret.vim :rviminfo!
es: :source ~/.vim/secreto.vim :rviminfo!

source: *21.5* Views
es: *21.5* Vistas

source: A session stores the looks of the whole of Vim.
es: Una sesión guarda el aspecto completo de Vim.

source: When you want to store the properties for one window only, use a view.
es: Cuando desea guardar sólo las propiedades de una ventana, use una vista.

source: The use of a view is for when you want to edit a file in a specific way.
es: El uso de una vista es útil cuando desea editar un archivo de una manera específica.

source: For example, you have line numbers enabled with the 'number' option and defined a few folds.
es: Por ejemplo, ha activado el número de líneas con la opción 'number' y definido algunos plegados.

source: Just like with sessions, you can remember this view on the file and restore it later.
es: Al igual que con las sesiones, puede guardar esta vista en el archivo y restaurarla más tarde.

source: Actually, when you store a session, it stores the view of each window.
es: En realidad, cuando guarda una sesión, éste guarda la vista de cada ventana.
