Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Then Vim will take a guess at the file format. Watch out for situations where Vim guesses wrong.
es: Vim intentará entonces dilucidar el formato del archivo. Esté atento a las situaciones en las que Vim erra en su conclusión.

source: The "++" string is an item that tells Vim that an option name follows, which overrules the default for this single command. "++ff" is used for 'fileformat'. You could also use "++ff=mac" or "++ff=dos". This doesn't work for any option, only "++ff" and "++enc" are currently implemented. The full names "++fileformat" and "++encoding" also work.
es: La cadena «++» es un elemento que informa a Vim de que a continuación hay un nombre de opción que invalida el valor predeterminado, sólo de esta orden. «++ff» se usa para 'fileformat'. También puede usar «++ff=mac» o «++ff=dos». Esto no funciona con cualquier opción, y sólo está implementado «++ff» y «++enc». Los nombres completos, «++fileformat» y «++encoding», también funcionan.

source: You can use the 'fileformat' option to convert from one file format to another. Suppose, for example, that you have an MS-DOS file named README.TXT that you want to convert to UNIX format. Start by editing the MS-DOS format file: > vim README.TXT
es: Puede usar la opción 'fileformat' para convertir el formato de un archivo a otro. Suponga, por ejemplo, que tiene un archivo MS-DOS llamado README.TXT, que desea convertir al formato UNIX. Comience editando el archivo de formato MS-DOS: > vim README.TXT

source: Vim will recognize this as a dos format file. Now change the file format to UNIX: >
es: Vim reconocerá esto como un archivo de formato MS-DOS. Ahora cambie el formato a UNIX: >

source: *23.2* Files on the internet
es: *23.2* Archivos en Internet

source: Someone sends you an e-mail message, which refers to a file by its URL. For example:
es: Suponga que alguien le manda un correo electrónico que le remite a un archivo a través de su URL. Por ejemplo:

source: You can find the information here: ~ ftp://ftp.vim.org/pub/vim/README ~
es: Puedes encontrar la información aquí: ~ ftp://ftp.vim.org/pub/vim/README ~

source: You could start a program to download the file, save it on your local disk and then start Vim to edit it. There is a much simpler way. Move the cursor to any character of the URL. Then use this command: >
es: Puede iniciar un programa para descargar el archivo, guardarlo en su disco e iniciar Vim para editarlo. Existe una manera mucho más simple. Desplace el cursor hacia cualquier carácter del URL. Después ejecute esta orden: >

source: With a bit of luck, Vim will figure out which program to use for downloading the file, download it and edit the copy. To open the file in a new window use CTRL-W f. If something goes wrong you will get an error message. It's possible that the URL is wrong, you don't have permission to read it, the network connection is down, etc. Unfortunately, it's hard to tell the cause of the error. You might want to try the manual way of downloading the file.
es: Con un poco de suerte, Vim escogerá qué programa usar para descargarse el archivo, lo descargará y editará la copia. Para abrir el archivo en una ventana nueva use «CTRL-W f». Se le informará de cualquier incidencia en el proceso. Es posible que el URL sea erróneo, que no tiene los permisos necesarios para leerlo, que la conexion a Internet se ha interrumpido, etc. Desafortunadamente, es difícil conocer la causa del error. Puede que desee intentar una descarga manual.

source: Accessing files over the internet works with the netrw plugin. Currently URLs with these formats are recognized:
es: El acceso a archivos en Internet es posible gracias a la extensión netrw. A día de hoy se reconocen los siguientes formatos de URL:

source: ftp:// uses ftp rcp:// uses rcp scp:// uses scp http:// uses wget (reading only)
es: ftp:// usa ftp rcp:// usa rcp scp:// usa scp http:// usa wget (sólo lectura)

source: Vim doesn't do the communication itself, it relies on the mentioned programs to be available on your computer. On most Unix systems "ftp" and "rcp" will be present. "scp" and "wget" might need to be installed.
es: Vim no realiza la conexión por si mismo, sino que depende de que los programas mencionados estén instalados en su ordenador. La mayoría de los sistemas Unix incluyen ftp y rcp. Puede que tenga que instalar scp y wget.

source: Vim detects these URLs for each command that starts editing a new file, also with ":edit" and ":split", for example. Write commands also work, except for http://.
es: Vim detecta estas URL para cada orden que inicia la edición de un archivo nuevo, también con «:edit» y «:split», por ejemplo. Las órdenes de escritura también funcionan, a excepción de «http://».

source: *23.3* Encryption
es: *23.3* Cifrado

source: vim -x exam.txt
es: vim -x examen.txt

source: Enter encryption key: ~
es: Introduzca la clave de cifrado: ~

source: Carefully type the secret key now. You cannot see the characters you type, they will be replaced by stars. To avoid the situation that a typing mistake will cause trouble, Vim asks you to enter the key again:
es: Escriba ahora la clave con cuidado. No puede ver los caracteres que teclea, sino que serán reemplazados por estrellas. Para evitar problemas debidos a un error mecanográfico, Vim le pedirá que introduzca la clave otra vez:

source: Enter same key again: ~
es: Introduzca la misma clave de cifrado otra vez: ~

source: You can now edit this file normally and put in all your secrets. When you finish editing the file and tell Vim to exit, the file is encrypted and written. When you edit the file with Vim, it will ask you to enter the same key again. You don't need to use the "-x" argument. You can also use the normal ":edit" command. Vim adds a magic string to the file by which it recognizes that the file was encrypted. If you try to view this file using another program, all you get is garbage. Also, if you edit the file with Vim and enter the wrong key, you get garbage. Vim does not have a mechanism to check if the key is the right one (this makes it much harder to break the key).
es: Ahora puede editar este archivo con normalidad e introducir en él todos sus secretos. Cuando haya terminado de editar el archivo este se guarda y es cifrado. Cuando edite el archivo con Vim, éste le pedirá que introduzca la contraseña otra vez. No necesita emplear el argumento «-x». Puede también usar la orden «:edit». Vim añade una cadena mágica al archivo con el cual reconoce que el archivo está cifrado. Obtendrá sólo basura si intenta editar este archivo con otro programa. Así mismo, si lo abre con Vim pero introduce mal la contraseña también obtendrá basura. Vim no posee un mecanismo para revisar si la clave es correcta (lo cual hace más difícil descifrar la clave).

source: To disable the encryption of a file, set the 'key' option to an empty string: > :set key=
es: Para desactivar el cifrado de un archivo, configure la opción 'key' con una cadena vacía: > :set key=

source: The next time you write the file this will be done without encryption. Setting the 'key' option to enable encryption is not a good idea, because the password appears in the clear. Anyone shoulder-surfing can read your password. To avoid this problem, the ":X" command was created. It asks you for an encryption key, just like the "-x" argument did: >
es: La siguiente vez que escriba el archivo, ésto se hará sin cifrado. Configurar la opción 'key' para activar el cifrado no es una buena idea ya que la contraseña aparece sin ocultar. Cualquier persona leyendo por encima de su hombro puede leer su contraseña. La orden «:X» se creó para evitar este problema. Le pide una clave de cifrado, al igual que hizo el argumento «-x»: >

source: :X Enter encryption key: ****** Enter same key again: ******
es: :X Introduzca la clave de cifrado: ****** Introduzca la misma clave de cifrado otra vez: ******

source: The encryption algorithm used by Vim is weak. It is good enough to keep out the casual prowler, but not good enough to keep out a cryptology expert with lots of time on his hands. Also you should be aware that the swap file is not encrypted; so while you are editing, people with superuser privileges can read the unencrypted text from this file. One way to avoid letting people read your swap file is to avoid using one. If the -n argument is supplied on the command line, no swap file is used (instead, Vim puts everything in memory). For example, to edit the encrypted file "file.txt" without a swap file use the following command: >
es: El algoritmo de cifrado de Vim es débil. Es suficiente para mantener alejado al merodeador de turno, pero no lo es para mantener alejado a un experto en cifrado con mucho tiempo libre. Debe ser consciente de que el archivo de de intercambio («swap») no está cifrado; por ello, al editar, personas con privilegios de superusuario pueden leer el texto sin cifrar en este archivo. Una manera de evitar que le gente lea su archivo de intercambio es evitar tener uno. Si introduce el argumento «-n» en la linea de órdenes, no se usará ningún archivo de intercambio (en lugar de ello, volcará todo en la memoria). Por ejemplo, para editar el archivo cifrado «archivo.txt» si un archivo de intercambio, use la siguiente orden: >

source: vim -x -n file.txt
es: vim -x -n archivo.txt

source: Since there is no swapfile, recovery will be impossible. Save the file a bit more often to avoid the risk of losing your changes.
es: Es imposible recuperar un archivo si no existe un archivo de intercambio. Guarde los datos en el archivo más regularmente para evitar perder sus cambios .

source: While the file is in memory, it is in plain text. Anyone with privilege can look in the editor's memory and discover the contents of the file. If you use a viminfo file, be aware that the contents of text registers are written out in the clear as well. If you really want to secure the contents of a file, edit it only on a portable computer not connected to a network, use good encryption tools, and keep the computer locked up in a big safe when not in use.
es: Un archivo está en texto simple mientras esté en memoria. Cualquiera con los privilegios necesarios puede mirar en la memoria del editor y descubrir los contenidos del archivo. Si está usando un archivo viminfo, sea consciente de que los contenidos del registro del texto también se escriben de manera abierta. Si realmente desea proteger los contenidos de un archivo, edítelo sólo en un ordenador portátil sin conexión a ninguna red, use buenas herramientas de cifrado, y guarde el ordenador en una gran caja fuerte cuando no esté en uso.

source: *23.4* Binary files
es: *23.4* Archivos binarios

source: You can edit binary files with Vim. Vim wasn't really made for this, thus there are a few restrictions. But you can read a file, change a character and write it back, with the result that only that one character was changed and the file is identical otherwise. To make sure that Vim does not use its clever tricks in the wrong way, add the "-b" argument when starting Vim: >
es: Puede editar archivos binarios con Vim. Vim no se creó para esta labor, y por ello hay ciertas restricciones. Pero puede leer el archivo, cambiar un carácter y escribir esto en el archivo, con el resultado de que sólo cambió un carácter y que, en todo lo demás, el archivo es idéntico. Para impedir que Vim use sus ingeniosos trucos de manera inapropiada, añada el argumento «-b» al iniciar Vim: >

source: vim -b datafile
es: vim -b archivo_de_datos

source: This sets the 'binary' option. The effect of this is that unexpected side effects are turned off. For example, 'textwidth' is set to zero, to avoid automatic formatting of lines. And files are always read in Unix file format.
es: Esto activa la opción 'binary'. El efecto que tiene es que se desactivan ciertos efectos secundarios inesperados. Por ejemplo, 'textwidth' recibe un valor 0, para evitar el formateo automático de las líneas. Y los archivos se leen siempre en el formato de archivo UNIX.

source: Binary mode can be used to change a message in a program. Be careful not to insert or delete any characters, it would stop the program from working. Use "R" to enter replace mode.
es: El modo binario se puede usar para cambiar el mensaje de un programa. Tenga cuidado de no insertar o eliminar cualquier carácter, ya que impediría el funcionamiento del programa. Use «-R» para pasar al modo «replace» (reemplazar).

source: Many characters in the file will be unprintable. To see them in Hex format: >
es: Muchos caracteres en el archivo no se pueden imprimir. Para verlos en formato Hex: >

source: Otherwise, the "ga" command can be used to see the value of the character under the cursor. The output, when the cursor is on an <Esc>, looks like this:
es: Por otro lado, puede usar la orden «ga» para ver el valor del carácter bajo el cursor. La salida, si el cursor está sobre un <Esc>, tiene este aspecto:

source: There might not be many line breaks in the file. To get some overview switch the 'wrap' option off: >
es: Puede que no haya demasiados retornos de línea en el archivo. Para obtener una visión de conjunto, desactive la opción 'wrap': >

source: Col 9-16 of 9-16; Line 277 of 330; Word 1806 of 2058; Byte 10580 of 12206 ~
es: Col 9-16 of 9-16; Línea 277 of 330; Palabra 1806 de 2058; Byte 10580 de 12206 ~

source: The last two numbers are the byte position in the file and the total number of bytes. This takes into account how 'fileformat' changes the number of bytes that a line break uses. To move to a specific byte in the file, use the "go" command. For example, to move to byte 2345: >
es: Los dos últimos números son el byte posición en el archivo y el número total de bytes. Tiene en cuenta cómo 'fileformat' cambia el número de bytes que emplea un retorno de línea. Para desplazarse a un byte específico en el archivo, use la orden «go». Por ejemplo, para ir al byte 2345: >

source: A real binary editor shows the text in two ways: as it is and in hex format. You can do this in Vim by first converting the file with the "xxd" program. This comes with Vim. First edit the file in binary mode: >
es: Un editor realmente binario muestra el texto de dos formas: tal cual y en formato hexadecimal. Vim hace esto posible si primero convierte el archivo con el programa «xxd». Este programa está incluido en Vim. Primero edite el archivo en modo binario: >

source: You can now view and edit the text as you like. Vim treats the information as ordinary text. Changing the hex does not cause the printable character to be changed, or the other way around. Finally convert it back with: > :%!xxd -r
es: Ahora puede ver y editar el texto como desee. Vim trata la información como texto normal. Cambiar el valor hexadecimal no provoca un cambio en el carácter imprimible, o vicecersa. Por último, conviertalo otra vez con: > :%!xxd -r

source: Only changes in the hex part are used. Changes in the printable text part on the right are ignored.
es: Sólo se usan los cambios en la parte hexadecimal. Los cambios en la parte imprimible de texto se ignoran.

source: *23.5* Compressed files
es: *23.5* Archivos comprimidos

source: Vim uses the mentioned programs to do the actual compression and decompression. You might need to install the programs first.
es: Vim realiza la compresión y descompresión mediante los programas mencionados. Puede que primero tenga instalar los programas.

source: *usr_24.txt* For Vim version 7.3. Last change: 2006 Jul 23
es: *usr_24.esx* Para Vim versión 7.3. Último cambio: 23/6/2006

source: Inserting quickly
es: Insertar con rapidez

source: When entering text, Vim offers various ways to reduce the number of keystrokes and avoid typing mistakes. Use Insert mode completion to repeat previously typed words. Abbreviate long words to short ones. Type characters that aren't on your keyboard.
es: Al introducir texto, Vim ofrece varias maneras de reducir el número de teclas que pulsa, evitando teclear errores. Use el modo de autocompletado del modo Insertar para repetir palabras anteriormente tecleadas. Abrevie las palabras largas. Teclee caracteres que no están en su teclado.

source: |24.1| Making corrections |24.2| Showing matches |24.3| Completion |24.4| Repeating an insert |24.5| Copying from another line |24.6| Inserting a register |24.7| Abbreviations |24.8| Entering special characters |24.9| Digraphs |24.10| Normal mode commands
es: |24.1| Corregir |24.2| Mostrar coincidencias |24.3| Autocompletado |24.4| Repetir una inserción |24.5| Copiar desde otra línea |24.6| Insertar un registro |24.7| Abreviaturas |24.8| Introducir caracteres especiales |24.9| Dígrafos |24.10| Órdenes del modo Normal

source: Next chapter: |usr_25.txt| Editing formatted text Previous chapter: |usr_23.txt| Editing other files Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_25.txt| Editar texto con formato Capitulo anterior: |usr_23.esx| Editar otros archivos Tabla de contenidos: |usr_toc.esx|

source: *24.1* Making corrections
es: *24.1* Corregir

source: The <BS> key was already mentioned. It deletes the character just before the cursor. The <Del> key does the same for the character under (after) the cursor. When you typed a whole word wrong, use CTRL-W:
es: La tecla <BS> ya se ha mencionado. Borra el carácter que precede al cursor. La tecla <Del> hace lo mismo con el carácter debajo (después) del cursor. Use CTRL-W en caso de haber tecleado una palabra completamente errónea:

source: The horse had fallen to the sky ~ CTRL-W The horse had fallen to the ~
es: El caballo cayó del cielo ~ CTRL-W El caballo cayó del ~

source: If you really messed up a line and want to start over, use CTRL-U to delete it. This keeps the text after the cursor and the indent. Only the text from the first non-blank to the cursor is deleted. With the cursor on the "f" of "fallen" in the next line pressing CTRL-U does this:
es: En caso de haber realizado errores en una línea, y desea empezar otra vez, use CTRL-U para eliminarlo. Esto mantiene el texto después del cursor, así como la tabulación. Sólo se elimina el texto desde el primer espacio que no esté vacío hasta el cursor. Pulsar CTRL-U con el cursor sobre la «c» de «cayó» hace lo siguiente:

source: The horse had fallen to the ~ CTRL-U fallen to the ~
es: El caballo cayó del cielo ~ CTRL-W cayó del ~

source: When you spot a mistake a few words back, you need to move the cursor there to correct it. For example, you typed this:
es: Cuando detecta un error en alguna palabra anterior, necesita desplazar el cursor hasta ese punto para corregirlo. Por ejemplo, escribió lo siguiente:

source: The horse had follen to the ground ~
es: El caballo cayu al suelo ~

source: You need to change "follen" to "fallen". With the cursor at the end, you would type this to correct it: >
es: Necesita cambiar «cayo» a «cayó». Con el cursor al final, teclearía esto para corregirlo: >

source: <Esc>4blraA
es: <Esc>3blróA

source: < get out of Insert mode <Esc> four words back 4b move on top of the "o" l replace with "a" ra restart Insert mode A
es: < Abandonar el modo insertar <Esc> Cuatro palabras hacia atrás 3b Desplazarse a la «u» l Reemplazar con «ó» ró Reiniciar modo insertar A

source: Another way to do this: >
es: Existe otra manera de hacer esto: >

source: <C-Left><C-Left><C-Left><C-Left><Right><Del>a<End>
es: <C-Izq><C-Izq><C-Izq><Derecha><Derecha><Derecha><Supr>ó<Fin>

source: < four words back <C-Left><C-Left><C-Left><C-Left> move on top of the "o" <Right> delete the "o" <Del> insert an "a" a go to end of the line <End>
es: < Tres palabras hacia atrás <C-Izq><C-Izq><C-Izq> Desplazarse a la «u» <Derecha><Derecha><Derecha> Borrar la «u» <Supr> Insertar una «ó» ó Ir al final de la línea <Fin>

source: This uses special keys to move around, while remaining in Insert mode. This resembles what you would do in a modeless editor. It's easier to remember, but takes more time (you have to move your hand from the letters to the cursor keys, and the <End> key is hard to press without looking at the keyboard). These special keys are most useful when writing a mapping that doesn't leave Insert mode. The extra typing doesn't matter then. An overview of the keys you can use in Insert mode:
es: Esto emplea teclas especiales para el desplazamiento, a la vez que permanece en el modo Insertar. Esto se parece a lo que haría con un editor sin modos. Es más fácil de recordar, pero lleva más tiempo (tiene que mover sus manos de las letras a las teclas del cursor, y es difícil pulsar la tecla <Fin> sin mirar el teclado). Estas teclas especiales son más útiles cuando escribe una macro que no abandona el modo Insertar. El tecleo adicional no importa en este caso. Este es un resumen de las teclas que puede usar en el modo Insertar:

source: <C-Home> to start of the file <PageUp> a whole screenful up <Home> to start of line <S-Left> one word left <C-Left> one word left <S-Right> one word right <C-Right> one word right <End> to end of the line <PageDown> a whole screenful down <C-End> to end of the file
es: <C-Inicio> al principio del archivo <Repág> subir una pantalla <Inicio> al inicio de la línea <S-Izq> una palabra a la izquierda <C-Izq> una palabra a la izquierda <S-Der> una palabra a la derecha <C-Der> una palabra a la derecha <Fin> al final de la línea <Avpág> bajar una pantalla <C-Fin> al final del archivo

source: *24.2* Showing matches
es: *24.2* Mostrar coincidencias

source: When you type a ) it would be nice to see with which ( it matches. To make Vim do that use this command: >
es: Al teclear una «)» estaría bien ver con qué «(» encaja. Para hacer que Vim use esta orden: >

source: When you now type a text like "(example)", as soon as you type the ) Vim will briefly move the cursor to the matching (, keep it there for half a second, and move back to where you were typing. In case there is no matching (, Vim will beep. Then you know that you might have forgotten the ( somewhere, or typed a ) too many. The match will also be shown for [] and {} pairs. You don't have to wait with typing the next character, as soon as Vim sees it the cursor will move back and inserting continues as before. You can change the time Vim waits with the 'matchtime' option. For example, to make Vim wait one and a half second: >
es: Ahora, cuando teclee un texto como «(ejemplo), tan pronto como teclee el «)» Vim moverá el cursor brevemente al «(» correspondiente, lo mantendrá ahí medio segundo, y volverá a donde estaba tecleando. En caso de no existir un correspondiente «(», Vim pitará. Sabrá entonces que ha olvidado el «(» en algún lugar, o que escribió una «)» demasiadas veces. También se mostrará el signo correspondiente en las parejas «[]» «{}». No tiene que esperar a teclear el siguiente carácter, ya que tan pronto como Vim lo detecte, devolverá el cursor a su posición original, continuando la inserción. Puede modificar el tiempo que Vim espera con la opción 'matchtime'. Por ejemplo, para hacer que Vim espere un segundo y medio: >

source: *24.3* Completion
es: *24.3* Autocompletado

source: Vim can automatically complete words on insertion. You type the first part of a word, press CTRL-P, and Vim guesses the rest. Suppose, for example, that you are creating a C program and want to type in the following:
es: Vim puede auto-completar palabras durante la inserción. Escriba primero la parte inicial de una palabra, pulse CTRL-P y Vim adivinará el resto. Suponga, por ejemplo, que está creando un programa en C y que desea teclear lo siguiente:
