Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: The 'splitbelow' option can be set to make a new window appear below the current window.
es: Puede activar la opción 'splitbelow' para hacer que la nueva ventana aparezca debajo de la actual.

source: The 'splitright' option can be set to make a vertically split window appear right of the current window.
es: Puede activar la opción 'splitright' para hacer que una partición vertical aparezca a la derecha de la ventana actual.

source: :leftabove {cmd} left or above the current window :aboveleft {cmd} idem :rightbelow {cmd} right or below the current window :belowright {cmd} idem :topleft {cmd} at the top or left of the Vim window :botright {cmd} at the bottom or right of the Vim window
es: :leftabove {cmd} izquierda o encima de la actual :aboveleft {cmd} ídem :rightbelow {cmd} derecha o debajo de la actual :belowright {cmd} ídem :topleft {cmd} encima o a la izquierda de la ventana de Vim :botright {cmd} debajo o a la derecha de la ventana de Vim

source: *08.9* Tab pages
es: *08.9* Pestañas

source: You will have noticed that windows never overlap.
es: Habrá notado que las ventanas no se superponen.

source: That means you quickly run out of screen space.
es: Esto significa que puede rápidamente acabar sin espacio suficiente.

source: The solution for this is called Tab pages.
es: La solución son las pestañas:

source: Assume you are editing "thisfile".
es: Suponga que está editando «estearchivo».

source: To create a new tab page use this command: >
es: Para crear una nueva pestaña: >

source: :tabedit thatfile
es: :tabedit «aquélarchivo»

source: This will edit the file "thatfile" in a window that occupies the whole Vim window.
es: Esto editará el archivo «aquélarchivo» en una ventana que ocupe todo el espacio de Vim.

source: And you will notice a bar at the top with the two file names:
es: Verá que hay una nueva barra en la parte superior:

source: +----------------------------------+ | thisfile | /thatfile/ __________X| (thatfile is bold) |/* thatfile */ | |that | |that | |~ | |~ | |~ | | | +----------------------------------+
es: +----------------------------------+ | estearchivo | /aquélarchivo/ ___X| (aquélarchivo está en | | negrita) |/* aquélarchivo */ | |aquél | |aquél | |~ | |~ | |~ | | | +----------------------------------+

source: You now have two tab pages.
es: Ahora tiene dos pestañas.

source: The first one has a window for "thisfile" and the second one a window for "thatfile".
es: La primera tiene una ventana para «estearchivo» y la segunda para «aquélarchivo».

source: It's like two pages that are on top of eachother, with a tab sticking out of each page showing the file name.
es: Es como dos páginas una encima de la otra, con una pestaña sobresaliendo de cada página.

source: +----------------------------------+ | /thisfile/ | thatfile __________X| (thisfile is bold) |/* thisfile */ | |this | |this | |~ | |~ | |~ | | | +----------------------------------+
es: +----------------------------------+ | /estearchivo/ | aquélarchivo ___X| (estearchivo está en | | negrita) |/* estearchivo */ | |este | |este | |~ | |~ | |~ | | | +----------------------------------+

source: Thus you can switch between tab pages by clicking on the label in the top line.
es: De este modo puede pasar entre pestañas pulsando sobre la etiqueta de la línea superior.

source: If you don't have a mouse or don't want to use it, you can use the "gt" command.
es: Si no dispone del ratón o no lo quiere usar, puede emplear la orden «gt».

source: Mnemonic: Goto Tab.
es: Nemotecnia: Goto Tab (ir a pestaña).

source: +-------------------------------------+ | thisfile | /thisfile/ | thatfile __X| (thisfile is bold) |/* thisfile */ | |this | |this | |~ | |~ | |~ | | | +-------------------------------------+
es: +----------------------------------------------+ | estearchivo | /estearchivo/ | aquélarchivo _X| (estearchivo está |/* estearchivo */ | en negrita) |este | |este | |~ | |~ | |~ | | | +----------------------------------------------+

source: You can put ":tab" before any Ex command that opens a window.
es: Puede poner «:tab» antes de cualquier orden «Ex» que abra una ventana.

source: The window will be opened in a new tab page.
es: La ventana se abrirá en una nueva ventana.

source: - click with the mouse on the "X" in the top right corner The current tab page will be closed.
es: - pulse con el ratón sobre la «X» en la esquina superior derecha.

source: Unless there are unsaved changes in the current tab page.
es: La pestaña actual se cerrará a menos que haya cambios sin guardar en la pestaña.

source: - double click with the mouse in the top line A new tab page will be created.
es: - doble pulsación con el ratón sobre la línea superior Se creará una nueva ventana.

source: *usr_02.txt* For Vim version 7.3.
es: *usr_02.esx* Para Vim versión 7.3.

source: The first steps in Vim
es: Primeros pasos en Vim

source: This chapter provides just enough information to edit a file with Vim.
es: Este capítulo ofrece suficiente información para editar un archivo con Vim.

source: Not well or fast, but you can edit.
es: No bien ni rápido, pero podrá editar.

source: Take some time to practice with these commands, they form the base for what follows.
es: Tómese un tiempo para practicar estas órdenes, son la base de lo que sigue.

source: |02.1| Running Vim for the First Time |02.2| Inserting text |02.3| Moving around |02.4| Deleting characters |02.5| Undo and Redo |02.6| Other editing commands |02.7| Getting out |02.8| Finding help
es: |02.1| Ejecutar Vim por primera vez |02.2| Insertar texto |02.3| Movimiento |02.4| Eliminar caracteres |02.5| Deshacer y rehacer |02.6| Otras órdenes de edición |02.7| Salir |02.8| Encontrar ayuda

source: Next chapter: |usr_03.txt| Moving around Previous chapter: |usr_01.txt| About the manuals Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_03.esx| Desplazamiento Capítulo anterior: |usr_01.esx| Acerca de los manuales Tabla de contenidos: |usr_toc.esx|

source: *02.1* Running Vim for the First Time
es: *02.1* Ejecutar Vim por primera vez

source: In UNIX you can type this at any command prompt.
es: En UNIX puede introducir esta orden en cualquier interprete de órdenes.

source: If you are running Microsoft Windows, open an MS-DOS prompt window and enter the command.
es: Si está bajo Microsoft Windows, abra una terminal de MS-DOS e introduzca la orden.

source: In either case, Vim starts editing a file called file.txt.
es: En ambos casos, Vim se inicia con la edición de un archivo llamado file.txt.

source: Because this is a new file, you get a blank window.
es: Ya que es un archivo nuevo, obtendrá un ventana vacía.

source: This is what your screen will look like:
es: Así es como su pantalla debería aparecer:

source: +---------------------------------------+ |# | |~ | |~ | |~ | |~ | |"file.txt" [New file] | +---------------------------------------+ ('#" is the cursor position.)
es: +---------------------------------------+ |# | |~ | |~ | |~ | |~ | |"file.txt" [Archivo nuevo] | +---------------------------------------+ ('#" es la posición del cursor.)

source: The tilde (~) lines indicate lines not in the file.
es: Las líneas con tilde (~) indican líneas que no se hallan en el archivo.

source: In other words, when Vim runs out of file to display, it displays tilde lines.
es: En otras palabras, cuando Vim se queda sin archivo que mostrar muestra líneas con tilde.

source: At the bottom of the screen, a message line indicates the file is named file.txt and shows that you are creating a new file.
es: En la parte inferior de la pantalla, un mensaje muestra que el archivo se llama file.txt y que está creando un archivo nuevo.

source: The message information is temporary and other information overwrites it.
es: La información del mensaje es temporal y otra información la sobreescribirá.

source: The gvim command causes the editor to create a new window for editing.
es: La orden «gvim» hace que el editor cree una nueva ventana para editar.

source: If you use this command: >
es: Si usa la orden: >

source: the editing occurs inside your command window.
es: la edición ocurre dentro de la ventana de llamada.

source: In other words, if you are running inside an xterm, the editor uses your xterm window.
es: En otras palabras, si está dentro de una xterm, el editor usa su ventana xterm.

source: If you are using an MS-DOS command prompt window under Microsoft Windows, the editing occurs inside this window.
es: Si está usando una terminal de MS-DOS bajo Windows, la edición tendrá lugar dentro de esta ventana.

source: The text in the window will look the same for both versions, but with gvim you have extra features, like a menu bar.
es: El texto en la ventana tendrá el mismo aspecto en ambas versiones, pero con gvim tiene características extra, como una barra de menú.

source: More about that later.
es: Volveremos a este punto posteriormente.

source: *02.2* Inserting text
es: *02.2* Insertar texto

source: After typing "turtle" you press the <Enter> key to start a new line.
es: Tras teclear «turtle», pulse la tecla <Intro> para comenzar una nueva línea.

source: Finally you press the <Esc> key to stop Insert mode and go back to Normal mode.
es: Por último, presione la tecla <Esc> para salir del modo Insertar y volver al modo Normal.

source: You now have two lines of text in your Vim window:
es: Ahora tienes dos línea de texto en su ventana de Vim:

source: You will notice that when typing the colon Vim moves the cursor to the last line of the window.
es: Comprobará que cuando introduce dos puntos, Vim desplaza el cursor a la última línea de la ventana.

source: That's where you type colon commands (commands that start with a colon).
es: Allí es donde introducirá órdenes con dos puntos (órdenes que comienzan con dos puntos).

source: Finish this command by pressing the <Enter> key (all commands that start with a colon are finished this way).
es: Finalice la orden presionando la tecla <Intro> (todas estas órdenes se finalizan de este modo).

source: Now, if you type the "i" command Vim will display --INSERT-- at the bottom of the window.
es: Si pulsase ahora la orden «i», Vim mostrará --INSERT-- en la parte inferior de la ventana.

source: This indicates you are in Insert mode.
es: Esto indica que está en el modo Insertar.

source: One of the problems for Vim novices is mode confusion, which is caused by forgetting which mode you are in or by accidentally typing a command that switches modes.
es: Uno de los problemas para los que comienzan a usar Vim es la confusión de los modos, que se produce al olvidar en qué modo está o por teclear accidentalmente una orden que cambia de modo.

source: To get back to Normal mode, no matter what mode you are in, press the <Esc> key.
es: Para volver al modo Normal, no importa el modo en el que esté,presione la tecla <Esc>.

source: Sometimes you have to press it twice.
es: En algunas ocasiones, tendrá que presionarlo dos veces.

source: If Vim beeps back at you, you already are in Normal mode.
es: Si Vim emite un pitido, entonces es que está de vuelta al modo Normal.

source: *02.3* Moving around
es: *02.3* Movimiento

source: h left *hjkl* j down k up l right
es: h izquierda *hjkl* j abajo k arriba l derecha

source: At first, it may appear that these commands were chosen at random.
es: En un principio, puede parecer que estas órdenes se han elegido arbitrariamente.

source: After all, who ever heard of using l for right?
es: Después de todo, ¿quién ha visto usar l para derecha?

source: But actually, there is a very good reason for these choices: Moving the cursor is the most common thing you do in an editor, and these keys are on the home row of your right hand.
es: De hecho, hay una buena razón para esto: mover el cursor es una de las cosas más comunes que hará en un editor, y estas teclas están en la fila central de su mano derecha.

source: In other words, these commands are placed where you can type them the fastest (especially when you type with ten fingers).
es: En otras palabras, estas órdenes se sitúan donde puede teclearlos de manera más rápida (especialmente cuando escribe con diez dedos).

source: Note: You can also move the cursor by using the arrow keys.
es: Nota: También puede mover el cursor usando las flechas.

source: If you do, however, you greatly slow down your editing because to press the arrow keys, you must move your hand from the text keys to the arrow keys.
es: Si lo haces, sin embargo, ralentizará considerablemente la edición, ya que para ello tendrá que desplazar su mano desde las letras a las flechas del teclado.

source: Considering that you might be doing it hundreds of times an hour, this can take a significant amount of time.
es: Teniendo en cuenta que debe hacerlo cientos de veces cada hora, esto puede llevar un tiempo considerable.

source: Also, there are keyboards which do not have arrow keys, or which locate them in unusual places; therefore, knowing the use of the hjkl keys helps in those situations.
es: Además, hay teclados que no tienen teclas de flechas, o que las colocan en lugares inusuales; por lo tanto, conocer el uso de hjkl ayuda en esas situaciones.

source: One way to remember these commands is that h is on the left, l is on the right and j points down.
es: Una manera de recordar estas órdenes es que la h está a la izquierda, l en la derecha y j apunta hacia abajo.

source: In a picture: >
es: En un esquema: >

source: The best way to learn these commands is by using them.
es: La mejor manera de aprender estas órdenes es usándolas.

source: Use the "i" command to insert some more lines of text.
es: Use la orden «i» para insertar algunas líneas de texto más.

source: Then use the hjkl keys to move around and insert a word somewhere.
es: Use entonces las teclas hjkl para moverse e insertar palabras.

source: Don't forget to press <Esc> to go back to Normal mode.
es: No se olvide de presionar <Esc> para volver al modo Normal.

source: The |vimtutor| is also a nice way to learn by doing.
es: El |vimtutor| es también una práctica manera de aprender.

source: Komsomolsk ^ | Huan Ho <--- ---> Los Angeles (Yellow river) | v Java (the island, not the programming language)
es: Komsomolsk ^ | Huan Ho <--- ---> Los Angeles (Río amarillo) | v Java (la isla, no el lenguaje de programación)

source: *02.4* Deleting characters
es: *02.4* Eliminar caracteres

source: To delete a character, move the cursor over it and type "x".
es: Para eliminar un carácter, sitúe el cursor encima de él y presione «x».

source: (This is a throwback to the old days of the typewriter, when you deleted things by typing xxxx over them.) Move the cursor to the beginning of the first line, for example, and type xxxxxxx (seven x's) to delete "A very ".
es: (Esto es una reminiscencia de los días de las máquinas de escribir, cuando se eliminaban caracteres escribiendo xxxx sobre ellos.) Sitúe el cursor al comienzo de la primera línea, por ejemplo, y pulse xxxxxxx (siete «xx») para eliminar «A very».

source: The result should look like this:
es: El resultado debería ser:

source: This begins an insert (the i), inserts the words "A young", and then exits insert mode (the final <Esc>).
es: Esto inicia una inserción (la «i»), inserta las palabras «A young», y sale del modo insertar (el <Esc> final).

source: To delete a whole line use the "dd" command.
es: Para eliminar una línea entera use la orden «dd».

source: The following line will then move up to fill the gap:
es: La siguiente línea se moverá hacia arriba para rellenar el hueco:

source: In Vim you can join two lines together, which means that the line break between them is deleted.
es: En Vim puede unir dos líneas, lo que significa que el salto de línea entre ellas se elimina.

source: The "J" command does this.
es: La orden «J» hace esto.

source: Take these two lines:
es: Suponga estas dos líneas:

source: *02.5* Undo and Redo
es: *02.5* Deshacer y rehacer

source: Suppose you delete too much.
es: Suponga que elimina demasiado.

source: Well, you can type it in again, but an easier way exists.
es: Puede teclearlo de nuevo, pero existe una manera más fácil.

source: The "u" command undoes the last edit.
es: La orden «u» deshace la última edición.

source: Take a look at this in action: After using "dd" to delete the first line, "u" brings it back.
es: Vea esto en acción: Tras usar «dd» para eliminar la última línea, «u» la devuelve.

source: Another one: Move the cursor to the A in the first line:
es: Otra más: mueve el cursor a la A en la primera línea:

source: Now type xxxxxxx to delete "A young".
es: Ahora teclee xxxxxxx para eliminar «A young».

source: Type "u" to undo the last delete.
es: Teclee «u» para deshacer la última eliminación.

source: That delete removed the g, so the undo restores the character.
es: Esa última eliminación quitó la g, por lo que deshacer la devuelve.

source: Note: If you type "u" twice, and the result is that you get the same text back, you have Vim configured to work Vi compatible.
es: Nota: Si teclea la «u» dos veces, y el resultado que obtendrá es el mismo texto de vuelta, es que tiene Vim configurado para que sea Vi-compatible.

source: Look here to fix this: |not-compatible|.
es: Véase aquí para solucionarlo: |not-compatible|.

source: This text assumes you work "The Vim Way".
es: Este texto asume que trabaja en «El Modo Vim».

source: You might prefer to use the good old Vi way, but you will have to watch out for small differences in the text then.
es: Quizá quiera usar el viejo modo Vi, pero entonces tendrá que observar las pequeñas diferencias.

source: If you undo too many times, you can press CTRL-R (redo) to reverse the preceding command.
es: Si deshace de más, puede pulsar CTRL-R (rehacer) para revertir la orden precedente.

source: In other words, it undoes the undo.
es: En otras palabras, deshace el deshacer.

source: To see this in action, press CTRL-R twice.
es: Para ver esto en acción, presione CTRL-R dos veces.

source: The character A and the space after it disappear:
es: El carácter A y el espacio desaparecerían:

source: There's a special version of the undo command, the "U" (undo line) command.
es: Hay una versión especial de la orden deshacer, la orden «U» (deshacer línea).

source: The undo line command undoes all the changes made on the last line that was edited.
es: La orden deshacer línea deshace todos los cambios realizados en la última línea editada.

source: Typing this command twice cancels the preceding "U".
es: Si teclea esta orden dos veces, deshará la «U» precedente.

source: A very intelligent turtle ~ xxxx Delete very
es: A very intelligent turtle ~ xxxx Eliminar very

source: A intelligent turtle ~ xxxxxx Delete turtle
es: A intelligent turtle ~ xxxxxx Eliminar turtle

source: A intelligent ~ Restore line with "U" A very intelligent turtle ~ Undo "U" with "u" A intelligent ~
es: A intelligent ~ Restaurar línea con «U» A very intelligent turtle ~ Deshacer «U» con «u» A intelligent ~

source: The "U" command is a change by itself, which the "u" command undoes and CTRL-R redoes.
es: La orden «U» es un cambio en sí mismo, que la orden «u» deshace y CTRL-R rehace.

source: This might be a bit confusing.
es: Esto puede resultar confuso.

source: Don't worry, with "u" and CTRL-R you can go to any of the situations you had.
es: No se preocupe, con «u» y CTRL-R puede ir a cualquier situación anterior.

source: More about that in section |32.2|.
es: Más información en la sección |32.2|.

source: *02.6* Other editing commands
es: *02.6* Otras órdenes de edición

source: Vim has a large number of commands to change the text.
es: Vim tiene una larga lista de órdenes para modificar texto.

source: See |Q_in| and below.
es: Véase |Q_in| y a continuación.

source: Here are a few often used ones.
es: Aquí hay algunos de uso frecuente.

source: The "i" command inserts a character before the character under the cursor.
es: La orden «i» inserta un carácter antes del carácter bajo el cursor.

source: That works fine; but what happens if you want to add stuff to the end of the line?
es: Esto funciona bien; pero ¿qué ocurre si quieres añadir algo al final de la línea?

source: For that you need to insert text after the cursor.
es: Para ello necesita insertar texto después del cursor.

source: This is done with the "a" (append) command.
es: Esto se hace con la orden «a» (añadir).

source: For example, to change the line
es: Por ejemplo, para modificar la línea

source: ~ to and that's not saying much for the turtle!!!
es: ~ a and that's not saying much for the turtle!!!

source: The "o" command creates a new, empty line below the cursor and puts Vim in Insert mode.
es: La orden «o» crea una nueva línea vacía debajo del cursor y pone Vim en modo insertar.

source: Then you can type the text for the new line.
es: Puede introducir el texto de la nueva línea.

source: Suppose the cursor is somewhere in the first of these two lines:
es: Suponga que el cursor está en algún lugar de la primera de estas líneas:

source: Suppose you want to move up nine lines.
es: Suponga que quiera desplazarse nueve líneas hacia arriba.

source: You can type "kkkkkkkkk" or you can enter the command "9k".
es: Puede teclear «kkkkkkkkk» o puede teclear la orden «9k».

source: In fact, you can precede many commands with a number.
es: De hecho, se puede emplear el multiplicador con muchas órdenes.

source: Earlier in this chapter, for instance, you added three exclamation points to the end of a line by typing "a!!!<Esc>".
es: Anteriormente en este capítulo, añadió tres exclamaciones al final de la línea con «a!!!<Esc>».

source: Another way to do this is to use the command "3a!<Esc>".
es: Otra forma de hacer esto es usar la orden «3a!<Esc>».

source: The count of 3 tells the command that follows to triple its effect.
es: El multiplicador 3 hace que la orden a continuación triplique su efecto.

source: Similarly, to delete three characters, use the command "3x".
es: De igual modo, para eliminar tres caracteres, use «3x».

source: The count always comes before the command it applies to.
es: El multiplicador siempre va delante de la orden sobre el que se aplica.

source: *02.7* Getting out
es: *02.7* Salir

source: To exit, use the "ZZ" command.
es: Para salir, use la orden «ZZ».

source: This command writes the file and exits.
es: Esta orden escribe el archivo y sale.

source: Note: Unlike many other editors, Vim does not automatically make a backup file.
es: Nota: Al revés que muchos otros editores, Vim no hace un archivo de seguridad automático.

source: If you type "ZZ", your changes are committed and there's no turning back.
es: Si escribe «ZZ», sus cambios se comprometen sin vuelta atrás.

source: You can configure the Vim editor to produce backup files, see |07.4|.
es: Puede configurar el editor Vim para que haga copias de seguridad, consulte |07.4|.

source: Sometimes you will make a sequence of changes and suddenly realize you were better off before you started.
es: En ocasiones se dará cuenta de que tras una serie de cambios, estaba mejor donde comenzó.

source: Not to worry; Vim has a quit-and-throw-things-away command.
es: No se preocupe; Vim tiene una orden para salir y descartar todos los cambios.

source: It is: >
es: Es: >

source: For those of you interested in the details, the three parts of this command are the colon (:), which enters Command-line mode; the q command, which tells the editor to quit; and the override command modifier (!).
es: Para aquellos de vosotros interesados en los detalles, las tres partes de esta orden son los dos puntos (:), que entra en el modo en línea de órdenes; la orden «q», para salir; y el modificador de anulación (!).
