Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Now move the cursor three lines down with "3j" and to the next word with "w".
es: Ahora mueva el cursor tres líneas abajo con «3j» y a la siguiente palabra con «w».

source: You can see the first character of the last column is included.
es: Puede comprobar que el primer carácter de la última columna se ha incluido.

source: To exclude it, use "h".
es: Para excluirlo, use «h».

source: Now press "d" and the middle column is gone.
es: Si ahora pulsa «d» la columna central desaparecerá.

source: If you have selected some text in Visual mode, and discover that you need to change the other end of the selection, use the "o" command (Hint: o for other end).
es: Si ha seleccionado algo de texto en modo Visual, y descubre que necesita cambiar el otro lado de la selección, use la orden «o» (Truco: o para el «otro» lado).

source: The cursor will go to the other end, and you can move the cursor to change where the selection starts.
es: El cursor irá hasta el otro final de la selección, y podrá modificar dónde comienza la selección.

source: Pressing "o" again brings you back to the other end.
es: Pulsa «o» de nuevo para volver al otro lado.

source: When using blockwise selection, you have four corners.
es: Cuando usa el modo Visual de bloques, tiene cuatro esquinas.

source: "o" only takes you to one of the other corners, diagonally.
es: «o» le llevará a una de las otras líneas diagonalmente.

source: Use "O" to move to the other corner in the same line.
es: Use «O» para moverse hacia el otro final de la misma línea.

source: *04.5* Moving text
es: *04.5* Mover texto

source: When you delete something with the "d", "x", or another command, the text is saved.
es: Cuando elimina algo con «d», «x», u otra orden, el texto se guarda.

source: You can paste it back by using the p command.
es: Puede pegarlo usando la orden «p».

source: (The Vim name for this is put).
es: (El nombre de Vim para esto es «poner», del inglés «put»).

source: Take a look at how this works.
es: Échale un vistazo a cómo funciona esto.

source: First you will delete an entire line, by putting the cursor on the line you want to delete and typing "dd".
es: Elimine primero una línea completa poniendo el cursor en la línea y pulsando «dd».

source: Now you move the cursor to where you want to put the line and use the "p" (put) command.
es: Mueva ahora el cursor allá donde quiera poner la línea y use la orden «p».

source: The line is inserted on the line below the cursor.
es: La línea se insertará en la línea siguiente a donde se encuentra el cursor.

source: a line a line a line line 2 dd line 3 p line 3 line 3 line 2
es: una línea una línea una línea línea 2 dd línea 3 p línea 3 línea 3 línea 2

source: Because you deleted an entire line, the "p" command placed the text line below the cursor.
es: Ya que eliminó una línea completa, la orden «p» colocó la línea de texto debajo del cursor.

source: If you delete part of a line (a word, for instance), the "p" command puts it just after the cursor.
es: Si elimina parte de una línea (una palabra, por ejemplo), la orden «px la pone justo después del cursor.

source: The "P" command puts text like "p", but before the cursor.
es: La orden «P» pone una línea como «p», pero antes del cursor.

source: When you deleted a whole line with "dd", "P" will put it back above the cursor.
es: Cuando elimine una línea con «dd», «P» lo pondrá de vuelta sobre el cursor.

source: When you deleted a word with "dw", "P" will put it back just before the cursor.
es: Cuando elimine una palabra con «dw», «P» lo pondrá antes del cursor.

source: You can repeat putting as many times as you like.
es: Puede repetir la orden tantas veces como quiera.

source: The same text will be used.
es: Se usará el mismo texto.

source: You can use a count with "p" and "P".
es: Puede usar un multiplicador con «p» y «P».

source: The text will be repeated as many times as specified with the count.
es: El texto se repetirá tantas veces como especifique con el multiplicador.

source: Thus "dd" and then "3p" puts three copies of the same deleted line.
es: Por ejemplo, usar «dd» y luego «3p» pone tres copias de la misma línea eliminada.

source: Frequently when you are typing, your fingers get ahead of your brain (or the other way around?).
es: Más de una vez, mientras teclea, sus dedos irán por delante de su cerebro (¿o al revés?).

source: The result is a typo such as "teh" for "the".
es: El resultado es un error del tipo «uqe» en lugar de «que».

source: Vim makes it easy to correct such problems.
es: Vim hace que corregir estos problemas sea sencillo.

source: Just put the cursor on the e of "teh" and execute the command "xp".
es: Simplemente ponga el cursor sobre la «u» de «uqe» y ejecute la orden «xp».

source: This works as follows: "x" deletes the character e and places it in a register.
es: Esto funciona del siguiente modo: «x» elimina el carácter «u» y lo coloca en un registro.

source: "p" puts the text after the cursor, which is after the h.
es: «p» pone el texto después del cursor, justo después de la «q».

source: teh th the ~ x p
es: uqe qe que ~ x p

source: *04.6* Copying text
es: *04.6* Copiar texto

source: To copy text from one place to another, you could delete it, use "u" to undo the deletion and then "p" to put it somewhere else.
es: Para copiar texto de un lugar a otro, puede eliminarlo, usar «u» para deshacer la eliminación y después usar «p» para colocarlo en otro lugar.

source: There is an easier way: yanking.
es: Hay un modo mejor: «yank» (dar un tirón).

source: The "y" operator copies text into a register.
es: El operador «y» copia texto en un registro.

source: Then a "p" command can be used to put it.
es: Puede usar una orden «p» para ponerlo.

source: Yanking is just a Vim name for copying.
es: «Yanking» es simplemente el nombre de Vim para copiar.

source: The "c" letter was already used for the change operator, and "y" was still available.
es: La letra «c» ya estaba en uso por el operador «cambiar», y la «y» estaba aún disponible.

source: Calling this operator "yank" made it easier to remember to use the "y" key.
es: Llamar a este el operador «yank» hizo que fuera más fácil recordar la «y».

source: Since "y" is an operator, you use "yw" to yank a word.
es: Ya que «y» es un operador, se usa «yw» para copiar una palabra.

source: A count is possible as usual.
es: Se puede usar un multiplicador.

source: To yank two words use "y2w".
es: Para copiar dos palabras usa «y2w».

source: Notice that "yw" includes the white space after a word.
es: Observe que «yw» incluye el espacio en blanco después de la palabra.

source: If you don't want this, use "ye".
es: Si no quiere que esto ocurra, us «ye».

source: The "yy" command yanks a whole line, just like "dd" deletes a whole line.
es: La orden «yy» copia una sola línea, al igual que «dd» la elimina.

source: Unexpectedly, while "D" deletes from the cursor to the end of the line, "Y" works like "yy", it yanks the whole line.
es: Sin embargo, mientras que «D» elimina desde el cursor hasta el final de la línea, «Y» funciona como «yy», copiando la línea completa.

source: Watch out for this inconsistency!
es: ¡Cuidado con esta inconsistencia!

source: Use "y$" to yank to the end of the line.
es: Use «y$» para copiar sólo hasta el final.

source: a text line yy a text line a text line line 2 line 2 p line 2 last line last line a text line last line
es: línea de texto yy línea de texto línea de texto línea 2 línea 2 p línea 2 última línea última línea línea de texto última línea

source: *04.7* Using the clipboard
es: *04.7* Uso del portapapeles

source: If you have copied text to the clipboard in another application, you can paste it in Vim with the Edit/Paste menu.
es: Si ha copiado texto en el portapapeles desde otra aplicación, puede pegarlo en Vim con el menú Editar/Pegar.

source: This works in Normal mode and Insert mode.
es: Esto funciona en modo Normal y en modo Insertar.

source: In Visual mode the selected text is replaced with the pasted text.
es: En modo Visual el texto seleccionado es reemplazado.

source: The "Cut" menu item deletes the text before it's put on the clipboard.
es: La opción «Cortar» del menú elimina el texto antes de ponerlo en el portapapeles.

source: The "Copy", "Cut" and "Paste" items are also available in the popup menu (only when there is a popup menu, of course).
es: Las opciones «Cortar», «Copiar» y «Pegar» están también disponibles en el menú contextual (sólo cuando esté disponible).

source: If your Vim has a toolbar, you can also find these items there.
es: Si su Vim tiene barra de tareas, puede encontrar estos botones allí también.

source: If you are not using the GUI, or if you don't like using a menu, you have to use another way.
es: Si no usa la GUI o no te gusta usar el menú, tiene otro modo.

source: You use the normal "y" (yank) and "p" (put) commands, but prepend "* (double-quote star) before it.
es: Use la orden «y» normal (copiar) y «p» (poner), pero antes escriba «"*» (comillas dobles, asterisco).

source: To copy a line to the clipboard: >
es: Para copiar una línea en el portapapeles: >

source: This only works on versions of Vim that include clipboard support.
es: Esto sólo funciona en versiones de Vim que incluyen soporte para portapapeles.

source: More about the clipboard in section |09.3| and here: |clipboard|.
es: Más sobre el portapapeles en la sección |09.3| y aquí: |clipboard|.

source: *04.8* Text objects
es: *04.8* Objetos de texto

source: If the cursor is in the middle of a word and you want to delete that word, you need to move back to its start before you can do "dw".
es: Si el cursor está en medio de una palabra y la quiere eliminar, tiene que desplazarse hasta su comienzo antes de que pueda hacer «dw».

source: There is a simpler way to do this: "daw".
es: Hay un modo más sencillo de hacer esto: «daw».

source: this is some example text.
es: esto es texto de ejemplo.

source: this is some text.
es: esto es de ejemplo.

source: The "d" of "daw" is the delete operator.
es: La «d» de «daw» es el operador de eliminación.

source: "aw" is a text object.
es: «aw» es el objeto de texto.

source: Hint: "aw" stands for "A Word".
es: Truco: «aw» viene de «A Word».

source: Thus "daw" is "Delete A Word".
es: Por lo que «daw» es «Delete A Word».

source: To be precise, the white space after the word is also deleted (the white space before the word at the end of the line).
es: Para ser más precisos, el espacio después de la palabra se elimina también (el espacio antes de la palabra si ésta se encuentra al final de una línea).

source: To change a whole sentence use "cis".
es: Para cambiar una oración completa use «cis».

source: Take this text:
es: Suponga este texto:

source: This ~ is an example.
es: Esto ~ es un ejemplo.

source: Move to the start of the second line, on "is an".
es: Vaya al comienzo de la segunda línea, sobre el «es un».

source: Now use "cis":
es: Ahora, use «cis»:

source: The cursor is in between the blanks in the first line.
es: El cursor está entre los espacios de la primera línea.

source: Now you type the new sentence "Another line.":
es: Escriba ahora la nueva frase «Otra línea.»:

source: Another line.
es: Otra línea.

source: "cis" consists of the "c" (change) operator and the "is" text object.
es: «cis» consiste del operador «c» (cambiar) y el objeto de texto «is».

source: This stands for "Inner Sentence".
es: Esto viene de «Inner Sentence».

source: There is also the "as" (a sentence) object.
es: También hay un objeto «as» (a sentence).

source: The difference is that "as" includes the white space after the sentence and "is" doesn't.
es: La diferencia es que «as» incluye el espacio en blanco después de la frase e «is» no.

source: If you would delete a sentence, you want to delete the white space at the same time, thus use "das".
es: Si desea eliminar la frase y quiere eliminar al mismo tiempo el espacio en blanco posterior, use entonces «das».

source: If you want to type new text the white space can remain, thus you use "cis".
es: Si quiere escribir otro texto, el espacio puede permanecer, con lo que puedes usar «cis».

source: You can also use text objects in Visual mode.
es: También puede usar los objetos de texto on modo Visual.

source: It will include the text object in the Visual selection.
es: Incluirá el objeto de texto en la selección.

source: Visual mode continues, thus you can do this several times.
es: El modo Visual permanece, así que puede hacerlo varias veces.

source: For example, start Visual mode with "v" and select a sentence with "as".
es: Por ejemplo, inicie el modo Visual con «v» y seleccione una frase con «as».

source: Now you can repeat "as" to include more sentences.
es: Ahora puede repetir «as» para incluir más frases.

source: Finally you use an operator to do something with the selected sentences.
es: Por último, use un operador para hacer algo con las frases seleccionadas.

source: *04.9* Replace mode
es: *04.9* Modo reemplazar

source: The "R" command causes Vim to enter replace mode.
es: La orden «R» hace que Vim entre en modo reemplazar.

source: In this mode, each character you type replaces the one under the cursor.
es: En este modo, cada carácter que introduzca reemplaza al que está debajo del cursor.

source: This continues until you type <Esc>.
es: Esto continúa hasta que pulse <Esc>.

source: In this example you start Replace mode on the first "t" of "text":
es: En este ejemplo, Ud. comienza el modo Reemplazar en la primera «t» de «texto»:

source: This is text.
es: Esto es texto.

source: ~ Rinteresting.<Esc>
es: ~ Rinteresante.<Esc>

source: This is interesting.
es: Esto es interesante.

source: You may have noticed that this command replaced 5 characters in the line with twelve others.
es: Puede que haya notado que ha reemplazado 5 caracteres en la línea con otros doce.

source: The "R" command automatically extends the line if it runs out of characters to replace.
es: La orden «R» extiende automáticamente la línea si se queda sin caracteres que reemplazar.

source: It will not continue on the next line.
es: Esto no ocurrirá en la siguiente línea.

source: When you use <BS> (backspace) to make correction, you will notice that the old text is put back.
es: Cuando use <Retroceso> para hacer una corrección comprobará que el texto anterior reaparece.

source: Thus it works like an undo command for the last typed character.
es: Por lo tanto, funciona como la orden deshacer para el último carácter tecleado.

source: *04.10* Conclusion
es: *04.10* Conclusión

source: The operators, movement commands and text objects give you the possibility to make lots of combinations.
es: Los operadores, órdenes de movimiento y los objetos de texto le dan múltiples posibilidades para hacer muchas combinaciones.

source: Now that you know how it works, you can use N operators with M movement commands to make N * M commands!
es: Ahora que sabe cómo funciona, puede usar N operadores con M órdenes de movimiento para hacer M * N órdenes!

source: For example, there are many other ways to delete pieces of text.
es: Por ejemplo, hay otras muchas maneras de eliminar porciones de texto.

source: Here are a few often used ones:
es: Aquí tiene algunas de las más empleadas:

source: x delete character under the cursor (short for "dl") X delete character before the cursor (short for "dh") D delete from cursor to end of line (short for "d$") dw delete from cursor to next start of word db delete from cursor to previous start of word diw delete word under the cursor (excluding white space) daw delete word under the cursor (including white space) dG delete until the end of the file dgg delete until the start of the file
es: x elimina el carácter bajo el cursor (abreviado de "dl") X elimina el carácter antes del cursor (abreviado de "dh") D elimina desde el cursor hasta el final de línea (abreviado de "d$") dw elimina desde el cursor hasta el próximo comienzo de palabra db elimina desde el cursor hasta el anterior comienzo de palabra diw elimina la palabra bajo el cursor (excluyendo el espacio en blanco) daw elimina la palabra bajo el cursor (incluyendo el espacio en blanco) dG elimina hasta el final del archivo dgg elimina hasta el final del archivo

source: If you use "c" instead of "d" they become change commands.
es: Si usa «c» en lugar de «d»,estos se convierten en órdenes de cambio.

source: And with "y" you yank the text.
es: Y con «y» copias el texto.

source: And so forth.
es: Y así en adelante.

source: ~ change case of the character under the cursor, and move the cursor to the next character.
es: ~ cambia el carácter bajo el cursor de minúsculas a mayúsculas y al revés, moviéndose al siguiente carácter.

source: This is not an operator (unless 'tildeop' is set), thus you can't use it with a motion command.
es: No es un operador (a menos que 'tildeop' esté activado), por lo que no lo puede usar con un movimiento.

source: It does work in Visual mode and changes case for all the selected text then.
es: Sí funciona en modo Visual y cambia todo lo que está seleccionado.

source: I Start Insert mode after moving the cursor to the first non-blank in the line.
es: I Inicia el modo insertar y desplaza el cursor al primer carácter no vacío de la línea.

source: A Start Insert mode after moving the cursor to the end of the line.
es: A Inicia el modo insertar y desplaza el cursor al último carácter de la línea.

source: *usr_03.txt* For Vim version 7.3.
es: *usr_03.esx* Para Vim version 7.3.

source: Moving around
es: Desplazamiento

source: Before you can insert or delete text the cursor has to be moved to the right place.
es: Antes de que pueda insertar o eliminar texto, el cursor tiene que desplazarse al lugar adecuado.

source: Vim has a large number of commands to position the cursor.
es: Vim tiene una gran cantidad de órdenes para situar el cursor.

source: This chapter shows you how to use the most important ones.
es: Este capítulo muestra cómo usar los más importantes.

source: You can find a list of these commands below |Q_lr|.
es: Puede encontrar una lista de estas órdenes a continuación |Q_lr|.

source: |03.1| Word movement |03.2| Moving to the start or end of a line |03.3| Moving to a character |03.4| Matching a parenthesis |03.5| Moving to a specific line |03.6| Telling where you are |03.7| Scrolling around |03.8| Simple searches |03.9| Simple search patterns |03.10| Using marks
es: |03.1| Desplazarse sobre palabras |03.2| Desplazarse al principio o al final de la línea |03.3| Desplazarse a un carácter |03.4| Emparejar un paréntesis |03.5| Desplazarse a una línea específica |03.6| Indicar dónde estás |03.7| Desplazar el texto |03.8| Búsquedas simples |03.9| Patrones sencillos de búsqueda |03.10| Uso de marcadores o marcas

source: Next chapter: |usr_04.txt| Making small changes Previous chapter: |usr_02.txt| The first steps in Vim Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_04.esx| Hacer cambios pequeños Capítulo anterior: |usr_02.esx| Primeros pasos en Vim Tabla de contenidos: |usr_toc.esx|

source: *03.1* Word movement
es: *03.1* Desplazarse sobre palabras

source: To move the cursor forward one word, use the "w" command.
es: Para mover el cursor una palabra hacia delante, use la orden «w».

source: Like most Vim commands, you can use a numeric prefix to move past multiple words.
es: Del mismo modo que la mayoría de órdenes Vim, puede usar un prefijo numérico.

source: For example, "3w" moves three words.
es: Por ejemplos, «3w» se mueve tres palabras.

source: This figure shows how it works:
es: Esta figura muestra cómo funciona:

source: This is a line with example text ~ --->-->->-----------------> w w w 3w
es: Ésta es una línea con texto de ejemplo ~ --->-->--->---------------> w w w 3w

source: Notice that "w" moves to the start of the next word if it already is at the start of a word.
es: Fíjese en que «w» le mueve al comienzo de la siguiente palabra si ya se encuentra al comienzo de una palabra.

source: The "b" command moves backward to the start of the previous word:
es: La orden «b» le desplaza al comienzo de la palabra anterior:

source: This is a line with example text ~ <----<--<-<---------<--- b b b 2b b
es: Ésta es una línea con texto de ejemplo ~ <----<--<---<---------<--- b b b 2b b

source: This is a line with example text ~ <- <--- -----> ----> ge ge e e
es: Ésta es una línea con texto de ejemplo ~ <- <--- -----> ----> ge ge e e

source: A word ends at a non-word character, such as a ".", "-" or ")".
es: Una palabra termina en un carácter de separación, como «.», «-» o «)».

source: To change what Vim considers to be a word, see the 'iskeyword' option.
es: Para cambiar lo que Vim considera una palabra, consulte la opción 'iskeyword'.

source: It is also possible to move by white-space separated WORDs.
es: También es posible desplazarse por palabras separadas por espacios en blanco.

source: This is not a word in the normal sense, that's why the uppercase is used.
es: Esto no es una PALABRA en el sentido habitual, por ello se usan las mayúsculas para designarla.

source: The commands for moving by WORDs are also uppercase, as this figure shows:
es: Las órdenes para desplazarse por PALABRAS están también en mayúsculas, como muestra la siguiente figura:

source: ge b w e <- <- ---> ---> This is-a line, with special/separated/words (and some more).
es: ge b w e <- <- ---> ---> Ésta es-una línea, con palabras separadas/de forma/especial (y algo más).

source: *03.2* Moving to the start or end of a line
es: *03.2* Desplazarse al principio o al final de la línea

source: The "$" command moves the cursor to the end of a line.
es: La orden «$» mueve el cursor al final de la línea.

source: If your keyboard has an <End> key it will do the same thing.
es: Si su teclado tiene la tecla <Fin>, conseguirá el mismo resultado pulsándola.

source: The "^" command moves to the first non-blank character of the line.
es: La orden «^» le lleva hacia el primer carácter no vacío de la línea.

source: The "0" command (zero) moves to the very first character of the line.
es: La orden «0» (cero) le mueve al primer carácter de la línea.

source: The <Home> key does the same thing.
es: La tecla <Inicio> hace lo mismo.

source: In a picture:
es: En una imagen:

source: ^ <------------ .....This is a line with example text ~ <----------------- ---------------> 0 $
es: ^ <------------ .....Ésta es una línea con texto de ejemplo ~ <----------------- ---------------> 0 $

source: The "$" command takes a count, like most movement commands.
es: La orden «$» admite un multiplicador, como la mayoría de órdenes de evento.

source: But moving to the end of the line several times doesn't make sense.
es: Pero moverse hacia el final de la línea varias veces no tiene sentido.

source: Therefore it causes the editor to move to the end of another line.
es: Por lo tanto, lo que hace es moverle hacia el final de la siguiente línea.

source: For example, "1$" moves you to the end of the first line (the one you're on), "2$" to the end of the next line, and so on.
es: Por ejemplo, «1$» le mueve hacia el final de la primera línea (en la que está), «2$» te mueve al final de la siguiente línea, y así en adelante.

source: The "0" command doesn't take a count argument, because the "0" would be part of the count.
es: La orden «0» no admite ningún multiplicador, porque el «0» podría ser parte del número.

source: Unexpectedly, using a count with "^" doesn't have any effect.
es: Usar un multiplicador con «^» tampoco tiene ningún efecto.

source: *03.3* Moving to a character
es: *03.3* Desplazarse a un carácter

source: One of the most useful movement commands is the single-character search command.
es: Uno de las órdenes de movimiento más útiles es la orden de búsqueda de un único carácter.
