Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: It is used for mappings which the user might want to map a key sequence to.
es: Se usa para macros que el usuario pueda querer ligar a un secuencia de teclas.

source: <Plug> is a special code that a typed key will never produce.
es: <Plug> es un código especial que una tecla nunca podrá producir.

source: To make it very unlikely that other plugins use the same sequence of characters, use this structure: <Plug> scriptname mapname In our example the scriptname is "Typecorr" and the mapname is "Add".
es: Para evitar que otras extensiones usen la misma secuencia de caracteres, use la estructura: <Plug> nombre-script nombre-macro En nuestro ejemplo, el nombre del script es «Correccort», y el nombre de la macro es «Añadir».

source: This results in "<Plug>TypecorrAdd".
es: El resultado es «<Plug>CorreccortAñadir».

source: Only the first character of scriptname and mapname is uppercase, so that we can see where mapname starts.
es: Solo el primer carácter de los nombres es mayúscula, facilitando ver el principio del nombre de la macro.

source: <SID> is the script ID, a unique identifier for a script.
es: <SID> es el identificador (ID) del script, un número único.

source: Internally Vim translates <SID> to "<SNR>123_", where "123" can be any number.
es: Internamente, Vim traduce <SID> como «<SNR>123_», donde «123» puede ser cualquier número.

source: Thus a function "<SID>Add()" will have a name "<SNR>11_Add()" in one script, and "<SNR>22_Add()" in another.
es: Por ello, la función «<SID>Anadir()» tendría el nombre «<SNR>11_Anadir()» en un script, y «<SNR>22_Anadir()» en otro.

source: You can see this if you use the ":function" command to get a list of functions.
es: Puede verlo si usa la orden «:function» para obtener la lista de funciones.

source: The translation of <SID> in mappings is exactly the same, that's how you can call a script-local function from a mapping.
es: La traducción de <SID> en las macros es idéntica, y así puede invocar una función local de un script mediante una macro.

source: 38 if !exists(":Correct") 39 command -nargs=1 Correct :call s:Add(<q-args>, 0) 40 endif
es: 38 if !exists(":Corregir") 39 command -nargs=1 Corregir :call s:Anadir(<q-args>, 0) 40 endif

source: The user command is defined only if no command with the same name already exists.
es: La orden de usuario se define únicamente si no existe una orden con el mismo nombre.

source: Otherwise we would get an error here.
es: En caso contrario, provocaría un error.

source: Overriding the existing user command with ":command!" is not a good idea, this would probably make the user wonder why the command he defined himself doesn't work.
es: Sobrescribir la orden de usuario existente con «:command!» no es una buena idea, ya que haría que el usuario se pregunte porqué no funciona la orden que ha definido.

source: The fun is that these variables can also be used in functions, autocommands and user commands that are defined in the script.
es: Lo interesante es que estas variables se pueden usar en funciones, órdenes automáticas y órdenes de usuario definidas en el script.

source: In our example we can add a few lines to count the number of corrections: >
es: En nuestro ejemplo, añadimos unas pocas líneas para contar el número de correcciones: >

source: 19 let s:count = 4 ..
es: 19 let s:cuenta = 4 ..

source: 30 function s:Add(from, correct) ..
es: 30 function s:Anadir(desde, correccion) ..

source: 34 let s:count = s:count + 1 35 echo s:count .
es: 34 let s:cuenta = s:cuenta + 1 35 echo s:cuenta .

source: " corrections now" 36 endfunction
es: " correcciones en este punto" 36 endfunction

source: First s:count is initialized to 4 in the script itself.
es: Al principio, «s:cuenta» se inicializa en el mismo script con un valor de 4.

source: When later the s:Add() function is called, it increments s:count.
es: Al invocar la función «Anadir()» posteriormente, incrementa la variable «s:cuenta».

source: It doesn't matter from where the function was called, since it has been defined in the script, it will use the local variables from this script.
es: No importa desde dónde se ha invocado la función, ya que está definida en el script, y usará las variables locales al script.

source: Line 33 wasn't explained yet.
es: Aún no hemos explicado la línea 33.

source: It applies the new correction to the word under the cursor.
es: Aplica la nueva corrección a la palabra bajo el cursor.

source: The |:normal| command is used to use the new abbreviation.
es: La orden |:normal| se emplea para usar la nueva abreviatura.

source: Note that mappings and abbreviations are expanded here, even though the function was called from a mapping defined with ":noremap".
es: Tenga en cuenta que aquí se expanden las macros y abreviaturas, a pesar de que la función se ha invocado desde una macro definida con «:noremap».

source: Using "unix" for the 'fileformat' option is recommended.
es: Se recomienda usar «unix» como valor para la opción 'fileformat'.

source: The Vim scripts will then work everywhere.
es: De esta forma, los scripts de Vim funcionarán en cualquier sistema.

source: Scripts with 'fileformat' set to "dos" do not work on Unix.
es: Los scripts con 'fileformat' definido como «dos» no funcionarán en Unix.

source: Also see |:source_crnl|.
es: También puede consultar |:source_crnl|.

source: To be sure it is set right, do this before writing the file: >
es: Para asegurar que hace lo correcto, haga lo siguiente antes de escribir el archivo: >

source: DOCUMENTATION *write-local-help*
es: DOCUMENTACIÓN *write-local-help*

source: 1 *typecorr.txt* Plugin for correcting typing mistakes 2 3 If you make typing mistakes, this plugin will have them corrected 4 automatically.
es: 1 *correcort.txt* Una extensión para corregir errores ortográficos 2 3 Esta extensión corrige automáticamente cualquier error ortográfico 4 que pueda escribir.

source: 5 6 There are currently only a few corrections.
es: 5 6 Solo hay unas pocas correcciones.

source: Add your own if you like.
es: Puede añadir las suyas.

source: 7 8 Mappings: 9 <Leader>a or <Plug>TypecorrAdd 10 Add a correction for the word under the cursor.
es: 7 8 Macros: 9 <Leader>a o <Plug>CorreccortAñadir 10 Añade una corrección para la palabra bajo el cursor.

source: 11 12 Commands: 13 :Correct {word} 14 Add a correction for {word}.
es: 11 12 Órdenes: 13 :Corregir {palabra} 14 Añade una corrección para {palabra}.

source: 15 16 *typecorr-settings* 17 This plugin doesn't have any settings.
es: 15 16 *correcort-opciones* 17 Esta extensión no tiene opciones de configuración.

source: The first line is actually the only one for which the format matters.
es: En realidad, la primera línea es la única en la que el formato importa.

source: It will be extracted from the help file to be put in the "LOCAL ADDITIONS:" section of help.txt |local-additions|.
es: Se extraerá del archivo de ayuda para su ubicación en la sección «LOCAL ADDITIONS:» de help.txt |local-additions|.

source: The first "*" must be in the first column of the first line.
es: El primer asterisco debe estar en la primera columna de la primera línea.

source: After adding your help file do ":help" and check that the entries line up nicely.
es: Ejecute «:help» después de añadir su archivo de ayuda y compruebe que las entradas están alineadas adecuadamente.

source: Using references to other parts of the help in || is recommended.
es: Se recomienda utilizar referencias a otras partes de archivos de ayuda mediante barras, ||.

source: This makes it easy for the user to find associated help.
es: Esto facilita que el usuario encuentre ayuda relacionada.

source: FILETYPE DETECTION *plugin-filetype*
es: EXTENSIÓN DE TIPO DE ARCHIVO *plugin-filetype*

source: If your filetype is not already detected by Vim, you should create a filetype detection snippet in a separate file.
es: Si Vim no detecta su tipo de archivo, debería crear un fragmento de código de detección de tipo de archivo en un archivo separado.

source: It is usually in the form of an autocommand that sets the filetype when the file name matches a pattern.
es: Habitualmente, tiene la forma de una orden automática que define el tipo de archivo cuando su nombre concuerda con un patrón.

source: Write this single-line file as "ftdetect/foofoo.vim" in the first directory that appears in 'runtimepath'.
es: Escriba este archivo de una sola línea como «ftdetect/foofoo.vim» en el primer directorio que aparece en su 'runtimepath'.

source: For Unix that would be "~/.vim/ftdetect/foofoo.vim".
es: En Unix, sería «~/.vim/ftdetect/foofoo.vim».

source: The convention is to use the name of the filetype for the script name.
es: La convención es nombrar el script como el nombre del tipo de archivo.

source: You can make more complicated checks if you like, for example to inspect the contents of the file to recognize the language.
es: Si lo desea, puede hacer comprobaciones más complejas como inspeccionar los contenidos de un archivo para reconocer el tipo del mismo.

source: Also see |new-filetype|.
es: Consulte también |new-filetype|.

source: SUMMARY *plugin-special*
es: RESUMEN *plugin-special*

source: s:name Variables local to the script.
es: s:nombre Variables locales al script.

source: <SID> Script-ID, used for mappings and functions local to the script.
es: <SID> El identificador del script (Script-ID), utilizado en macros y funciones locales al script.

source: hasmapto() Function to test if the user already defined a mapping for functionality the script offers.
es: hasmapto() Una función que comprueba si el usuario ya ha definido una macro para la funcionalidad que el script ofrece.

source: <Leader> Value of "mapleader", which the user defines as the keys that plugin mappings start with.
es: <Leader> El valor de «mapleader», que el usuario define como las teclas con las que iniciar las macros de extensiones.

source: :map <unique> Give a warning if a mapping already exists.
es: ::map <unique> Emite un aviso si la macro ya existe.

source: :noremap <script> Use only mappings local to the script, not global mappings.
es: :noremap <script> Sólo usa macros locales al script, no macros globales.

source: exists(":Cmd") Check if a user command already exists.
es: exists(":Orden") Comprueba la existencia de una orden de usuario.

source: *41.12* Writing a filetype plugin *write-filetype-plugin* *ftplugin*
es: *write-filetype-plugin* *ftplugin* *41.12* Escribir extensiones de tipo de archivo

source: A filetype plugin is like a global plugin, except that it sets options and defines mappings for the current buffer only.
es: Una extensión de tipo de archivo («filetype plugin») es como una extensión global, a diferencia de que define opciones y macros que solo afectan al búfer local.

source: See |add-filetype-plugin| for how this type of plugin is used.
es: Para saber más acerca del uso de este tipo de extensión, consulte |add-filetype-plugin|.

source: First read the section on global plugins above |41.11|.
es: En primer lugar, consulte la sección anterior sobre extensiones globales, |41.11|.

source: All that is said there also applies to filetype plugins.
es: Todo lo detallado ahí también afecta a las extensiones de tipo de archivo.

source: There are a few extras, which are explained here.
es: Hay algunos elementos adicionales, que se explican aquí.

source: The essential thing is that a filetype plugin should only have an effect on the current buffer.
es: Lo esencial es que una extensión de tipo de archivo sólo debe tener efecto en el búfer actual.

source: If you are writing a filetype plugin to be used by many people, they need a chance to disable loading it.
es: Si esta escribiendo una extensión de tipo de archivo que mucha gente usará, necesitarán la capacidad de desactivar su carga.

source: Put this at the top of the plugin: >
es: Inserte lo siguiente al principio de la extensión: >

source: " Only do this when not done yet for this buffer if exists("b:did_ftplugin") finish endif let b:did_ftplugin = 1
es: " Solo hace esto cuando aún no ha finalizado con este búfer if exists("b:did_ftplugin") finish endif let b:did_ftplugin = 1

source: Now write this in the "after" directory, so that it gets sourced after the distributed "vim.vim" ftplugin |after-directory|.
es: Escriba esto en el directorio «after», para que se lea después de la extensión de tipo de archivo predeterminado distribuido, «vim.vim» |after-directory|.

source: For Unix this would be "~/.vim/after/ftplugin/vim.vim".
es: En sistemas Unix, sería «~/.vim/after/ftplugin/vim.vim».

source: Note that the default plugin will have set "b:did_ftplugin", but it is ignored here.
es: Tenga en cuenta que la extensión predeterminada habrá definido «b:did_ftplugin», pero aquí se ignora.

source: When an option has a value that is a list of flags or items, consider using "+=" and "-=" to keep the existing value.
es: Cuando una opción tiene un valor que es una lista de opciones o elementos, considere usar «+=» y «-=» para conservar el valor existente.

source: Be aware that the user may have changed an option value already.
es: Sea consciente de que puede que el usuario ya haya cambiado el valor de una opción.

source: First resetting to the default value and then changing it often a good idea.
es: Es una buena idea restablecer el valor original y después cambiarlo.

source: |hasmapto()| is used to check if the user has already defined a map to <Plug>JavaImport.
es: |hasmapto()| sirve para comprobar si el usuario ya ha definido una macro para «<Plug>JavaImport».

source: If not, then the filetype plugin defines the default mapping.
es: Si no ha sido definida, la extensión de tipo de archivo define la macro actual.

source: This starts with |<LocalLeader>|, which allows the user to select the key(s) he wants filetype plugin mappings to start with.
es: Esta empieza con |<LocalLeader>|, que permite al usuario seleccionar una o mas teclas con las que iniciar las macros de la extensión de tipo de archivo.

source: The default is a backslash.
es: El valor predeterminado es una barra inversa, «\».

source: "<unique>" is used to give an error message if the mapping already exists or overlaps with an existing mapping.
es: «<unique>» sirve para emitir un mensaje de error si la macro ya existe o entra en conflicto con otra.

source: |:noremap| is used to avoid that any other mappings that the user has defined interferes.
es: |:noremap| sirve para evitar que las macros definidas por el usuario interfieran.

source: You might want to use ":noremap <script>" to allow remapping mappings defined in this script that start with <SID>.
es: Puede que desee usar «:noremap <script>» para permitir redefinir macros en el script que comienza con <SID>.

source: The user must have a chance to disable the mappings in a filetype plugin, without disabling everything.
es: Tiene que ofrecer al usuario la opción de desactivar macros en una extensión de tipo de archivo, sin desactivar el resto.

source: Here is an example of how this is done for a plugin for the mail filetype: >
es: Aquí tiene un ejemplo de como hacerlo con una extensión para el tipo de archivo mail: >

source: " Add mappings, unless the user didn't want this.
es: " Añade macros, a menos que el usuario defina lo contrario.

source: if !exists("no_plugin_maps") && !exists("no_mail_maps") " Quote text by inserting "> " if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif
es: if !exists("no_plugin_maps") && !exists("no_mail_maps") " Cita el texto insertando «> » if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif

source: Two global variables are used: no_plugin_maps disables mappings for all filetype plugins no_mail_maps disables mappings for a specific filetype
es: Se utilizan dos variables globales: no_plugin_maps desactiva las macros de todas las extensiones de tipo de archivo no_mail_maps desactiva las macros para un tipo de archivo particular

source: To add a user command for a specific file type, so that it can only be used in one buffer, use the "-buffer" argument to |:command|.
es: El argumento «-buffer» de |:command| permite añadir una orden de usuario para un tipo de archivo específico y que solo afecta al búfer local.

source: When defining a function, this only needs to be done once.
es: Cada función necesita ser definida una sola vez.

source: But the filetype plugin will be sourced every time a file with this filetype will be opened.
es: Pero la extensión de tipo de archivo se cargará cada vez que se abra un archivo del tipo correspondiente.

source: This construct makes sure the function is only defined once: >
es: Esta estructura asegura que la función se defina una sola vez: >

source: UNDO *undo_ftplugin*
es: DESHACER *undo_ftplugin*

source: When the user does ":setfiletype xyz" the effect of the previous filetype should be undone.
es: Cuando el usuario hace «:setfiletype xyz», el efecto del tipo de archivo anterior debería desaparecer.

source: Set the b:undo_ftplugin variable to the commands that will undo the settings in your filetype plugin.
es: Defina la variable «b:undo_ftplugin» con las órdenes que deshacen los cambios de configuración de su extensión de tipo de archivo.

source: Using ":setlocal" with "<" after the option name resets the option to its global value.
es: Usar «:setlocal» con «<» después del nombre de la opción restablece la opción a su valor global.

source: That is mostly the best way to reset the option value.
es: Habitualmente, es la mejor forma de restablecer el valor de una opción.

source: The filetype must be included in the file name |ftplugin-name|.
es: El nombre del archivo debe incluir el tipo de archivo |ftplugin-name|.

source: Use one of these three forms:
es: Puede usar una de las tres formas a continuación:

source: .../ftplugin/stuff.vim .../ftplugin/stuff_foo.vim .../ftplugin/stuff/bar.vim
es: .../ftplugin/algo.vim .../ftplugin/algo_foo.vim .../ftplugin/algo/bar.vim

source: SUMMARY *ftplugin-special*
es: RESUMEN *ftplugin-special*

source: <LocalLeader> Value of "maplocalleader", which the user defines as the keys that filetype plugin mappings start with.
es: <LocalLeader> El valor de «maplocalleader», que el usuario define como la tecla que inicia las macros de extensión de tipo de archivo.

source: :map <buffer> Define a mapping local to the buffer.
es: :map <buffer> Define una macro local al búfer.

source: :noremap <script> Only remap mappings defined in this script that start with <SID>.
es: :noremap <script> Sólo modifica macros definidas en el script que comienzan con <SID>.

source: :setlocal Set an option for the current buffer only.
es: :setlocal Define una opción para el búfer actual.

source: :command -buffer Define a user command local to the buffer.
es: :command -buffer Define una orden de usuario local al búfer.

source: exists("*s:Func") Check if a function was already defined.
es: exists("*s:Funcion") Comprueba si una función ya se ha definido anteriormente.

source: *41.13* Writing a compiler plugin *write-compiler-plugin*
es: *41.13* Escribir extensiones para compiladores *write-compiler-plugin*

source: A compiler plugin sets options for use with a specific compiler.
es: Una extensión de compilador define opciones a usar con un compilador específico.

source: The user can load it with the |:compiler| command.
es: El usuario puede cargarlo con la orden |:compiler|.

source: The main use is to set the 'errorformat' and 'makeprg' options.
es: El uso principal es definir las opciones 'errorformat' y 'makeprg'.

source: Easiest is to have a look at examples.
es: Lo más sencillo es ver unos ejemplos.

source: This command will edit all the default compiler plugins: >
es: Esta orden editará todas las extensiones de compilador predeterminadas: >

source: There are two special items about these files.
es: Hay dos aspectos a tener en cuenta con estas extensiones.

source: First is a mechanism to allow a user to overrule or add to the default file.
es: En primer lugar, deben contar con un mecanismo que permita al usuario anular o añadir cambios a la extensión.

source: The default files start with: >
es: Las extensiones predeterminadas comienzan con: >

source: When you write a compiler file and put it in your personal runtime directory (e.g., ~/.vim/compiler for Unix), you set the "current_compiler" variable to make the default file skip the settings.
es: Cuando escribe un archivo de compilador, y lo ubica en su directorio de ejecución personal (esto es, «~/.vim/compiler» en sistemas Unix), debe definir la variable «current_compiler» para que la extensión de compilador predeterminada evite hacer cambios en la configuración.

source: *:CompilerSet* The second mechanism is to use ":set" for ":compiler!" and ":setlocal" for ":compiler".
es: *:CompilerSet* El segundo mecanismo es usar «:set» con «:compiler!», y «:setlocal» con «:compiler».

source: Vim defines the ":CompilerSet" user command for this.
es: Para ello, Vim define la orden de usuario «:CompilerSet».

source: However, older Vim versions don't, thus your plugin should define it then.
es: Por otra parte, las versiones anteriores de Vim no cuentan de ella, y por ello su extensión debe definirlo.

source: This is an example: >
es: Aquí tiene un ejemplo: >

source: if exists(":CompilerSet") != 2 command -nargs=* CompilerSet setlocal <args> endif CompilerSet errorformat& " use the default 'errorformat' CompilerSet makeprg=nmake
es: if exists(":CompilerSet") != 2 command -nargs=* CompilerSet setlocal <args> endif CompilerSet errorformat& " usa 'errorformat' predeterminado CompilerSet makeprg=nmake

source: When you write a compiler plugin for the Vim distribution or for a system-wide runtime directory, use the mechanism mentioned above.
es: Use el mecanismo mostrado aquí cuando escriba una extensión de compilador para la distribución Vim o para un directorio de tiempo de ejecución del sistema.

source: When "current_compiler" was already set by a user plugin nothing will be done.
es: No se hará nada si «current_compiler» ya está definido por una extensión de usuario.

source: When you write a compiler plugin to overrule settings from a default plugin, don't check "current_compiler".
es: Cuando escribe una extensión de compilador para cambiar las opciones definidas por una extensión predeterminada, evite comprobar «current_compiler».

source: This plugin is supposed to be loaded last, thus it should be in a directory at the end of 'runtimepath'.
es: Esta extensión se debería cargar al final, y por ello debería estar en un directorio al final de 'runtimepath'.

source: For Unix that could be ~/.vim/after/compiler.
es: En sistemas Unix, podría ser «~/.vim/after/compiler».

source: *41.14* Writing a plugin that loads quickly *write-plugin-quickload*
es: *41.14* Escribir extensiones que carguen rápidamente *write-plugin-quickload*

source: A plugin may grow and become quite long.
es: Puede que una extensión crezca, y que sea demasiado larga.

source: The startup delay may become noticeable, while you hardly ever use the plugin.
es: Puede que el tiempo de carga empiece a hacerse notorio, y además, que usted apenas use la extensión.

source: Then it's time for a quickload plugin.
es: En este caso, hay que usar una extensión de carga rápida («quickload»).

source: The basic idea is that the plugin is loaded twice.
es: La idea principal es que la extensión se carga dos veces.
