Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: Notice the uppercase "P". The lowercase "p" puts the text after the cursor.
es: Observe que es una «P» mayúscula. La «p» minúscula la pone tras el cursor.

source: The "+ register is used for the real clipboard. For example, to copy the text from the cursor position until the end of the line to the clipboard: >
es: El registro "+ se usa para el verdadero portapapeles. Por ejemplo, para copiar el texto desde la posición del cursor hasta el final de línea: >

source: Remember, "y" is yank, which is Vim's copy command. To insert the contents of the real clipboard before the cursor: >
es: Recuerde, «y» es copiar («yank»). Para insertar los contenidos del verdadero portapapeles antes del cursor: >

source: *09.4* Select mode
es: *09.4* Modo Seleccionar

source: And now something that is used more often on MS-Windows than on X-Windows. But both can do it. You already know about Visual mode. Select mode is like Visual mode, because it is also used to select text. But there is an obvious difference: When typing text, the selected text is deleted and the typed text replaces it.
es: Ahora algo que se emplea más habitualmente en MS-Windows que en X-Windows. Aún así, ambos pueden hacerlo. Ya conoce el modo Visual. El modo Seleccionar es como el modo Visual, también empleado para la selección. Pero hay una diferencia básica: Cuando escriba texto, el texto seleccionado se elimina y el texto introducido lo sustituye.

source: Now use the mouse to select some text. It is highlighted like in Visual mode. Now press a letter. The selected text is deleted, and the single letter replaces it. You are in Insert mode now, thus you can continue typing.
es: A continuación, use el ratón para seleccionar algún texto. Se resaltará como con el modo Visual. Pulse ahora un carácter. El texto seleccionado se eliminará, y ese carácter lo reemplazará. Entrará en modo Insertar.

source: *usr_31.txt* For Vim version 7.3. Last change: 2007 May 08
es: *usr_31.esx* Para Vim versión 7.3. Último cambio: 8/6/2007

source: Exploiting the GUI
es: Sacar partido a la interfaz gráfica

source: Vim works well in a terminal, but the GUI has a few extra items. A file browser can be used for commands that use a file. A dialog to make a choice between alternatives. Use keyboard shortcuts to access menu items quickly.
es: Vim funciona bien en una terminal, pero la interfaz gráfica de usuario tiene algunos elementos adicionales. Un explorador de archivos para las órdenes que usan un archivo. Una ventana de diálogo para hacer una elección entre alternativas. Usar accesos directos de teclado para acceder rápidamente a los elementos en los menús.

source: |31.1| The file browser |31.2| Confirmation |31.3| Menu shortcuts |31.4| Vim window position and size |31.5| Various
es: |31.1| El explorador de archivos |31.2| Confirmación |31.3| Atajos de teclado para menús |31.4| Posición y tamaño de la ventana de Vim |31.5| Varios

source: Next chapter: |usr_32.txt| The undo tree Previous chapter: |usr_30.txt| Editing programs Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_32.esx| El árbol de deshacer Capítulo anterior: |usr_30.esx| Editar programas Tabla de contenidos: |usr_toc.esx|

source: *31.1* The file browser
es: *31.1* El explorador de archivos

source: When using the File/Open... menu you get a file browser. This makes it easier to find the file you want to edit. But what if you want to split a window to edit another file? There is no menu entry for this. You could first use Window/Split and then File/Open..., but that's more work. Since you are typing most commands in Vim, opening the file browser with a typed command is possible as well. To make the split command use the file browser, prepend "browse": >
es: Al usar el menú «Archivo/Abrir»... obtiene un explorador de archivos. Esto facilita ubicar el archivo que desea editar. ¿Pero y si desea dividir una ventana para editar otro archivo? No hay una entrada en el menú para esto. Puede usar primero «Ventana/Dividir» y luego «Archivo/Abrir»..., pero eso es más trabajo. Ya que está escribiendo la mayoría de las órdenes en Vim, abrir el explorador de archivos con una orden escrita también es posible. Para hacer que la orden de división use el explorador de archivos, anteponga «browse»: >

source: The ":browse" command can be prepended to just about any command that opens a file. If no directory is specified, Vim will decide where to start the file browser. By default it uses the same directory as the last time. Thus when you used ":browse split" and selected a file in "/usr/local/share", the next time you use a ":browse" it will start in "/usr/local/share" again. This can be changed with the 'browsedir' option. It can have one of three values:
es: La orden «:browse» puede ser antepuesta prácticamente a cualquier orden que abra un archivo. Si no se especifica un directorio, Vim será quien determine en qué directorio iniciar el explorador de archivos. De manera predeterminada se usa el mismo directorio usado la vez anterior. Así, si se usó «:browse split» y se seleccionó un archivo en «/usr/local/share», la próxima vez que use «:browse» se empezará desde «/usr/local/share» de nuevo. Esto se puede ajustar mediante la opción 'browsedir'. Dicha opción acepta uno de los tres siguientes valores:

source: last Use the last directory browsed (default) buffer Use the same directory as the current buffer current use the current directory
es: last Usar el último directorio visitado (predeterminado) buffer Usar el mismo directorio del búfer actual current Usar el directorio actual

source: Will start the browser in "/usr/local/share". Alternatively: >
es: Ejecutará el explorador de archivos desde «/usr/local/share». Por otro lado: >

source: Note: To avoid using the mouse, most file browsers offer using key presses to navigate. Since this is different for every system, it is not explained here. Vim uses a standard browser when possible, your system documentation should contain an explanation on the keyboard shortcuts somewhere.
es: Nota: Para evitar el uso del ratón, muchos de los exploradores de archivos ofrecen navegación mediante teclas. Ya que esto difiere de sistema a sistema, no se explica aquí. Vim usa un explorador estándar cuando es posible; la documentación del sistema que use debería contener una sección acerca de los accesos directos de teclado disponibles.

source: When you are not using the GUI version, you could use the file explorer window to select files like in a file browser. However, this doesn't work for the ":browse" command. See |netrw-browse|.
es: Cuando no se está usando la versión gráfica de Vim, es posible usar el explorador de archivos para seleccionar archivos de la forma habitual con un explorador de archivos. Sin embargo, el explorador no funciona con la orden «:browse». Véase |netrw-browse|.

source: *31.2* Confirmation
es: *31.2* Confirmación

source: Vim protects you from accidentally overwriting a file and other ways to lose changes. If you do something that might be a bad thing to do, Vim produces an error message and suggests appending ! if you really want to do it. To avoid retyping the command with the !, you can make Vim give you a dialog. You can then press "OK" or "Cancel" to tell Vim what you want. For example, you are editing a file and made changes to it. You start editing another file with: >
es: Vim le protege de sobreescribir accidentalmente un archivo, y de otras formas de perder los cambios realizados. Si hace algo que puede ser peligroso, Vim muestra un mensaje de error y sugiere añadir ! si el usuario está seguro de querer hacerlo. Para evitar teclear de nuevo la orden con el !, puede hacer que Vim le ofrezca un diálogo. Así, podrá pulsar «OK» o «Cancelar» para indicarle a Vim qué desea hacer. Por ejemplo, está editando un archivo y ya hizo algunos cambios. Puede editar otro archivo con: >

source: Now make your choice. If you do want to save the changes, select "YES". If you want to lose the changes for ever: "NO". If you forgot what you were doing and want to check what really changed use "CANCEL". You will be back in the same file, with the changes still there.
es: Y ahora puede decidir qué hacer. Si desea conservar los cambios, escoja «SÍ». Si quiere descartar permanentemente los cambios hechos: «NO». Si olvidó lo que estaba haciendo y quiere revisar cuáles fueron los cambios hechos, use «CANCELAR». Estará de nuevo en el mismo archivo, y los cambios aún estarán allí.

source: Just like ":browse", the ":confirm" command can be prepended to most commands that edit another file. They can also be combined: >
es: Tal como «:browse», la orden «:confirm» se puede anteponer a la mayoría de las órdenes que editan un archivo. Estas órdenes también se pueden combinar: >

source: This will produce a dialog when the current buffer was changed. Then it will pop up a file browser to select the file to edit.
es: Esto mostrará un diálogo cuando el búfer actual contiene cambios. Luego se mostrará un explorador de archivos para seleccionar el archivo a editar.

source: Note: In the dialog you can use the keyboard to select the choice. Typically the <Tab> key and the cursor keys change the choice. Pressing <Enter> selects the choice. This depends on the system though.
es: Nota: Es posible usar el teclado para seleccionar la opción deseada en el diálogo. Generalmente, la tecla <Tab> y las teclas de cursor cambian la opción seleccionada. Pulsar <Enter> escoge la opción definida. Sin embargo, esto varía de sistema a sistema.

source: When you are not using the GUI, the ":confirm" command works as well. Instead of popping up a dialog, Vim will print the message at the bottom of the Vim window and ask you to press a key to make a choice. >
es: Cuando no se usa la GUI, la orden «:confirm» sigue funcionando. En vez de crear una ventana de diálogo, el mensaje se mostrará en la parte de abajo de la ventana de Vim, y se le solicitará pulsar una tecla para hacer una elección. >

source: :confirm edit main.c < Save changes to "Untitled"? ~ [Y]es, (N)o, (C)ancel: ~
es: :confirm edit main.c < Guardar los cambios en "Sin título"? ~ [Y]es, (N)o, (C)ancelar: ~

source: You can now press the single key for the choice. You don't have to press <Enter>, unlike other typing on the command line.
es: Ahora puede realizar su selección simplemente pulsando una tecla. En particular, no tiene que pulsar <Enter>, a diferencia del tecleo normal en la línea de órdenes.

source: *31.3* Menu shortcuts
es: *31.3* Atajos de teclado para menús

source: There is a conflict between using the <Alt> key to select menu items, and using <Alt> key combinations for mappings. The 'winaltkeys' option tells Vim what it should do with the <Alt> key. The default value "menu" is the smart choice: If the key combination is a menu shortcut it can't be mapped. All other keys are available for mapping. The value "no" doesn't use any <Alt> keys for the menus. Thus you must use the mouse for the menus, and all <Alt> keys can be mapped. The value "yes" means that Vim will use any <Alt> keys for the menus. Some <Alt> key combinations may also do other things than selecting a menu.
es: Hay un conflicto con el uso de la tecla <Alt> para seleccionar elementos de menús, y el uso de la tecla <Alt> en combinaciones de teclas para macros. La opción 'winaltkeys' le indica a Vim qué hacer con la tecla <Alt>. El valor predeterminado «menu» es la selección inteligente: si la combinación de teclas es un atajo de teclado para el menú, no se la puede usar en una macro. Todas las otras teclas están disponibles para crear macros. El valor «no» hace que no se use ninguna tecla <Alt> para los menús. Por esto, es necesario usar el ratón para acceder a los menús, y todas las teclas <Alt> se pueden incluir en macros. El valor «yes» implica que Vim usará cualquier tecla <Alt> para los menús. Algunas combinaciones de teclas con <Alt> pueden hacer cosas distintas a seleccionar un menú.

source: *31.4* Vim window position and size
es: *31.4* Posición y tamaño de la ventana de Vim

source: This will only work in the GUI. The output may look like this:
es: Esto sólo funcionará en la interfaz gráfica. La salida será similar a lo siguiente:

source: Window position: X 272, Y 103 ~
es: Posición de la ventana: X 272, Y 103 ~

source: The position is given in screen pixels. Now you can use the numbers to move Vim somewhere else. For example, to move it to the left a hundred pixels: >
es: La posición está dada en píxeles de la pantalla. Puede usar estos números para mover la ventana de Vim a algún otro sitio. Por ejemplo, para moverla a la izquierda cien píxeles: >

source: :winpos 172 103 < Note: There may be a small offset between the reported position and where the window moves. This is because of the border around the window. This is added by the window manager.
es: :winpos 172 103 < Nota: Puede haber un pequeño desfase entre la posición señalada y el sitio al que se mueve la ventana. Esto es debido al borde de la ventana. Éste es añadido por el administrador de ventanas.

source: The size of the Vim window is computed in characters. Thus this depends on the size of the font being used. You can see the current size with this command: >
es: El tamaño de la ventana de Vim se calcula en caracteres. Por este motivo el tamaño depende del tipo de letra usado. El tamaño actual puede consultarse con esta orden: >

source: Obtaining the size works in a terminal just like in the GUI. Setting the size is not possible in most terminals.
es: Consultar el tamaño funciona en una terminal de la misma manera que en la GUI. En la mayoría de las terminales no es posible ajustar el tamaño.

source: gvim -geometry {width}x{height}+{x_offset}+{y_offset}
es: gvim -geometry {ancho}x{alto}+{desplz_x}+{desplz_y}

source: {width} and {height} are in characters, {x_offset} and {y_offset} are in pixels. Example: >
es: {ancho} y {alto} están dados en caracteres, {desplz_x} y {desplz_y} están dados en píxeles. Por ejemplo: >

source: *31.5* Various
es: *31.5* Varios

source: You can use gvim to edit an e-mail message. In your e-mail program you must select gvim to be the editor for messages. When you try that, you will see that it doesn't work: The mail program thinks that editing is finished, while gvim is still running! What happens is that gvim disconnects from the shell it was started in. That is fine when you start gvim in a terminal, so that you can do other work in that terminal. But when you really want to wait for gvim to finish, you must prevent it from disconnecting. The "-f" argument does this: >
es: Puede usar gvim para editar mensajes de correo. Debe seleccionar gvim como el editor para sus mensajes en su programa de correo. Al hacerlo, notará que esto falla: el programa de correo cree que la edición del mensaje ha terminado, ¡aún cuando gvim no se ha cerrado! El motivo de este error es que gvim se desconecta de la consola en la que se inició. Esto funciona bien cuando se inicia gvim desde una terminal, para que se pueda hacer otras cosas en ella. Pero cuando se necesita esperar a que gvim termine, hay que evitar dicha desconexión. El argumento «-f» hace precisamente eso: >

source: The "-f" stands for foreground. Now Vim will block the shell it was started in until you finish editing and exit.
es: «-f» significa foreground (primer plano). Ahora, Vim bloqueará la consola en la que se inició hasta que termine la edición y cierre el editor.

source: On Unix it's possible to first start Vim in a terminal. That's useful if you do various tasks in the same shell. If you are editing a file and decide you want to use the GUI after all, you can start it with: >
es: En Unix es posible iniciar Vim en una terminal. Esto es útil si se están realizando varias tareas en una misma consola. Si está editando un archivo y decide que después de todo quiere usar la GUI, puede lanzarla con la orden: >

source: Vim will open the GUI window and no longer use the terminal. You can continue using the terminal for something else. The "-f" argument is used here to run the GUI in the foreground. You can also use ":gui -f".
es: Vim abrirá la ventana de la GUI y no seguirá usando la terminal. Puede continuar usando la terminal para lo que necesite. El argumento «-f» se usa aquí para ejecutar la GUI en primer plano. También puede usar «:gui -f».

source: When gvim starts, it reads the gvimrc file. That's similar to the vimrc file used when starting Vim. The gvimrc file can be used for settings and commands that are only to be used when the GUI is going to be started. For example, you can set the 'lines' option to set a different window size: >
es: Cuando gvim inicia, lee el archivo gvimrc. Es similar al archivo vimrc que se usa al iniciar Vim. El archivo gvimrc puede usarse para fijar opciones de configuración y órdenes que sólo deban usarse cuando se inicie la GUI. Por ejemplo, puede definir la opción 'lines' para obtener un tamaño de ventana diferente: >

source: You don't want to do this in a terminal, since its size is fixed (except for an xterm that supports resizing). The gvimrc file is searched for in the same locations as the vimrc file. Normally its name is "~/.gvimrc" for Unix and "$VIM/_gvimrc" for MS-Windows. The $MYGVIMRC environment variable is set to it, thus you can use this command to edit the file, if you have one: >
es: No es conveniente hacer esto en una terminal, debido a que su tamaño es fijo (excepto por un xterm que soporte redimensionado). El archivo gvimrc se busca en las mismas ubicaciones que el archivo vimrc. Habitualmente, su nombre es «~/.gvimrc» en sistemas Unix/Linux y «$VIM/_gvimrc» en MS-Windows. La ruta de este archivo se almacena en la variable de entorno $MYGVIMRC, por lo que puede usar la siguiente orden para editar ese archivo, si existe: >

source: :edit $MYGVIMRC < If for some reason you don't want to use the normal gvimrc file, you can specify another one with the "-U" argument: >
es: :edit $MYGVIMRC < Si por algún motivo no desea usar el archivo gvimrc normal, puede especificar otro mediante el argumento «-U»: >

source: gvim -U thisrc ...
es: gvim -U otrorc ...

source: That allows starting gvim for different kinds of editing. You could set another font size, for example. To completely skip reading a gvimrc file: >
es: Esto le permite iniciar gvim para distintas formas de edición. Puede, por ejemplo, definir otro tamaño para el tipo de letra. Para evitar la ejecución del archivo gvimrc use: >

source: *usr_23.txt* For Vim version 7.3. Last change: 2006 Apr 24
es: *usr_23.esx* Para Vim version 7.3. Último cambio: 24/6/2006

source: Editing other files
es: Editar otros archivos

source: This chapter is about editing files that are not ordinary files. With Vim you can edit files that are compressed or encrypted. Some files need to be accessed over the internet. With some restrictions, binary files can be edited as well.
es: Este capítulo trata acerca de editar archivos que no son archivos ordinarios. Con Vim, puede editar archivos comprimidos o cifrados. Necesita acceder a algunos archivos a través de Internet. Con alguna restricción, también puede editar archivos binarios.

source: |23.1| DOS, Mac and Unix files |23.2| Files on the internet |23.3| Encryption |23.4| Binary files |23.5| Compressed files
es: |23.1| Archivos de DOS, Mac y Unix |23.2| Archivos en Internet |23.3| Cifrado |23.4| Archivos binarios |23.5| Archivos comprimidos

source: Next chapter: |usr_24.txt| Inserting quickly Previous chapter: |usr_22.txt| Finding the file to edit Table of contents: |usr_toc.txt|
es: Capítulo siguiente : |usr_24.esx| Insertar con rapidez Capítulo anterior: |usr_22.esx| Encontrar el archivo a editar Tabla de contenidos: |usr_toc.esx|

source: *23.1* DOS, Mac and Unix files
es: *23.1* Archivos de DOS, Mac y Unix

source: Back in the early days, the old Teletype machines used two characters to start a new line. One to move the carriage back to the first position (carriage return, <CR>), another to move the paper up (line feed, <LF>). When computers came out, storage was expensive. Some people decided that they did not need two characters for end-of-line. The UNIX people decided they could use <Line Feed> only for end-of-line. The Apple people standardized on <CR>. The MS-DOS (and Microsoft Windows) folks decided to keep the old <CR><LF>. This means that if you try to move a file from one system to another, you have line-break problems. The Vim editor automatically recognizes the different file formats and handles things properly behind your back. The option 'fileformats' contains the various formats that will be tried when a new file is edited. The following command, for example, tells Vim to try UNIX format first and MS-DOS format second: >
es: Antiguamente, las viejas máquinas Teletype usaban dos caracteres para iniciar una nueva línea. Uno desplazaba el transporte de vuelta a la posición inicial («carriage return», <CR>), y el otro desplazaba la la página hacia arriba («line feed», <LF>). Cuando aparecieron los ordenadores el almacenamiento era caro. Algunas personas decidieron que no necesitaban dos caracteres para marcar el final de la línea. La gente de UNIX decidió usar sólo <Line Feed>. La gente de Apple tomó <CR> como estándar. La gente de MS-DOS (y Microsoft Windows) decidió seguir con el antiguo <CR><LF>. Esto supone que si intenta mover un archivo de un sistema a otro, tendrá problemas con el retorno de línea. El editor Vim detecta los diferentes formatos de archivos automáticamente y gestiona las cosas adecuadamente sin que usted lo note. La opción 'fileformats' contiene los diversos formatos que se prueban cuando edite un archivo nuevo. La siguiente orden, por ejemplo, le dice a Vim que primero pruebe con el formato UNIX, y después con el formato MS-DOS: >

source: You will notice the format in the message you get when editing a file. You don't see anything if you edit a native file format. Thus editing a Unix file on Unix won't result in a remark. But when you edit a dos file, Vim will notify you of this:
es: Reconocerá el formato por el mensaje que obtendrá al editar un archivo. No verá nada si edita un formato de archivo nativo. Por ello, editar un archivo UNIX en Unix no resultará en un aviso. Pero cuando edite un archivo DOS, Vim le notificará de ello:

source: For a Mac file you would see "[mac]". The detected file format is stored in the 'fileformat' option. To see which format you have, execute the following command: >
es: Verá «[mac]» si es un archivo MAC. El formato de archivo detectado se guarda en la opción 'fileformat'. Para ver qué formato tiene, ejecute la siguiente orden: >

source: On Unix, <LF> is used to break a line. It's not unusual to have a <CR> character halfway a line. Incidentally, this happens quite often in Vi (and Vim) scripts. On the Macintosh, where <CR> is the line break character, it's possible to have a <LF> character halfway a line. The result is that it's not possible to be 100% sure whether a file containing both <CR> and <LF> characters is a Mac or a Unix file. Therefore, Vim assumes that on Unix you probably won't edit a Mac file, and doesn't check for this type of file. To check for this format anyway, add "mac" to 'fileformats': >
es: En Unix, se emplea <LF> para marcar un retorno de línea. No es inusual obtener un caracter <CR> en mitad de la línea. Fortuitamente, esto ocurre con regularidad en los scripts de Vi (y Vim). En un Macintosh, donde <CR> marca el retorno de línea, es posible obtener un caracter <LF> en mitad de la línea. El resultado es que no es posible estar totalmente seguro de si es un archivo MAC o UNIX al estar presentes ambos caracteres <CR> y <LF>. Por ello, Vim asume que probablemente no editaría un archivo MAC bajo Unix, y no revisará el tipo del archivo. Para revisar el formato de todas maneras, añada «mac» a 'fileformats'.
