Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_*_traduccion/doc-compendium.po
Languages: es

source: There are many of these items.
es: Hay muchos de estos elementos.

source: See |cinoptions-values|.
es: Consulte |cinoptions-values|.

source: *30.3* Automatic indenting
es: *30.3* Sangrado automático

source: You don't want to switch on the 'cindent' option manually every time you edit a C file.
es: No desea activar la opción 'cindent' manualmente cada vez que edite un archivo C.

source: This is how you make it work automatically: >
es: Esta es la forma de hacer que funcione automáticamente: >

source: Actually, this does a lot more than switching on 'cindent' for C files.
es: En realidad, esto hace mucho más que activar 'cindent' para archivos C.

source: First of all, it enables detecting the type of a file.
es: En primer lugar, activa la detección de tipo de archivo.

source: That's the same as what is used for syntax highlighting.
es: Es igual a lo usado para el resaltado de sintaxis.

source: When the filetype is known, Vim will search for an indent file for this type of file.
es: Si el tipo de archivo es conocido, Vim buscará un archivo de sangrado para este tipo de archivo.

source: The Vim distribution includes a number of these for various programming languages.
es: La distribución de Vim incluye un número para estos lenguajes de programación.

source: This indent file will then prepare for automatic indenting specifically for this file.
es: Este archivo de sangrado preparará automáticamente el sangrado específico para este archivo.

source: If you don't like the indenting for one specific type of file, this is how you avoid it.
es: Si no le gusta el sangrado para un tipo específico de archivo, esta es la forma de evitarlo.

source: Create a file with just this one line: >
es: Cree un archivo con sólo esta línea: >

source: {directory}/indent/{filetype}.vim
es: {directorio}/indent/{tipo-de-archivo}.vim

source: The {filetype} is the name of the file type, such as "cpp" or "java".
es: El {tipo-de-archivo} es el nombre del tipo de archivo, por ejemplo, «cpp» o «java».

source: You can see the exact name that Vim detected with this command: >
es: Puede ver el nombre exacto de archivo que Vim ha detectado con la siguiente orden: >

source: Thus you would use "help" for {filetype}.
es: Entonces, usaría «help» para {tipo-de-archivo}.

source: For the {directory} part you need to use your runtime directory.
es: Para la parte de {directorio}, necesita usar su directorio de tiempo de ejecución.

source: Look at the output of this command: >
es: Mire la salida de esta orden: >

source: Now use the first item, the name before the first comma.
es: Ahora use el primer elemento, el nombre que precede a la primera coma.

source: Thus if the output looks like this:
es: Así, la salida tiene el siguiente aspecto:

source: You use "~/.vim" for {directory}.
es: Puede usar «~/.vim» para el {directorio}.

source: Then the resulting file name is:
es: Entonces, el nombre del archivo resultante es:

source: Instead of switching the indenting off, you could write your own indent file.
es: En lugar de desactivar el sangrado, podría escribir su propio archivo de sangrado.

source: How to do that is explained here: |indent-expression|.
es: La manera de hacerlo se explica aquí: |indent-expression|.

source: *30.4* Other indenting
es: *30.4* Otros sangrados

source: When you are using 'autoindent' or 'smartindent' to get the indent of the previous line, there will be many times when you need to add or remove one 'shiftwidth' worth of indent.
es: Cuando use 'autoindent' o 'smartindent' para obtener el sangrado de línea anterior, habrá ocasiones en que necesite añadir o eliminar un 'shiftwidth' de sangrado.

source: A quick way to do this is using the CTRL-D and CTRL-T commands in Insert mode.
es: La forma rápida de hacerlo es usando las órdenes «CTRL-D» y «CTRL-T» en modo Insertar.

source: For example, you are typing a shell script that is supposed to look like this:
es: Por ejemplo, está escribiendo un script de consola con el siguiente aspecto:

source: Now you see that you need an extra indent.
es: Ahora ve que necesita un sangrado adicional.

source: Type CTRL-T.
es: Pulse«CTRL-T».

source: The CTRL-T command, in Insert mode, adds one 'shiftwidth' to the indent, no matter where in the line you are.
es: La orden «CTRL-T», en modo Insertar, añade un 'shiftwidth' al sangrado sin importar en que línea está.

source: You continue typing the second line, <Enter> and the third line.
es: Continua escribiendo en la segunda línea, <Intro>, y la tercera línea.

source: This time the indent is OK.
es: Esta vez el sangrado es correcto.

source: Then <Enter> and the last line.
es: Pulse <Intro> y salte a la última línea.

source: Now you have this:
es: Ahora tiene lo siguiente:

source: To remove the superfluous indent in the last line press CTRL-D.
es: Para eliminar el sangrado innecesario en la última línea pulse «CTRL-D».

source: This deletes one 'shiftwidth' worth of indent, no matter where you are in the line.
es: Elimina un 'shiftwidth' de sangrado, sin importar dónde está dentro de la línea.

source: When you are in Normal mode, you can use the ">>" and "<<" commands to shift lines.
es: Cuando está en modo Normal, puede usar las órdenes «>>» y «<<» para cambiar las líneas.

source: ">" and "<" are operators, thus you have the usual three ways to specify the lines you want to indent.
es: «>» y «<» son operadores, y por ello tiene las tres formas habituales de definir las líneas que desea sangrar.

source: A useful combination is: >
es: Una combinación útil es la siguiente: >

source: original text after ">i{" after ">a{"
es: texto original después de «>i{» después de «>a{»

source: if (flag) if (flag) if (flag) ~ { { { ~ printf("yes"); printf("yes"); printf("yes"); ~ flag = 0; flag = 0; flag = 0; ~ } } } ~
es: if (opción) if (opción) if (opción) ~ { { { ~ printf("yes"); printf("yes"); printf("yes"); ~ opción = 0; opción = 0; opción = 0; ~ } } } ~

source: *30.5* Tabs and spaces
es: *30.5* Tabulados y espacios

source: Use a mix of <Tab> and space characters.
es: Use una mezcla de <Tab> y caracteres de espacio.

source: Since a <Tab> takes the place of eight spaces, you have fewer characters in your file.
es: Ya que <Tab> toma el el lugar de 8 espacios, tendrá menos caracteres en su archivo.

source: Inserting a <Tab> is quicker than eight spaces.
es: Insertar un <Tab> es más rápido que 8 espacios.

source: Backspacing works faster as well.
es: La tecla de retroceso también es más rápido.

source: Use spaces only.
es: Utilice espacios solamente.

source: This avoids the trouble with programs that use a different tabstop value.
es: Esto evita los problemas con los programas que utilizan un valor de «tabstop» diferente.

source: If you are using a combination of tabs and spaces, you just edit normally.
es: Si usa una combinación de tabulados y espacios, puede editar con normalidad.

source: The Vim defaults do a fine job of handling things.
es: El comportamiento predeterminado de Vim realiza un trabajo inteligente.

source: You can make life a little easier by setting the 'softtabstop' option.
es: Puede facilitar su vida definiendo la opción 'softtabstop'.

source: This option tells Vim to make the <Tab> key look and feel as if tabs were set at the value of 'softtabstop', but actually use a combination of tabs and spaces.
es: Esta opción le dice a Vim que la tecla <Tab> tenga el comportamiento como si los tabulados estuviesen definidos como un valor 'softtabstop', aunque use en realidad una combinación de tabulados y espacios.

source: After you execute the following command, every time you press the <Tab> key the cursor moves to the next 4-column boundary: >
es: Después de ejecutar la siguiente, orden, cada vez que pulse la tecla <Tab> el cursor se moverá al siguiente límite de cuatro columnas: >

source: When you start in the first column and press <Tab>, you get 4 spaces inserted in your text.
es: Cuando empiece en la primera columna y pulse <Tab> obtendrá la inserción de cuatro espacios en su texto.

source: The second time, Vim takes out the 4 spaces and puts in a <Tab> (thus taking you to column 8).
es: La segunda vez, Vim eliminará los cuatro espacios e insertará un <Tab> (llevándole a la columna 8).

source: Thus Vim uses as many <Tab>s as possible, and then fills up with spaces.
es: Entonces, Vim usa tantos <Tab> como sea posible, rellenándolos con espacios.

source: When backspacing it works the other way around.
es: Al usar la tecla de retroceso, funcionará al revés.

source: A <BS> will always delete the amount specified with 'softtabstop'.
es: Un <Bs> (tecla de retroceso) siempre elimina la cantidad definida con 'softtabstop'.

source: Then <Tab>s are used as many as possible and spaces to fill the gap.
es: Entonces, se usarán tantos <Tab> como sea posible, rellenando el hueco resultante con espacios.

source: The following shows what happens pressing <Tab> a few times, and then using <BS>.
es: Lo siguiente muestra lo que ocurre cuando pulsa <Tab> varias veces, y después usando <Bs>.

source: A "." stands for a space and "------->" for a <Tab>.
es: Un «.» simboliza un espacio, y «------->» un <Tab>.

source: type result ~ <Tab> ....
es: tipo resultado ~ <Tab> ....

source: An alternative is to use the 'smarttab' option.
es: Una alternativa es usar la opción 'smartab'.

source: When it's set, Vim uses 'shiftwidth' for a <Tab> typed in the indent of a line, and a real <Tab> when typed after the first non-blank character.
es: Si se define, Vim usa 'shiftwidth' para un <Tab> introducida en el sangrado de una línea, y un <Tab> real cuando se introduce en el primer carácter no vacío.

source: However, <BS> doesn't work like with 'softtabstop'.
es: Sin embargo <BS> no funciona de la misma forma que con 'softtabstop'.

source: When this option is set, the <Tab> key inserts a series of spaces.
es: Cuando se define esta opción, la tecla <Tab> inserte una serie de espacios.

source: Thus you get the same amount of white space as if a <Tab> character was inserted, but there isn't a real <Tab> character in your file.
es: Por ello, obtiene el mismo espacio en blanco que un carácter <Tab> inserta, aunque en realidad no hay ningún carácter <Tab> en su archivo.

source: The backspace key will delete each space by itself.
es: La tecla de retroceso eliminará cada espacio por sí mismo.

source: Thus after typing one <Tab> you have to press the <BS> key up to eight times to undo it.
es: Por ello, después de teclear un <Tab>, tendrá que pulsar la tecla <BS> (retroceso) hasta ocho veces para deshacerlo.

source: If you are in the indent, pressing CTRL-D will be a lot quicker.
es: Si está dentro de la sangría, pulsar «CTRL-D» es mucho más rápido.

source: Setting 'expandtab' does not affect any existing tabs.
es: Definir 'expandtab' no afecta a las tabulaciones existentes.

source: In other words, any tabs in the document remain tabs.
es: En otras palabras, todas las tabulaciones del documento siguen siéndolo.

source: If you want to convert tabs to spaces, use the ":retab" command.
es: Si desea convertir esas tabulaciones en espacios, use la orden «:retab».

source: Use these commands: >
es: Use las siguientes órdenes: >

source: Now Vim will have changed all indents to use spaces instead of tabs.
es: Ahora, Vim ha cambiado todas las sangrías para que usen espacios en lugar de tabulados.

source: However, all tabs that come after a non-blank character are kept.
es: Sin embargo, se respetan todos los tabulados a continuación de un carácter no vacío.

source: If you want these to be converted as well, add a !: >
es: Añada «!» si desea convertir éstos también: >

source: This is a little bit dangerous, because it can also change tabs inside a string.
es: Esto es algo peligroso, ya que también puede cambiar los tabulados dentro de una cadena.

source: To check if these exist, you could use this: >
es: Puede usar lo siguiente para comprobar la existencia de éstos: >

source: It's recommended not to use hard tabs inside a string.
es: Se recomienda no usar tabulados rígidos dentro de una cadena.

source: Replace them with "\t" to avoid trouble.
es: Reemplácelos con «\t» para evitar problemas.

source: *30.6* Formatting comments
es: *30.6* Formatear comentarios

source: One of the great things about Vim is that it understands comments.
es: Una de las mayores virtudes de Vim es que entiende comentarios.

source: You can ask Vim to format a comment and it will do the right thing.
es: Puede pedir a Vim que dé formato a un comentario, y hará lo correcto.

source: Suppose, for example, that you have the following comment:
es: Suponga que tiene el siguiente comentario:

source: /* ~ * This is a test ~ * of the text formatting.
es: /* ~ * Esta es una prueba ~ * de formateo de texto.

source: "gq" is the operator to format text.
es: «gq» es el operador para formatear texto.

source: "]/" is the motion that takes you to the end of a comment.
es: «]/» es el movimiento que le lleva al final del comentario.

source: Notice that Vim properly handled the beginning of each line.
es: Observe que Vim manipuló adecuadamente el principio de cada línea.

source: An alternative is to select the text that is to be formatted in Visual mode and type "gq".
es: Una alternativa es seleccionar el texto a formatear en modo Visual, y teclear «gq».

source: To add a new line to the comment, position the cursor on the middle line and press "o".
es: Para añadir una nueva línea al comentario, posicione el cursor en la línea central y pulse «o».

source: Vim has automatically inserted a star and a space for you.
es: Vim ha insertado un «*» y un espacio automáticamente.

source: Now you can type the comment text.
es: Ahora puede escribir el texto de comentario.

source: When it gets longer than 'textwidth', Vim will break the line.
es: Si la línea excede el valor de 'textwidth', Vim romperá la línea.

source: Again, the star is inserted automatically:
es: Una vez más, se inserta «*» automáticamente.

source: ~ * Typing a lot of text here will make Vim ~ * break ~ */ ~
es: ~ * Teclear mucho texto hará que Vim divida ~ * la línea ~ */ ~

source: r insert the star when typing <Enter> in Insert mode o insert the star when using "o" or "O" in Normal mode c break comment text according to 'textwidth'
es: r inserta «*» al pulsar <Enter> en modo Insertar o inserta «*» a usar «o» o «O» en modo Normal c rompe el texto de comentario de acuerdo a 'textwidth'

source: The 'comments' option defines what a comment looks like.
es: La opción 'comments' define el aspecto de un comentario.

source: Vim distinguishes between a single-line comment and a comment that has a different start, end and middle part.
es: Vim distingue entre un comentario de una sola línea y un comentario cuyo principio, parte central y final son distintas.

source: Many single-line comments start with a specific character.
es: Muchos comentarios de una sola línea empiezan con carácter específico.

source: In C++ // is used, in Makefiles #, in Vim scripts ".
es: En C++ se usa «//», «#» en archivos «Makefile», y «"» en scripts de Vim.

source: For example, to make Vim understand C++ comments: >
es: Por ejemplo, para que Vim entienda comentarios en C++: >

source: The colon separates the flags of an item from the text by which the comment is recognized.
es: Los dos puntos separan las opciones de un elemento del texto por el cual se reconoce un comentario.

source: The general form of an item in 'comments' is:
es: La forma habitual de un elemento en 'comments' es:

source: {flags}:{text}
es: {opcio}:{texto}

source: There are two items, one for comments starting with ">" and one for comments that start with "!".
es: Hay dos elementos, uno para los comentarios que empiezan con «>» y otro para los comentarios que comienzan con «!».

source: Both use the flag "n".
es: Ambos usan la opción «n».

source: This means that these comments nest.
es: Esto significa que estos comentarios se anidan.

source: Thus a line starting with ">" may have another comment after the ">".
es: Por lo tanto, una línea comenzando con «>» puede tener otro comentario después de «>».

source: This allows formatting a message like this:
es: Esto permite dar formato a un mensaje como este:

source: The ~ > colors are terrible.
es: Los ~ > colores son horribles.

source: ~ What is the URL of that ~ site?
es: ~ ¿Cual es la URL de esa ~ página web?

source: Try setting 'textwidth' to a different value, e.g., 80, and format the text by Visually selecting it and typing "gq".
es: Pruebe configurando 'textwidth' con un valor diferente, de 80, y formatee el texto seleccionándolo en modo Visual y escribiendo «gq».

source: The colors are terrible.
es: Los colores son horribles.

source: ~ What is the URL of that site?
es: ~ ¿Cual es la URL de esa página web?

source: You will notice that Vim did not move text from one type of comment to another.
es: Notará que Vim no desplazó el texto de un tipo de comentario a otro.

source: The "I" in the second line would have fit at the end of the first line, but since that line starts with "> !" and the second line with ">", Vim knows that this is a different kind of comment.
es: El «No» en la segunda línea puede encajar al final de la primera línea, pero ya que la línea comienza con «> !», y la segunda con «>», Vim detectará que es otro tipo de comentario.

source: A C comment starts with "/*", has "*" in the middle and "*/" at the end.
es: Un comentario de C empieza con «/*», «*» en el medio, y «/*» al final.

source: The entry in 'comments' for this looks like this: >
es: La entrada en 'comments' tendría este aspecto: >

source: The start is defined with "s1:/*".
es: El principio se define con «s1:/*».

source: The "s" indicates the start of a three-piece comment.
es: La «s» indica el principio de un comentario en tres partes.

source: The colon separates the flags from the text by which the comment is recognized: "/*".
es: Los dos puntos separan las marcas del texto por el cual se detecta que es un comentario: «/*».

source: There is one flag: "1".
es: Hay una marca, «1».

source: This tells Vim that the middle part has an offset of one space.
es: Indica a Vim que la parte central tiene un «offset» de un espacio.

source: The middle part "mb:*" starts with "m", which indicates it is a middle part.
es: La parte central «mb:*» comienza con «m», que indica que es la parte central.

source: The "b" flag means that a blank must follow the text.
es: La opción «b» indica que el texto debe ir seguido de un espacio en blanco.

source: Otherwise Vim would consider text like "*pointer" also to be the middle of a comment.
es: En caso contrario, Vim considerará que el texto como «*pointer» también es la parte central de un comentario.

source: The end part "ex:*/" has the "e" for identification.
es: La parte final «ex:*/» tiene «e» como identificador.

source: The "x" flag has a special meaning.
es: La opción «x» tiene un significado especial.

source: It means that after Vim automatically inserted a star, typing / will remove the extra space.
es: Indica que pulsar «/» eliminará el espacio adicional después de que Vim haya insertado automáticamente un asterisco, «*».

source: *usr_28.txt* For Vim version 7.3.
es: *usr_28.esx* Para Vim versión 7.3.

source: Folding
es: Plegar

source: |28.1| What is folding?
es: |28.1| ¿Qué es plegar?

source: |28.2| Manual folding |28.3| Working with folds |28.4| Saving and restoring folds |28.5| Folding by indent |28.6| Folding with markers |28.7| Folding by syntax |28.8| Folding by expression |28.9| Folding unchanged lines |28.10| Which fold method to use?
es: |28.2| Plegar manualmente |28.3| Trabajar con pliegues |28.4| Guardar y restaurar pliegues |28.5| Plegar por sangrado |28.6| Plegar con marcadores |28.7| Plegar por sintaxis |28.8| Plegar por expresión |28.9| Plegar líneas sin cambios |28.10¿| ¿Qué método de plegar debería usar?

source: Next chapter: |usr_29.txt| Moving through programs Previous chapter: |usr_27.txt| Search commands and patterns Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_29.esx| Moverse a través de programas Capítulo anterior: |usr_27.esx| Órdenes de búsqueda y patrones Tabla de contenidos: |usr_toc.esx|

source: *28.1* What is folding?
es: *28.1¿* ¿Qué es plegar?

source: Folding is used to show a range of lines in the buffer as a single line on the screen.
es: Plegar se usa para mostrar un rango de líneas en un búfer como una sola línea en la pantalla.

source: Like a piece of paper which is folded to make it shorter:
es: Como un trozo de papel plegado para acortarlo.

source: +------------------------+ | line 1 | | line 2 | | line 3 | |_______________________ | \ \ \________________________\ / folded lines / /________________________/ | line 12 | | line 13 | | line 14 | +------------------------+
es: +------------------------+ | línea 1 | | línea 2 | | línea 3 | |_______________________ | \ \ \________________________\ / líneas plegadas / /________________________/ | línea 12 | | línea 13 | | línea 14 | +------------------------+

source: The text is still in the buffer, unchanged.
es: El texto aún está en el búfer, sin cambios.

source: Only the way lines are displayed is affected by folding.
es: Plegar sólo afecta a la manera en que se muestran las líneas.

source: *28.2* Manual folding
es: *28.2* Plegar manualmente

source: You will see that the paragraph is replaced by a highlighted line.
es: Verá que una línea resaltada reemplaza al párrafo.

source: You have created a fold.
es: Ha creado un pliegue.

source: |zf| is an operator and |ap| a text object selection.
es: |zf| es un operando y |ap| una selección de un objeto textual.

source: You can use the |zf| operator with any movement command to create a fold for the text that it moved over.
es: Puede usar el operando |zf| con cualquier orden de desplazamiento para crear un pliegue para el texto reemplazado.

source: |zf| also works in Visual mode.
es: |zf| funciona también en el modo Visual.

source: All the folding commands start with "z".
es: Todas las órdenes de plegado empiezan con «z».

source: With some fantasy, this looks like a folded piece of paper, seen from the side.
es: Si usa la imaginación, se asemeja a un papel plegado visto de lado.

source: The letter after the "z" has a mnemonic meaning to make it easier to remember the commands:
es: La letra a continuación de «z» tiene un significado nemónico que facilita recordar las órdenes:

source: zf F-old creation zo O-pen a fold zc C-lose a fold
es: zf F-old creation (crear pliegue) zo O-pen a fold (abrir pliegue) zc C-lose a fold (cerrar pliegue)

source: Suppose you have created several folds, and now want to view all the text.
es: Imagine que ha creado varios pliegues, y que ahora desea ver todo el texto.

source: You could go to each fold and type "zo".
es: Puede ir a cada pliegue y teclear «zo».

source: To do this faster, use this command: >
es: Use la siguiente orden para hacer esto mismo con rapidez: >

source: This will R-educe the folding.
es: Esto r_educe el plegado.

source: The opposite is: >
es: Lo opuesto es: >

source: This folds M-ore.
es: Esto pliega m_ás.

source: You can repeat "zr" and "zm" to open and close nested folds of several levels.
es: Puede repetir «zr» y «zm» para abrir y cerrar pliegues anidados en varios niveles.

source: You can quickly disable the folding with the |zn| command.
es: Puede desactivar el plegado rápidamente con la orden |zn|.

source: Then |zN| brings back the folding as it was.
es: |Zn| devuelve el plegado a su estado previo.

source: |zi| toggles between the two.
es: |zi| pasa de uno a otro.
