Repository: vim-doc-es/vimdocs
Catalog: 7.2/recursos_*_traduccion/terminology.po
Languages: de

source: command
de: orden

source: commands
de: órdenes

source: commandline, command line, command-line
de: línea de órdenes

source: GUI
de: interfaz gráfica de usuario

source: plugin
de: extensión

source: kernel
de: núcleo

source: policy, guidelines
de: directrices

source: bug report
de: informe de error (de errata)

source: (security) advisory
de: aviso de seguridad

source: release
de: distribución, publicación, entrega, versión

source: freeze
de: estabilización

source: port
de: adapatación, migración, arquitectura

source: maintainer
de: desarrollador, encargado, responsable

source: to maintain
de: desarrollar

source: build-depends
de: dependencia de construcción

source: pre-depends
de: predependencias

source: source list
de: lista de fuentes

source: source package
de: paquete fuente

source: vendor
de: fabricante, proveedor

source: upstream
de: desarrollador principal (del software que empaqueta Debian)

source: pool
de: almacén de paquetes

source: task system
de: sistema de tareas

source: apt pinning
de: anclaje

source: mirror
de: réplica, servidor réplica

source: upstream author
de: autor original

source: upstream developer
de: desarrollador original

source: support
de: permite, puede usar, realizar algo, es compatible

source: Warning
de: Advertencia

source: backup file
de: copia de seguridad

source: highlightning
de: resaltado

source: font
de: tipo de letra
