Repository: vim-doc-es/vimdocs
Catalog: 7.3/helpfiles/traducido/po/usr_43.txt.po
Languages: es

source: VIM USER MANUAL - by Bram Moolenaar
es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: Copyright: see |manual-copyright| vim:tw=78:ts=8:ft=help:norl:
es: Copyright: consulte |manual-copyright| vim:tw=78:ts=8:ft=help:norl:

source: *usr_43.txt* For Vim version 7.3. Last change: 2008 Dec 28
es: *usr_43.txt* Para Vim versión 7.3. Último cambio: 28/12/2008

source: Using filetypes
es: Uso de tipos de archivo

source: When you are editing a file of a certain type, for example a C program or a shell script, you often use the same option settings and mappings. You quickly get tired of manually setting these each time. This chapter explains how to do it automatically.
es: Al editar un archivo de un cierto tipo, como por ejemplo un programa C o un script de línea de órdenes, es común usar el mismo conjunto de opciones y macros. Definirlas manualmente cada vez que se edita el archivo se hace tedioso muy pronto. Este capítulo explica cómo hacerlo automáticamente.

source: |43.1| Plugins for a filetype |43.2| Adding a filetype
es: |43.1| Extensiones para un tipo de archivo |43.2| Añadir un tipo de archivo

source: Next chapter: |usr_44.txt| Your own syntax highlighted Previous chapter: |usr_42.txt| Add new menus Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_44.esx| Su propio resaltado de sintaxis Capítulo anterior: |usr_42.esx| Añadir nuevos menús Tabla de contenidos: |usr_toc.esx|

source: *43.1* Plugins for a filetype *filetype-plugin*
es: *43.1* Extensiones para un tipo de archivo *filetype-plugin*

source: How to start using filetype plugins has already been discussed here: |add-filetype-plugin|. But you probably are not satisfied with the default settings, because they have been kept minimal. Suppose that for C files you want to set the 'softtabstop' option to 4 and define a mapping to insert a three-line comment. You do this with only two steps:
es: La forma de activar las extensiones de tipo de archivo ya ha sido cubierta en |add-filetype-plugin|. Pero seguramente no está satisfecho con los valores de las opciones predeterminadas, porque éstas son mínimas. Suponga que para los archivos de C desea darle a 'softtabstop' el valor de 4, y definir una macro para insertar un comentario de tres líneas. Puede hacer esto en sólo dos pasos:

source: *your-runtime-dir* 1. Create your own runtime directory. On Unix this usually is "~/.vim". In this directory create the "ftplugin" directory: >
es: *your-runtime-dir* 1. Cree su propio directorio de tiempo de ejecución. En Unix usualmente es «~/.vim». En dicho directorio, cree el directorio «ftplugin»: >

source: mkdir ~/.vim mkdir ~/.vim/ftplugin < When you are not on Unix, check the value of the 'runtimepath' option to see where Vim will look for the "ftplugin" directory: >
es: mkdir ~/.vim mkdir ~/.vim/ftplugin < Si su sistema no es Unix, compruebe el valor de la opción 'runtimepath' para identificar en qué sitios buscará Vim el directorio «ftplugin»: >

source: < You would normally use the first directory name (before the first comma). You might want to prepend a directory name to the 'runtimepath' option in your |vimrc| file if you don't like the default value.
es: < La convención es usar el primer directorio listado (antes de la primera coma.) Si lo desea, también puede anteponer otro directorio al valor de la opción 'runtimepath' en su archivo |vimrc| si no le agrada el valor predeterminado.

source: 2. Create the file "~/.vim/ftplugin/c.vim", with the contents: >
es: 2. Cree el archivo «~/.vim/ftplugin/c.vim», con este contenido: >

source: Try editing a C file. You should notice that the 'softtabstop' option is set to 4. But when you edit another file it's reset to the default zero. That is because the ":setlocal" command was used. This sets the 'softtabstop' option only locally to the buffer. As soon as you edit another buffer, it will be set to the value set for that buffer. For a new buffer it will get the default value or the value from the last ":set" command.
es: Ahora edite un archivo C. Notará que se le ha dado el valor 4 a la opción 'softtabstop'. Pero si edita otro archivo, se cambia su valor al predeterminado de cero. Esto sucede porque se usó la orden «:setlocal». Ésta define el valor de la opción 'softtabstop' únicamente para el búfer actual. Al editar otro búfer, se le dará el valor definido para el mismo. Al editar un búfer nuevo obtendrá el valor predeterminado o el valor definido por la última orden «:set».

source: Likewise, the mapping for "\c" will disappear when editing another buffer. The ":map <buffer>" command creates a mapping that is local to the current buffer. This works with any mapping command: ":map!", ":vmap", etc. The |<LocalLeader>| in the mapping is replaced with the value of the "maplocalleader" variable.
es: De la misma manera, la macro para «\c» desaparecerá al editar otro búfer. La orden «:map <buffer>» crea una macro local respecto al búfer actual. Esta opción tiene el mismo efecto en cualquier orden para macros: «:map!», «:vmap», etc. El |<LocalLeader>| en la macro se reemplaza con el valor de la variable «maplocalleader».

source: You can find examples for filetype plugins in this directory: >
es: En este directorio encontrará ejemplos de extensiones de tipo de archivo: >

source: More details about writing a filetype plugin can be found here: |write-plugin|.
es: En |write-plugin| encontrará más detalles para escribir extensiones de tipo de archivo.

source: *43.2* Adding a filetype
es: *43.2* Añadir un tipo de archivo

source: If you are using a type of file that is not recognized by Vim, this is how to get it recognized. You need a runtime directory of your own. See |your-runtime-dir| above.
es: Si Vim no reconoce el tipo de archivo que está usando, siga los siguientes pasos para corregir el problema. Necesita un directorio de tiempo de ejecución propio. Consulte antes |your-runtime-dir|.

source: Create a file "filetype.vim" which contains an autocommand for your filetype. (Autocommands were explained in section |40.3|.) Example: >
es: Cree un archivo «filetype.vim» que contenga una orden automática para su tipo de archivo. (Las órdenes automáticas se explican el la sección |40.3|.) Ejemplo: >

source: This will recognize all files that end in ".xyz" as the "xyz" filetype. The ":augroup" commands put this autocommand in the "filetypedetect" group. This allows removing all autocommands for filetype detection when doing ":filetype off". The "setf" command will set the 'filetype' option to its argument, unless it was set already. This will make sure that 'filetype' isn't set twice.
es: Con esto se reconocerán todos los archivos cuyo nombre termina en «.xyz» como del tipo «xyz». Las órdenes «:augroup» ubican esta orden automática en el grupo «filetypedetect» (detección de tipos de archivo). Esto permite eliminar todas las órdenes automáticas de detección de tipo de archivo al ejecutar «:filetype off». La orden «:setf» definirá la opción 'filetype' con el argumento que se le pase, a menos que ya esté definido. Esto asegura que no se defina 'filetype' más de una vez.

source: You can use many different patterns to match the name of your file. Directory names can also be included. See |autocmd-patterns|. For example, the files under "/usr/share/scripts/" are all "ruby" files, but don't have the expected file name extension. Adding this to the example above: >
es: Puede usar distintos patrones que coincidan con el nombre de su archivo. También es posible incluir nombres de directorios. Consulte |autocmd-patterns|. Por ejemplo, suponga que todos los archivos en «/usr/share/scripts» son archivos «ruby», pero no tienen la extensión usual. Puede añadir la siguiente línea al ejemplo anterior: >

source: However, if you now edit a file /usr/share/scripts/README.txt, this is not a ruby file. The danger of a pattern ending in "*" is that it quickly matches too many files. To avoid trouble with this, put the filetype.vim file in another directory, one that is at the end of 'runtimepath'. For Unix for example, you could use "~/.vim/after/filetype.vim". You now put the detection of text files in ~/.vim/filetype.vim: >
es: El problema ahora se presenta al editar archivos como «/usr/share/scripts/README.txt», que no son archivos ruby. El problema de un patrón terminado en «*» es que coincide fácilmente con demasiados archivos. Para evitarlo, ubique el archivo «filetype.vim» en otro directorio, que esté al final de 'runtimepath'. Por ejemplo, en Unix puede usar «~/.vim/after/filetype.vim». Ahora añada la detección de archivos de texto en «~/.vim/filetype.vim»: >

source: That file is found in 'runtimepath' first. Then use this in ~/.vim/after/filetype.vim, which is found last: >
es: Este archivo aparece primero en 'runtimepath'. A continuación escriba la siguiente orden en «~/.vim/after/filetype.vim», que se cargará al final: >

source: What will happen now is that Vim searches for "filetype.vim" files in each directory in 'runtimepath'. First ~/.vim/filetype.vim is found. The autocommand to catch *.txt files is defined there. Then Vim finds the filetype.vim file in $VIMRUNTIME, which is halfway 'runtimepath'. Finally ~/.vim/after/filetype.vim is found and the autocommand for detecting ruby files in /usr/share/scripts is added. When you now edit /usr/share/scripts/README.txt, the autocommands are checked in the order in which they were defined. The *.txt pattern matches, thus "setf text" is executed to set the filetype to "text". The pattern for ruby matches too, and the "setf ruby" is executed. But since 'filetype' was already set to "text", nothing happens here. When you edit the file /usr/share/scripts/foobar the same autocommands are checked. Only the one for ruby matches and "setf ruby" sets 'filetype' to ruby.
es: Ahora Vim buscará archivos llamados «filetype.vim» en cada directorio listado en 'runtimepath'. Primero encuentra «~/.vim/filetype.vim». Allí está definida la orden automática para los archivos «*.txt». Luego Vim encuentra el «filetype.vim» que está en $VIMRUNTIME, más o menos a la mitad de 'runtimepath'. Finalmente, se encuentra «~/.vim/after/filetype.vim», y se añade la orden automática para detectar archivos ruby en «/usr/share/scripts». Cuando edite «/usr/share/scripts/README.txt», se revisa las órdenes automáticas en el orden en que fueron definidas. El patrón «*.txt» coincide, así que se ejecuta la orden «setf text» para definir el tipo de archivo como «text» (texto). El patrón para archivos ruby también coincide, así que también se ejecuta «setf ruby». Pero como 'filetype' ya tiene el valor «text», no sucede nada. Cuando edite el archivo «/usr/share/scripts/foobar» se revisarán las mismas órdenes automáticas. Sólo la de ruby coincide y «setf ruby» define 'filetype' a ruby.

source: RECOGNIZING BY CONTENTS
es: IDENTIFICACIÓN POR CONTENIDO

source: If your file cannot be recognized by its file name, you might be able to recognize it by its contents. For example, many script files start with a line like:
es: Si el tipo de su archivo no se puede identificar revisando el nombre del mismo, también tiene la posibilidad de identificarlo revisando su contenido. Por ejemplo, muchos archivos de scripts empiezan con una línea como:

source: To recognize this script create a file "scripts.vim" in your runtime directory (same place where filetype.vim goes). It might look like this: >
es: Para identificar este script cree un archivo «scripts.vim» en su directorio de tiempo de ejecución (el mismo sitio en donde está «filetype.vim»). El contenido del archivo es similar a lo siguiente: >

source: The first check with did_filetype() is to avoid that you will check the contents of files for which the filetype was already detected by the file name. That avoids wasting time on checking the file when the "setf" command won't do anything. The scripts.vim file is sourced by an autocommand in the default filetype.vim file. Therefore, the order of checks is:
es: La primera comprobación con «did_filetype()» evita que se revise el contenido de un archivo cuyo tipo ya fue detectado usando el nombre de archivo. Así se evita desperdiciar tiempo revisando el archivo cuando se sabe que la orden «setf» no tendrá ningún efecto. El archivo «scripts.vim» es leído por una orden automática en el archivo «filetype.vim» predeterminado. Por consiguiente, el orden en que se hacen las comprobaciones es:

source: 1. filetype.vim files before $VIMRUNTIME in 'runtimepath' 2. first part of $VIMRUNTIME/filetype.vim 3. all scripts.vim files in 'runtimepath' 4. remainder of $VIMRUNTIME/filetype.vim 5. filetype.vim files after $VIMRUNTIME in 'runtimepath'
es: 1. Archivos «filetype.vim» antes de $VIMRUNTIME en 'runtimepath' 2. Primera parte de «$VIMRUNTIME/filetype.vim» 3. Todos los archivos «scripts.vim» en 'runtimepath' 4. El resto de «$VIMRUNTIME/filetype.vim» 5. Archivos «filetype.vim» luego de $VIMRUNTIME en 'runtimepath'

source: If this is not sufficient for you, add an autocommand that matches all files and sources a script or executes a function to check the contents of the file.
es: Si estos mecanismos no son suficientes, puede añadir una orden automática que coincida con todos los archivos y lea un script o ejecute una función para revisar el contenido del archivo.

source: Next chapter: |usr_44.txt| Your own syntax highlighted
es: Capítulo siguiente: |usr_44.txt| Su propio resaltado de sintaxis
