Repository: vim-doc-es/vimdocs
Catalog: 7.3/helpfiles/traducido/po/usr_40.txt.po
Languages: es

source: VIM USER MANUAL - by Bram Moolenaar
es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: Copyright: see |manual-copyright| vim:tw=78:ts=8:ft=help:norl:
es: Copyright: consulte |manual-copyright| vim:tw=78:ts=8:ft=help:norl:

source: DELETING
es: ELIMINAR

source: *usr_40.txt* For Vim version 7.3. Last change: 2006 Jun 21
es: *usr_40.esx* Para Vim version 7.3. Último cambio: 21/6/2006

source: Make new commands
es: Crear órdenes nuevas

source: Vim is an extensible editor. You can take a sequence of commands you use often and turn it into a new command. Or redefine an existing command. Autocommands make it possible to execute commands automatically.
es: Vim es un editor extensible. Puede tomar una secuencia de órdenes que usa regularmente, y transformarla en una nueva orden, o redefinir una orden existente. Las órdenes automáticas («Autocommands») permiten ejecutar órdenes de forma automática.

source: |40.1| Key mapping |40.2| Defining command-line commands |40.3| Autocommands
es: |40.1| Macros de teclado |40.2| Definir órdenes de línea de órdenes |40.3| Órdenes automáticas

source: Next chapter: |usr_41.txt| Write a Vim script Previous chapter: |usr_32.txt| The undo tree Table of contents: |usr_toc.txt|
es: Siguiente capítulo: |usr_41.esx| Escribir scripts para Vim Capítulo anterior: |usr_32.esx| El árbol de deshacer Tabla de contenidos: |usr_toc.esx|

source: *40.1* Key mapping
es: *40.1* Crear macros

source: A simple mapping was explained in section |05.3|. The principle is that one sequence of key strokes is translated into another sequence of key strokes. This is a simple, yet powerful mechanism. The simplest form is that one key is mapped to a sequence of keys. Since the function keys, except <F1>, have no predefined meaning in Vim, these are good choices to map. Example: >
es: En la sección |05.3| se explicaba una macro («mapping») sencilla. El principio es que una secuencia de pulsaciones de tecla se traduce a otra secuencia de pulsaciones de tecla. Es un mecanismo sencillo pero poderoso. La forma más simple es asignar una tecla a una secuencia de teclas. Debido a que las teclas de función, a excepción de <F1>, no tienen un significado predefinido para Vim, son buenas candidatas para definir macros. Ejemplo: >

source: :map <F2> GoDate: <Esc>:read !date<CR>kJ
es: :map <F2> GoFecha: <Esc>:read !date<CR>kJ

source: This shows how three modes are used. After going to the last line with "G", the "o" command opens a new line and starts Insert mode. The text "Date: " is inserted and <Esc> takes you out of insert mode. Notice the use of special keys inside <>. This is called angle bracket notation. You type these as separate characters, not by pressing the key itself. This makes the mappings better readable and you can copy and paste the text without problems. The ":" character takes Vim to the command line. The ":read !date" command reads the output from the "date" command and appends it below the current line. The <CR> is required to execute the ":read" command. At this point of execution the text looks like this:
es: Este ejemplo muestra como usar tres modos. Después de ir a la última línea con «G», la orden «o» crea una nueva línea e inicia el modo Insertar. Se inserta el texto «Date:», y <Esc> abandona el modo de inserción. Tenga en cuenta la definición de teclas especiales dentro de <>. Se la denomina notación de corchetes agudos. Escribe el nombre de la tecla usando varios caracteres, en vez de pulsar la tecla referida. Esto hace que las macros sean más legibles, permitiendo copiar y pegar el texto de las mismas sin problema. El carácter «:» inicia la línea de órdenes de Vim. La orden «:read !date» lee la salida de la orden «date» (fecha) y la añade bajo la línea actual. El <CR> se requiere para ejecutar la orden «:read». En este punto, el texto tiene el siguiente aspecto:

source: Date: ~ Fri Jun 15 12:54:34 CEST 2001 ~
es: Fecha: ~ Fri Jun 15 12:54:34 CEST 2001 ~

source: Now "kJ" moves the cursor up and joins the lines together. To decide which key or keys you use for mapping, see |map-which-keys|.
es: Ahora «kJ» desplaza el cursor hacia arriba y une las líneas. Para decidir qué teclas usar para las macros, consulte |map-which-keys|.

source: MAPPING AND MODES
es: ASIGNACIÓN DE MACROS Y MODOS

source: The ":map" command defines remapping for keys in Normal mode. You can also define mappings for other modes. For example, ":imap" applies to Insert mode. You can use it to insert a date below the cursor: >
es: La orden «:map» define una macro a usar en modo Normal. También puede definir macros para otros modos. Por ejemplo, «imap» afecta al modo Insertar. Puede usarlo para insertar una fecha bajo el cursor: >

source: :imap <F2> <CR>Date: <Esc>:read !date<CR>kJ
es: :imap <F2> <CR>Fecha: <Esc>:read !date<CR>kJ

source: It looks a lot like the mapping for <F2> in Normal mode, only the start is different. The <F2> mapping for Normal mode is still there. Thus you can map the same key differently for each mode. Notice that, although this mapping starts in Insert mode, it ends in Normal mode. If you want it to continue in Insert mode, append an "a" to the mapping.
es: Se parece mucho a la macro para <F2> en modo Normal, sólo el principio es diferente. La macro <F2> para el modo Normal aún existe. Puede asignar la misma tecla de forma diferente según el modo. Tenga en cuenta que, aunque esta macro empieza en el modo Insertar, termina en modo Normal. Si desea continuar en modo Insertar, añada una «a» a la macro.

source: Here is an overview of map commands and in which mode they work:
es: Esta es una vista general de las órdenes «:map» y los modos en que funcionan:

source: :map Normal, Visual and Operator-pending :vmap Visual :nmap Normal :omap Operator-pending :map! Insert and Command-line :imap Insert :cmap Command-line
es: :map Normal, Visual y Operator-pending :vmap Visual :nmap Normal :omap Operator-pending :map! Insertar y Command-line :imap Insertar :cmap Línea de órdenes

source: Operator-pending mode is when you typed an operator character, such as "d" or "y", and you are expected to type the motion command or a text object. Thus when you type "dw", the "w" is entered in operator-pending mode.
es: El modo Operator-pending es aquel al que se entra al aplicar un operador introduciendo el carácter correspondiente al mismo, por ejemplo «y» o «d», y se espera a que se indique una orden de desplazamiento o un objeto de texto. Por ello, cuando teclea «dw», la «w» es introducida en el modo Operator-pending

source: Suppose that you want to define <F7> so that the command d<F7> deletes a C program block (text enclosed in curly braces, {}). Similarly y<F7> would yank the program block into the unnamed register. Therefore, what you need to do is to define <F7> to select the current program block. You can do this with the following command: >
es: Suponga que desea definir <F7> para que la orden «d<F7>» elimine el bloque de un programa escrito en C (el texto encerrado con llaves, {}). De forma similar «y<F7>» copiaría el bloque del programa al registro sin nombre. Por ello, lo que debe hacer es definir <F7> para seleccionar el bloque actual del programa. La siguiente orden le permite hacer esto: >

source: This causes <F7> to perform a select block "a{" in operator-pending mode, just like you typed it. This mapping is useful if typing a { on your keyboard is a bit difficult.
es: Esto hace que <F7> realice una selección de bloque «a{» en el modo Operator-pending, justo como lo escribió. Esta macro es útil si teclear «a{» en su teclado es difícil.

source: LISTING MAPPINGS
es: LISTAR MACROS

source: To see the currently defined mappings, use ":map" without arguments. Or one of the variants that include the mode in which they work. The output could look like this:
es: Para ver las macros definidas actualmente, use «:map» sin argumentos. O una de las variantes que incluyen el modo en que funcionan. La salida de dicha orden es similar a ésta:

source: The first column of the list shows in which mode the mapping is effective. This is "n" for Normal mode, "i" for Insert mode, etc. A blank is used for a mapping defined with ":map", thus effective in both Normal and Visual mode. One useful purpose of listing the mapping is to check if special keys in <> form have been recognized (this only works when color is supported). For example, when <Esc> is displayed in color, it stands for the escape character. When it has the same color as the other text, it is five characters.
es: La primera columna de la lista muestra el modo en el que la macro tiene efecto. Esto es, «n» para el modo Normal, «i» para el modo Insertar, etc... Se usa un espacio en blanco con las macros definidas mediante «:map», y por ello, con efecto en el modo Visual y Normal. Un propósito útil de listar las macros es comprobar si se han reconocido las teclas especiales de la forma <> (sólo funciona con compatibilidad con color). Por ejemplo, cuando <Esc> se muestra en color, simboliza el carácter de escape. Cuando tiene el mismo color que el resto del texto, simboliza cinco caracteres.

source: REMAPPING
es: REASIGNACIÓN DE MACROS

source: The result of a mapping is inspected for other mappings in it. For example, the mappings for <F2> above could be shortened to: >
es: El resultado de una macro se inspecciona en busca de otras macros en ella. Por ejemplo, las macros para <F2> vistas anteriormente se pueden acortar: >

source: :map <F2> G<F3> :imap <F2> <Esc><F3> :map <F3> oDate: <Esc>:read !date<CR>kJ
es: :map <F2> G<F3> :imap <F2> <Esc><F3> :map <F3> oFecha: <Esc>:read !date<CR>kJ

source: For Normal mode <F2> is mapped to go to the last line, and then behave like <F3> was pressed. In Insert mode <F2> stops Insert mode with <Esc> and then also uses <F3>. Then <F3> is mapped to do the actual work.
es: En modo Normal, <F2> tiene una macro para ir a la última línea, y después comportarse como si se hubiese pulsado <F3>. En modo Insertar, <F2> detiene el modo Insertar con <Esc>, y después usa también <F3>. <F3> tiene una macro que se encarga de hacer el trabajo real.

source: Suppose you hardly ever use Ex mode, and want to use the "Q" command to format text (this was so in old versions of Vim). This mapping will do it: >
es: Suponga que apenas usa el modo Ex, y desea usar la orden «Q» para formatear texto (este era el comportamiento en versiones anteriores de Vim). Esta macro realizará esta función: >

source: But, in rare cases you need to use Ex mode anyway. Let's map "gQ" to Q, so that you can still go to Ex mode: >
es: Pero, en algunos casos necesita usar el modo Ex. Vamos a asignar «gQ» a «Q», para que así pueda ir la modo Ex: >

source: What happens now is that when you type "gQ" it is mapped to "Q". So far so good. But then "Q" is mapped to "gq", thus typing "gQ" results in "gq", and you don't get to Ex mode at all. To avoid keys to be mapped again, use the ":noremap" command: >
es: Lo que ocurre ahora es que cuando escribe «gQ», se asigna a la «Q». Por ahora, todo bien. Pero, a continuación, asigna «Q» a «gq», y por ello escribir «gQ» resulta en «gq», y no entra en modo Ex. Para evitar que las teclas se asignen de nuevo, utilice la orden «:noremap»: >

source: Now Vim knows that the "Q" is not to be inspected for mappings that apply to it. There is a similar command for every mode:
es: Ahora Vim sabe que no debe analizar «Q» en busca de macros que le afecten. Existe una orden similar para cada modo:

source: :noremap Normal, Visual and Operator-pending :vnoremap Visual :nnoremap Normal :onoremap Operator-pending :noremap! Insert and Command-line :inoremap Insert :cnoremap Command-line
es: :noremap Normal, Visual y Operator-pending :vnoremap Visual :nnoremap Normal :onoremap Operator-pending :noremap! Insertar y Línea de órdenes :inoremap Insertar :cnoremap Línea de órdenes

source: RECURSIVE MAPPING
es: MACROS RECURSIVAS

source: When a mapping triggers itself, it will run forever. This can be used to repeat an action an unlimited number of times. For example, you have a list of files that contain a version number in the first line. You edit these files with "vim *.txt". You are now editing the first file. Define this mapping: >
es: Cuando una macro se activa a sí misma, se ejecutará indefinidamente. Puede usar esto para repetir una acción un número ilimitado de veces. Por ejemplo, tiene una lista de archivos que contienen un número de versión en la primera línea. Después, edita estos archivos con «vim *.txt». Ahora está editando el primer archivo. Defina esta macro: >

source: Now you type ",,". This triggers the mapping. It replaces "5.1" with "5.2" in the first line. Then it does a ":wnext" to write the file and edit the next one. The mapping ends in ",,". This triggers the same mapping again, thus doing the substitution, etc. This continues until there is an error. In this case it could be a file where the substitute command doesn't find a match for "5.1". You can then make a change to insert "5.1" and continue by typing ",," again. Or the ":wnext" fails, because you are in the last file in the list. When a mapping runs into an error halfway, the rest of the mapping is discarded. CTRL-C interrupts the mapping (CTRL-Break on MS-Windows).
es: Ahora introduce «,,», iniciando la macro. Reemplaza «5.1» con «5.2» en la primera línea. A continuación, ejecuta «:wnext» para guardar el archivo y editar el siguiente. La macro termina con «,,», iniciando la macro una vez más, llevando a cabo la sustitución, etc. Este proceso continúa hasta encontrar un error. En este caso, podría ser un archivo que no contiene ninguna coincidencia con el patrón de sustitución, «5.1». Puede hacer un cambio para insertar «5.1» y continuar tecleando «,,» otra vez. O, la orden «:wnext» puede devolver error si está en el último archivo de la lista. Cuando una macro detecta un error durante el proceso, se descarta el resto de la misma. «CTRL-C» interrumpe la macro («CTRL-Ins» en Windows).

source: DELETE A MAPPING
es: BORRAR UNA MACRO

source: To remove a mapping use the ":unmap" command. Again, the mode the unmapping applies to depends on the command used:
es: Use la orden «:unmap» para eliminar una macro. Una vez más, el modo sobre el que actúa la eliminación de la macro depende de la orden usada:

source: :unmap Normal, Visual and Operator-pending :vunmap Visual :nunmap Normal :ounmap Operator-pending :unmap! Insert and Command-line :iunmap Insert :cunmap Command-line
es: :unmap Normal, Visual y Operator-pending :vunmap Visual :nunmap Normal :ounmap Operator-pending :unmap! Insertar y Línea de órdenes :iunmap Insertar :cunmap Línea de órdenes

source: There is a trick to define a mapping that works in Normal and Operator-pending mode, but not in Visual mode. First define it for all three modes, then delete it for Visual mode: >
es: Dispone de un truco para definir una macro que funcione tanto en modo Operator- pending como Normal, pero no en modo Visual. Primero, defina la macro para los tres modos, y después borre la macro del modo Visual: >

source: Notice that the five characters "<C-A>" stand for the single key CTRL-A.
es: Tenga en cuenta que los cinco caracters «<C-A>» representan una única tecla, «CTRL-A».

source: To remove all mappings use the |:mapclear| command. You can guess the variations for different modes by now. Be careful with this command, it can't be undone.
es: Use la orden |:mapclear| para eliminar todas las macros. A estas alturas puede adivinar las variantes disponibles para los distintos modos. Tenga cuidado con esta orden, ya que su acción no se puede deshacer.

source: SPECIAL CHARACTERS
es: CARACTERES ESPECIALES

source: The ":map" command can be followed by another command. A | character separates the two commands. This also means that a | character can't be used inside a map command. To include one, use <Bar> (five characters). Example: > :map <F8> :write <Bar> !checkin %<CR>
es: La orden «:map» puede ir seguida de otra orden. Un carácter «|» separa ambas órdenes. Esto también significa que no puede usar un carácter «|» dentro de una orden «map». Para incluir uno, use <Bar> (cinco caracteres). Ejemplo: > :map <F8> :write <Bar> !checkin %<CR>

source: The same problem applies to the ":unmap" command, with the addition that you have to watch out for trailing white space. These two commands are different: > :unmap a | unmap b :unmap a| unmap b
es: El mismo problema afecta a la orden «:unmap», con la adición de que debe tener cuidado con espacios vacíos adicionales al final de la línea. Estas dos órdenes son diferentes: > :unmap a | unmap b :unmap a| unmap b

source: The first command tries to unmap "a ", with a trailing space.
es: La primera orden intenta eliminar la macro de «a », con un espacio adicional.

source: When using a space inside a mapping, use <Space> (seven characters): >
es: Al usar un espacio en una macro, use <Space> (siete caracteres): >

source: This makes the spacebar move a blank-separated word forward.
es: Esto hace que la barra de espacio avance una palabra separada por espacios.

source: It is not possible to put a comment directly after a mapping, because the " character is considered to be part of the mapping. You can use |", this starts a new, empty command with a comment. Example: >
es: No es posible insertar un comentario justo antes de una macro, ya que el carácter «"» se considera parte de la macro. Puede usar «|"», iniciando una nueva orden, vacía, con un comentario. Ejemplo: >

source: :map <Space> W| " Use spacebar to move forward a word
es: :map <Space> W| " Usa la barra de espacio para avanzar un palabra

source: MAPPINGS AND ABBREVIATIONS
es: MACROS Y ABREVIATURAS

source: Abbreviations are a lot like Insert mode mappings. The arguments are handled in the same way. The main difference is the way they are triggered. An abbreviation is triggered by typing a non-word character after the word. A mapping is triggered when typing the last character. Another difference is that the characters you type for an abbreviation are inserted in the text while you type them. When the abbreviation is triggered these characters are deleted and replaced by what the abbreviation produces. When typing the characters for a mapping, nothing is inserted until you type the last character that triggers it. If the 'showcmd' option is set, the typed characters are displayed in the last line of the Vim window. An exception is when a mapping is ambiguous. Suppose you have done two mappings: >
es: Las abreviaturas se parecen mucho a las macros del modo Insertar. Los argumentos se tratan de la misma forma. La diferencia principal es la forma en que se ejecutan. Una abreviatura se inicia tecleando un carácter que no sea una palabra, a continuación de una palabra. Una macro se inicia al teclear el último carácter. Otra diferencia es que los caracteres que usa para una abreviatura se insertan en el texto mientras los teclea. Al ejecutar la abreviatura, estos caracteres se eliminan y reemplazan por el resultado de la abreviatura. Al teclear los caracteres de una macro, no se inserta nada hasta que introduce el último carácter que la inicia. Si la opción 'showcmd' está definida, los caracteres tecleados se muestran en la última línea de la ventana de Vim. Una excepción es cuando la macro es ambigua. Suponga que tiene dos macros: >

source: Now, when you type "aa", Vim doesn't know if it should apply the first or the second mapping. It waits for another character to be typed. If it is an "a", the second mapping is applied and results in "bar". If it is a space, for example, the first mapping is applied, resulting in "foo", and then the space is inserted.
es: Ahora, cuando escribe «aa», Vim no sabe si corresponde a la primera o a la segunda macro. Espera a que se introduzca otro carácter. Si es una «a», se ejecuta la segunda macro, cuyo resultado es «bar». Si es un espacio, por ejemplo, se ejecuta la primera macro, resultando en «foo», para después insertar el espacio.

source: ADDITIONALLY...
es: ADEMÁS...

source: The <script> keyword can be used to make a mapping local to a script. See |:map-<script>|.
es: Puede usar la palabra clave <script> para hacer que una macro sea local al script. Consulte |:map-<script>|.

source: The <buffer> keyword can be used to make a mapping local to a specific buffer. See |:map-<buffer>|
es: La palabra clave <buffer> se puede usar para que una macro sea local a un búfer específico. Consulte |:map-<buffer>|.

source: The <unique> keyword can be used to make defining a new mapping fail when it already exists. Otherwise a new mapping simply overwrites the old one. See |:map-<unique>|.
es: La palabra clave <unique> se puede usar para que definir una macro nueva falle cuando ésta ya existe. En caso contrario, una nueva macro sencillamente sobreescribe la preexistente. Consulte |:map-<unique>|.

source: To make a key do nothing, map it to <Nop> (five characters). This will make the <F7> key do nothing at all: >
es: Para que una tecla no haga nada, asígnela a <Nop> (cinco caracteres). Lo siguiente hace que la tecla <F7> no tenga efecto alguno: >

source: There must be no space after <Nop>.
es: No debe haber ningún espacio después de <Nop>.

source: *40.2* Defining command-line commands
es: *40.2* Definir órdenes de línea de órdenes

source: The Vim editor enables you to define your own commands. You execute these commands just like any other Command-line mode command. To define a command, use the ":command" command, as follows: >
es: El editor Vim le permite crear sus propias órdenes. Puede ejecutar estas órdenes como cualquier otra orden del modo Línea de órdenes. Para definir una orden, use la orden «:command» de la siguiente forma: >

source: :command DeleteFirst 1delete
es: :command BorrarPrimera 1delete

source: Now when you execute the command ":DeleteFirst" Vim executes ":1delete", which deletes the first line.
es: Ahora, cuando ejecuta la orden «BorrarPrimera», Vim ejecuta «:1delete», que elimina la primera línea.

source: Note: User-defined commands must start with a capital letter. You cannot use ":X", ":Next" and ":Print". The underscore cannot be used! You can use digits, but this is discouraged.
es: Nota: Las órdenes definidas por el usuario deben comenzar con una letra mayúscula. No puede usar «:X», «:Next» ni «:Print». ¡No puede usar el guión bajo! Puede usar dígitos, pero no se recomienda.

source: To list the user-defined commands, execute the following command: >
es: Use la siguiente orden para listar las órdenes de usuario: >

source: Just like with the builtin commands, the user defined commands can be abbreviated. You need to type just enough to distinguish the command from another. Command line completion can be used to get the full name.
es: Al igual que las órdenes integradas, las órdenes definidas por el usuario se pueden abreviar. Necesita teclear lo justo para distinguir una orden de otra. Puede usar el autocompletado de línea de órdenes para obtener el nombre completo.

source: NUMBER OF ARGUMENTS
es: NÚMERO DE ARGUMENTOS

source: User-defined commands can take a series of arguments. The number of arguments must be specified by the -nargs option. For instance, the example :DeleteFirst command takes no arguments, so you could have defined it as follows: >
es: Las órdenes definidas por el usuario pueden tomar una serie de argumentos. El número de argumentos se debe especificar con la opción «-nargs». Por ejemplo, la orden de ejemplo «BorrarPrimera» no permite argumentos, así que la debe definir del siguiente modo: >

source: :command -nargs=0 DeleteFirst 1delete
es: :command -nargs=0 BorrarPrimera 1delete
