Repository: vim-doc-es/vimdocs
Catalog: 7.3/helpfiles/traducido/po/usr_42.txt.po
Languages: es

source: The toolbar appears only when the "T" flag is included in the 'guioptions' option. The toolbar uses icons rather than text to represent the command. For example, the {menu-item} named "ToolBar.New" causes the "New" icon to appear on the toolbar. The Vim editor has 28 built-in icons. You can find a table here: |builtin-tools|. Most of them are used in the default toolbar. You can redefine what these items do (after the default menus are setup). You can add another bitmap for a toolbar item. Or define a new toolbar item with a bitmap. For example, define a new toolbar item with: >
es: La barra de herramientas aparece únicamente cuando se incluye la opción «T» en 'guioptions'. La barra de herramientas usa íconos en lugar de texto para representar la orden asociada. Por ejemplo, el {elemento-menú} llamado «ToolBar.Nueva» hace que el ícono «Nueva» aparezca en la barra de herramientas. El editor Vim cuenta con 28 íconos incorporados. En |builtin-tools| encuentra una tabla con todos ellos. La mayoría de ellos se usa en la barra de herramientas predeterminada. Es posible redefinir qué hacen estos elementos (luego de la configuración de los menús predeterminados.)

source: :tmenu ToolBar.Compile Compile the current file :amenu ToolBar.Compile :!cc % -o %:r<CR>
es: :tmenu ToolBar.Compile :amenu ToolBar.Compile :!cc % -o %:r<CR>
