Repository: vim-doc-es/vimdocs
Catalog: 7.3/helpfiles/traducido/po/usr_40.txt.po
Languages: es

source: However, because zero arguments is the default, you do not need to add "-nargs=0". The other values of -nargs are as follows:
es: Sin embargo, ya que cero argumentos es el comportamiento predeterminado, no necesita añadir «-nargs=0». A continuación puede ver los otros valores de «-nargs»:

source: -nargs=0 No arguments -nargs=1 One argument -nargs=* Any number of arguments -nargs=? Zero or one argument -nargs=+ One or more arguments
es: -nargs=0 Sin argumentos -nargs=1 Un argumento -nargs=* Cualquier número de argumentos -nargs=? Cero o más argumentos -nargs=+ Uno o más argumentos

source: USING THE ARGUMENTS
es: USAR ARGUMENTOS

source: Inside the command definition, the arguments are represented by the <args> keyword. For example: >
es: Dentro de la definición de la orden, los argumentos se representan con la palabra clave <args>. Por ejemplo: >

source: :command -nargs=+ Say :echo "<args>"
es: :command -nargs=+ Decir :echo "<args>"

source: Now when you type >
es: Ahora, cuando escribe >

source: :Say Hello World
es: :Decir Hola Mundo

source: Vim echoes "Hello World". However, if you add a double quote, it won't work. For example: >
es: Vim muestra «Hola Mundo». Sin embargo, no funcionará si añade una comilla doble. Por ejemplo: >

source: :Say he said "hello"
es: :Decir él dijo "hola"

source: To get special characters turned into a string, properly escaped to use as an expression, use "<q-args>": >
es: Para que los caracteres especiales se conviertan en una cadena, correctamente escapada para usarla como expresión, use «<q-args>»: >

source: :command -nargs=+ Say :echo <q-args>
es: :command -nargs=+ Decir :echo <q-args>

source: Now the above ":Say" command will result in this to be executed: >
es: Ahora, la anterior orden «:Decir» resultará en lo siguiente al ejecutarse: >

source: :echo "he said \"hello\""
es: :echo "él dijo \"hola\""

source: The <f-args> keyword contains the same information as the <args> keyword, except in a format suitable for use as function call arguments. For example: > :command -nargs=* DoIt :call AFunction(<f-args>) :DoIt a b c
es: La palabra clave <f-args> contiene la misma información que la palabra clave <args>, pero en un formato adecuado para usar como argumentos para invocación de funciones. Por ejemplo: > :command -nargs=* Ejecutar :call UnaFuncion(<f-args>) :Ejecutar a b c

source: Executes the following command: >
es: Ejecuta la siguiente orden: >

source: :call AFunction("a", "b", "c")
es: :call UnaFuncion("a", "b", "c")

source: LINE RANGE
es: RANGOS DE LÍNEA

source: Some commands take a range as their argument. To tell Vim that you are defining such a command, you need to specify a -range option. The values for this option are as follows:
es: Algunas órdenes toman un rango como argumento. Para indicar a Vim que está definiendo una orden así, debe especificar una opción «-range». A continuación puede ver los valores de esta opción:

source: -range Range is allowed; default is the current line. -range=% Range is allowed; default is the whole file. -range={count} Range is allowed; the last number in it is used as a single number whose default is {count}.
es: -range El rango está permitido, el valor predeterminado es la línea actual. -range=% El rango está permitido, el valor predeterminado es el archivo completo. -range={número} El rango está permitido, el último número presente se usa como un sólo número cuyo valor predeterminado es {número}.

source: When a range is specified, the keywords <line1> and <line2> get the values of the first and last line in the range. For example, the following command defines the SaveIt command, which writes out the specified range to the file "save_file": >
es: Cuando se especifica un rango, las palabras clave <line1> y <line2> obtienen el valor de la primera y la última línea del rango. Por ejemplo, la siguiente orden define la orden «Guardalo», que escribe el rango especificado al archivo «archivo_guardado»: >

source: :command -range=% SaveIt :<line1>,<line2>write! save_file
es: :command -range=% Guardalo :<line1>,<line2>write! archivo_guardado

source: OTHER OPTIONS
es: OTRAS OPCIONES

source: Some of the other options and keywords are as follows:
es: A continuación puede ver algunas de las otras opciones y palabras clave:

source: -count={number} The command can take a count whose default is {number}. The resulting count can be used through the <count> keyword. -bang You can use a !. If present, using <bang> will result in a !. -register You can specify a register. (The default is the unnamed register.) The register specification is available as <reg> (a.k.a. <register>). -complete={type} Type of command-line completion used. See |:command-completion| for the list of possible values. -bar The command can be followed by | and another command, or " and a comment. -buffer The command is only available for the current buffer.
es: -count={número} La orden acepta un número cuyo valor predeterminado es {número}. El número resultante se puede usar con la palabra clave <count>. -bang Puede usar «!». Si está presente, usar <bang> resultará en «!». -register Puede definir un registro. (El registro predeterminado es el que no tiene nombre.) La especificación del registro está disponible como <reg> (esto es, <register>). -complete={tipo} El tipo de completado automático usado. Consulte |:command-completion| para una lista de los valores aceptados. -bar La orden puede ir seguida de «|» y otra orden, o «"» y un comentario. -buffer La orden sólo está disponible en el búfer actual.

source: Finally, you have the <lt> keyword. It stands for the character <. Use this to escape the special meaning of the <> items mentioned.
es: Por último, tiene la palabra clave <lt>. Simboliza el carácter «<». Úselo para escapar el significado especial de los elementos <> mencionados.

source: REDEFINING AND DELETING
es: REDEFINIR Y ELIMINAR

source: To redefine the same command use the ! argument: >
es: Use el argumento «!» para redefinir la misma orden: >

source: :command -nargs=+ Say :echo "<args>" :command! -nargs=+ Say :echo <q-args>
es: :command -nargs=+ Decir :echo "<args>" :command! -nargs=+ Decir :echo <q-args>

source: To delete a user command use ":delcommand". It takes a single argument, which is the name of the command. Example: >
es: Use «:delcommand» para eliminar una orden de usuario. Toma un único argumento, el nombre de la orden. Ejemplo: >

source: :delcommand SaveIt
es: :delcommand Guardalo

source: To delete all the user commands: >
es: Para eliminar todas las órdenes de usuario: >

source: Careful, this can't be undone!
es: ¡Cuidado, no se puede deshacer!

source: More details about all this in the reference manual: |user-commands|.
es: Puede encontrar más detalles en el manual de referencia: |user-commands|.

source: *40.3* Autocommands
es: *40.3* Órdenes automáticas

source: An autocommand is a command that is executed automatically in response to some event, such as a file being read or written or a buffer change. Through the use of autocommands you can train Vim to edit compressed files, for example. That is used in the |gzip| plugin. Autocommands are very powerful. Use them with care and they will help you avoid typing many commands. Use them carelessly and they will cause a lot of trouble.
es: Una orden automática (Autocommand) es una orden a ejecutar en respuesta otro evento, como por ejemplo la lectura o edición de un archivo, o un cambio en un búfer. Por ejemplo, Vim puede editar archivos comprimidos a través de las órdenes automáticas. La extensión |gzip| hace uso de esto. Las órdenes automáticas son muy potentes. Úselas con cuidado, y le ayudarán a disminuir el número de órdenes que introduce. Úselas sin cuidado, y generarán un gran número de problemas.

source: Suppose you want to replace a datestamp on the end of a file every time it is written. First you define a function: >
es: Suponga que desea reemplazar una marca de tiempo al final del archivo cada vez que lo guarde. Primero, defina una función: >

source: :function DateInsert() : $delete : read !date :endfunction
es: :function InsertarFecha() : $delete : read !date :endfunction

source: You want this function to be called each time, just before a file is written. This will make that happen: >
es: Desea que esta función se invoque justo antes de guardar un archivo. Lo siguiente logra este objetivo: >

source: :autocmd FileWritePre * call DateInsert()
es: :autocmd FileWritePre * call InsertarFecha()

source: "FileWritePre" is the event for which this autocommand is triggered: Just before (pre) writing a file. The "*" is a pattern to match with the file name. In this case it matches all files. With this command enabled, when you do a ":write", Vim checks for any matching FileWritePre autocommands and executes them, and then it performs the ":write". The general form of the :autocmd command is as follows: >
es: «FileWritePre» es el evento que activa esta orden automática. Justo antes (pre) de guardar un archivo. El carácter «*» es el patrón con el que comparar el nombre del archivo. En este caso, coincide con todos los archivos. Si activa esta orden, al ejecutar «:write» Vim comprobará todas las órdenes automáticas «FileWritePre» para las que haya coincidencia, ejecutándolas, para finalizar realizando la acción «:write». A continuación tiene la forma habitual de la orden «:autocmd»: >

source: :autocmd [group] {events} {file_pattern} [nested] {command}
es: :autocmd [group] {eventos} {patrón_archivo} [nested] {orden}

source: The [group] name is optional. It is used in managing and calling the commands (more on this later). The {events} parameter is a list of events (comma separated) that trigger the command. {file_pattern} is a filename, usually with wildcards. For example, using "*.txt" makes the autocommand be used for all files whose name end in ".txt". The optional [nested] flag allows for nesting of autocommands (see below), and finally, {command} is the command to be executed.
es: El elemento [group] (grupo) es opcional. Se usa al gestionar e invocar las órdenes (más información más adelante). El parámetro {eventos} es una lista separada por comas de eventos que inician la orden. {patrón_archivo} es un nombre de archivo, a menudo con comodines. Por ejemplo, usar «*.txt» provoca que la orden automática afecte a todos los archivos cuyo nombre termina en «.txt». El elemento opcional [nested] (anidado) permite anidar órdenes automáticas (ver a continuación), y, por último, {orden} es la orden a ejecutar.

source: EVENTS
es: EVENTOS

source: One of the most useful events is BufReadPost. It is triggered after a new file is being edited. It is commonly used to set option values. For example, you know that "*.gsm" files are GNU assembly language. To get the syntax file right, define this autocommand: >
es: Uno de los eventos más útiles es «BufReadPost». Se inicia después de iniciar la edición de un nuevo archivo. Se usa habitualmente para definir valores para opciones. Por ejemplo, sabe que los archivos «.gsm» están escritos en lenguaje ensamblador de GNU. Especifique esta orden para obtener la sintaxis de archivo adecuada: >

source: If Vim is able to detect the type of file, it will set the 'filetype' option for you. This triggers the Filetype event. Use this to do something when a certain type of file is edited. For example, to load a list of abbreviations for text files: >
es: Si Vim es capaz de detectar el tipo de archivo, definirá la opción 'filetype' automáticamente. Esto provoca el evento «Filetype». Puede usarlo para iniciar una acción al editar un tipo de archivo en particular. Por ejemplo, para cargar una lista de abreviaturas para archivos de texto: >

source: When starting to edit a new file, you could make Vim insert a skeleton: >
es: Puede hacer que Vim inserte una plantilla básica al editar un nuevo archivo: >

source: See |autocmd-events| for a complete list of events.
es: Consulte |autocmd-events| para una lista completa de eventos.

source: PATTERNS
es: PATRONES

source: The {file_pattern} argument can actually be a comma-separated list of file patterns. For example: "*.c,*.h" matches files ending in ".c" and ".h". The usual file wildcards can be used. Here is a summary of the most often used ones:
es: El argumento {patrón_archivo] puede ser una lista separada por comas de patrones de archivo. Por ejemplo, «*.c,*.h» coincide con los archivos terminados en «.c» y «.h». Puede usar los comodines de archivo habituales. Aquí tiene un resumen de los más usados:

source: * Match any character any number of times ? Match any character once [abc] Match the character a, b or c . Matches a dot a{b,c} Matches "ab" and "ac"
es: * Busca cualquier caracteres cualquier número de veces ? Busca cualquier carácter una vez [abc] Busca el carácter a, b o c . Busca un punto a{b,c} Busca «ab» y «ac»

source: When the pattern includes a slash (/) Vim will compare directory names. Without the slash only the last part of a file name is used. For example, "*.txt" matches "/home/biep/readme.txt". The pattern "/home/biep/*" would also match it. But "home/foo/*.txt" wouldn't. When including a slash, Vim matches the pattern against both the full path of the file ("/home/biep/readme.txt") and the relative path (e.g., "biep/readme.txt").
es: Cuando el patrón incluye una barra «/», Vim comparará los nombres de directorio. Sin la barra, sólo se usará la última parte del nombre de archivo. Por ejemplo, «*.txt» coincide con «/home/biep/leame.txt». El patrón «/home/biep/*» también coincidiría, pero no «home/foo/*.txt». Al incluir la barra, Vim compara el patrón con la ruta absoluta del archivo, «/home/biep/leame.txt» y con la ruta relativa, esto es, «biep/leame.txt»).

source: Note: When working on a system that uses a backslash as file separator, such as MS-Windows, you still use forward slashes in autocommands. This makes it easier to write the pattern, since a backslash has a special meaning. It also makes the autocommands portable.
es: Nota: Al trabajar con un sistema que usa la barra inversa como separador de archivos, como MS-Windows, es necesario usar la barra inclinada en las órdenes automáticas. Esto facilita escribir un patrón, ya que la barra inversa tiene un significado especial. También hace portables las órdenes automáticas.

source: To delete an autocommand, use the same command as what it was defined with, but leave out the {command} at the end and use a !. Example: >
es: Para eliminar una orden automática, use la misma orden con la que se definió, pero omitiendo la {orden} al final y usando «!». Ejemplo: >

source: This will delete all autocommands for the "FileWritePre" event that use the "*" pattern.
es: Esto eliminará todas las órdenes automáticas para el evento «FileWritePre» que usan el patrón «*».

source: LISTING
es: LISTAR

source: To list all the currently defined autocommands, use this: >
es: Use la siguiente orden para listar todas las órdenes automáticas definidas actualmente: >

source: The list can be very long, especially when filetype detection is used. To list only part of the commands, specify the group, event and/or pattern. For example, to list all BufNewFile autocommands: >
es: Esta lista puede ser muy larga, en particular si se utiliza la detección de tipo de archivo. Para listar sólo parte de las órdenes, especifique el grupo, evento y/o patrón. Por ejemplo, para listar todas las órdenes automáticas para «BufNewFile»: >

source: To list all autocommands for the pattern "*.c": >
es: Para listar todas las órdenes automáticas para el patrón «*.c»: >

source: Using "*" for the event will list all the events. To list all autocommands for the cprograms group: >
es: Usar «*» como el evento lista todos los eventos. Para listar todas las órdenes automáticas del grupo cprograms: >

source: GROUPS
es: GRUPOS

source: The {group} item, used when defining an autocommand, groups related autocommands together. This can be used to delete all the autocommands in a certain group, for example. When defining several autocommands for a certain group, use the ":augroup" command. For example, let's define autocommands for C programs: >
es: El elemento {grupo}, usado al definir una orden automática, agrupa órdenes automáticas relacionadas. Se puede usar para eliminar todas las órdenes automáticas en un grupo particular, por ejemplo. Al definir varias órdenes automáticas para un grupo particular, use la orden «:augroup». Por ejemplo, definamos unas órdenes automáticas para programas C: >

source: This will do the same as: >
es: El resultado sería idéntico con: >

source: To delete all autocommands in the "cprograms" group: >
es: Para eliminar todas las órdenes automáticas en el grupo «cprograms»: >

source: NESTING
es: ANIDADO

source: Generally, commands executed as the result of an autocommand event will not trigger any new events. If you read a file in response to a FileChangedShell event, it will not trigger the autocommands that would set the syntax, for example. To make the events triggered, add the "nested" argument: >
es: Habitualmente, las órdenes ejecutadas como resultado de un evento de orden automática no iniciarán ningún evento nuevo. Por ejemplo, si lee un archivo como respuesta a un evento «FileChangedShell», no se iniciarán las órdenes automáticas que definirían la sintaxis. Para que se los eventos se inicien, añada el argumento «nested»: >

source: EXECUTING AUTOCOMMANDS
es: EJECUTAR ÓRDENES AUTOMÁTICAS

source: It is possible to trigger an autocommand by pretending an event has occurred. This is useful to have one autocommand trigger another one. Example: >
es: Es posible iniciar una orden automática simulando un evento. Es útil para que una orden automática inicie otra. Ejemplo: >

source: This defines an autocommand that is triggered when a new file has been edited. The file name must end in ".new". The ":execute" command uses expression evaluation to form a new command and execute it. When editing the file "tryout.c.new" the executed command will be: >
es: Esto define una orden automática que se inicia al editar un nuevo archivo. El nombre de archivo debe terminar con «.new». La orden «:execute» usa evaluación de expresiones para formar una orden nueva y ejecutarla. La orden ejecutada al editar el archivo «prueba.c.new» sería: >

source: The expand() function takes the "<afile>" argument, which stands for the file name the autocommand was executed for, and takes the root of the file name with ":r".
es: La función expand() toma el argumento «<afile>», que simboliza el nombre de archivo para el que se inició la orden automática, y toma la raíz del nombre archivo con «:r».

source: ":doautocmd" executes on the current buffer. The ":doautoall" command works like "doautocmd" except it executes on all the buffers.
es: «:doautocmd» se ejecuta en el búfer actual. La orden «:doautoall» funciona como «doautocmd», con la diferencia de que afecta a todos los búfers.

source: USING NORMAL MODE COMMANDS
es: USAR ÓRDENES DEL MODO NORMAL

source: The commands executed by an autocommand are Command-line commands. If you want to use a Normal mode command, the ":normal" command can be used. Example: >
es: Las órdenes ejecutadas por una orden automática son órdenes del modo Línea de órdenes. Si desea usar una orden del modo normal, puede usar la orden «:normal». Ejemplo: >

source: This will make the cursor jump to the last line of *.log files when you start to edit it. Using the ":normal" command is a bit tricky. First of all, make sure its argument is a complete command, including all the arguments. When you use "i" to go to Insert mode, there must also be a <Esc> to leave Insert mode again. If you use a "/" to start a search pattern, there must be a <CR> to execute it. The ":normal" command uses all the text after it as commands. Thus there can be no | and another command following. To work around this, put the ":normal" command inside an ":execute" command. This also makes it possible to pass unprintable characters in a convenient way. Example: >
es: Esto hará que el cursor salte a la última línea de archivos «*.log» cuando empiece a editarlos. Usar la orden «:normal» es un poco difícil. Primero, compruebe que su argumento es una orden completa, incluyendo todos los argumentos. Cuando usa una «i» para entrar el modo Insertar, también debe tener un <Esc> para abandonar el modo Insertar. Si usa «/» para iniciar una búsqueda de un patrón, debe usar <CR> para ejecutarlo. La orden «:normal» usa todo el texto a continuación como órdenes. Por ello, no debe estar presente «|» y una orden a continuación. Para solucionar este problema, ubique la orden «:normal» dentro de una orden «:execute». También posibilita pasar caracteres no imprimibles de una forma cómoda. Ejemplo: >

source: :autocmd BufReadPost *.chg execute "normal ONew entry:\<Esc>" | \ 1read !date
es: :autocmd BufReadPost *.chg execute "normal ONueva entrada:\<Esc>" | \ 1read !date

source: This also shows the use of a backslash to break a long command into more lines. This can be used in Vim scripts (not at the command line).
es: Esto también muestra el usa de la barra inversa para dividir una orden en varias líneas. Se puede usar en scripts de Vim (no en la línea de órdenes).

source: When you want the autocommand do something complicated, which involves jumping around in the file and then returning to the original position, you may want to restore the view on the file. See |restore-position| for an example.
es: Si desea que la orden automática haga algo más complicado, que incluya saltar de un punto a otro en el archivo para volver finalmente a la posición inicial, puede que desee restaurar la vista del archivo. Para un ejemplo, consulte |restore-position|.

source: IGNORING EVENTS
es: IGNORAR EVENTOS

source: At times, you will not want to trigger an autocommand. The 'eventignore' option contains a list of events that will be totally ignored. For example, the following causes events for entering and leaving a window to be ignored: >
es: A veces, no querrá iniciar una orden automática. La opción 'eventignore' contiene una lista de eventos a ignorar. Por ejemplo, lo siguiente provoca que se ignoren los siguientes eventos iniciados al entrar y salir de un programa: >

source: To ignore all events, use the following command: >
es: Use la siguiente orden para ignorar todos los eventos: >

source: To set it back to the normal behavior, make 'eventignore' empty: >
es: Para volver al comportamiento anterior, vacíe 'eventignore': >

source: Next chapter: |usr_41.txt| Write a Vim script
es: Capítulo siguiente: |usr_41.esx| Escribir scripts para Vim
