Repository: vim-doc-es/vimdocs
Catalog: 7.3/helpfiles/traducido/po/usr_42.txt.po
Languages: es

source: VIM USER MANUAL - by Bram Moolenaar
es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: Copyright: see |manual-copyright| vim:tw=78:ts=8:ft=help:norl:
es: Copyright: consulte |manual-copyright| vim:tw=78:ts=8:ft=help:norl:

source: SPECIAL CHARACTERS
es: CARACTERES ESPECIALES

source: *usr_42.txt* For Vim version 7.3. Last change: 2008 May 05
es: *usr_01.esx* Para Vim versión 7.3. Último cambio: 5/5/2008

source: Add new menus
es: Añadir nuevos menús

source: By now you know that Vim is very flexible. This includes the menus used in the GUI. You can define your own menu entries to make certain commands easily accessible. This is for mouse-happy users only.
es: A estas alturas ya debe saber que Vim es muy flexible. Esta flexibilidad se extiende a los menús disponibles en la interfaz gráfica. Puede definir sus propias entradas de menú para que ciertas órdenes sean más fáciles de acceder. Esto es principalmente para usuarios asiduos del ratón.

source: |42.1| Introduction |42.2| Menu commands |42.3| Various |42.4| Toolbar and popup menus
es: |42.1| Introducción |42.2| Órdenes para menús |42.3| Varios |42.4| Barra de herramientas y menús contextuales

source: Next chapter: |usr_43.txt| Using filetypes Previous chapter: |usr_41.txt| Write a Vim script Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_43.esx| Using filetypes Capítulo anterior: |usr_41.esx| Escribir scripts para Vim Tabla de contenidos: |usr_toc.esx|

source: *42.1* Introduction
es: *42.1* Introducción

source: The menus that Vim uses are defined in the file "$VIMRUNTIME/menu.vim". If you want to write your own menus, you might first want to look through that file. To define a menu item, use the ":menu" command. The basic form of this command is as follows: >
es: Los menús que Vim usa están definidos en el archivo «$VIMRUNTIME/menu.vim». Si desea escribir sus propios menús, es conveniente que revise en primer lugar dicho archivo. Para definir un elemento de un menú, use la orden «:menu». La forma básica de esta orden es la siguiente: >

source: :menu {menu-item} {keys}
es: :menu {elemento-menú} {teclas}

source: The {menu-item} describes where on the menu to put the item. A typical {menu-item} is "File.Save", which represents the item "Save" under the "File" menu. A dot is used to separate the names. Example: >
es: La parte {elemento-menú} describe en qué posición del menú se ha de ubicar el elemento. Un {elemento-menú} típico es «Archivo.Guardar», que representa al elemento «Guardar» en el menú «Archivo». Se usa un punto para separar los nombres. Ejemplo: >

source: :menu File.Save :update<CR>
es: menu Archivo.Guardar :update<CR>

source: The ":update" command writes the file when it was modified. You can add another level: "Edit.Settings.Shiftwidth" defines a submenu "Settings" under the "Edit" menu, with an item "Shiftwidth". You could use even deeper levels. Don't use this too much, you need to move the mouse quite a bit to use such an item. The ":menu" command is very similar to the ":map" command: the left side specifies how the item is triggered and the right hand side defines the characters that are executed. {keys} are characters, they are used just like you would have typed them. Thus in Insert mode, when {keys} is plain text, that text is inserted.
es: La orden «:update» escribe el archivo a disco si éste ha sido modificado. Puede añadir otro nivel: «Editar.Opciones.Shiftwidth» define un menú secundario «Opciones» dentro del menú «Editar», con un elemento «Shiftwidth». Puede usar niveles aún más profundos. No use en exceso esta funcionalidad, porque al hacerlo tendrá que mover bastante el ratón para usar el elemento del menú. La orden «:menu» es muy similar a la orden «:map»: el lado izquierdo indica cómo se activa el elemento y el lado derecho define los caracteres que se ejecutan. {teclas} corresponde a caracteres; éstos se usan tal como si los hubiera introducido manualmente. Así que en modo Insertar, cuando {teclas} corresponde a texto plano, se inserta dicho texto.

source: ACCELERATORS
es: ACELERADORES

source: The ampersand character (&) is used to indicate an accelerator. For instance, you can use Alt-F to select "File" and S to select "Save". (The 'winaltkeys' option may disable this though!). Therefore, the {menu-item} looks like "&File.&Save". The accelerator characters will be underlined in the menu. You must take care that each key is used only once in each menu. Otherwise you will not know which of the two will actually be used. Vim doesn't warn you for this.
es: Para definir un acelerador se usa el carácter et (&). Por ejemplo, es posible usar Alt-A para seleccionar «Archivo» y G para seleccionar «Guardar». (Sin embargo, ¡la opción 'winaltkeys' puede deshabilitar este comportamiento!) Por lo tanto, el {elemento-menú} queda como "&Archivo.&Guardar". Los caracteres aceleradores aparecerán subrayados en el menú. Debe asegurarse de que cada tecla sea usada una sola vez en cada menú. De no hacerlo no sabrá cuál de los dos menús se usará. Vim no muestra ninguna advertencia cuando esto pasa.

source: PRIORITIES
es: PRIORIDADES

source: The actual definition of the File.Save menu item is as follows: >
es: La definición real del elemento de menú «Archivo.Guardar» es similar a la siguiente: >

source: :menu 10.340 &File.&Save<Tab>:w :confirm w<CR>
es: :menu 10.340 &Archivo.&Guardar<Tab>:w :confirm w<CR>

source: The number 10.340 is called the priority number. It is used by the editor to decide where it places the menu item. The first number (10) indicates the position on the menu bar. Lower numbered menus are positioned to the left, higher numbers to the right. These are the priorities used for the standard menus:
es: El número 10.340 es el número de prioridad. El editor lo usa para decidir dónde ubicar el elemento de menú. El primer número (10) indica la posición en la barra de menú. Los menús con números más pequeños se ubican a la izquierda, los más grandes a la derecha. Éstas son las prioridades de los menús estándar:

source: +------------------------------------------------------------+ | File Edit Tools Syntax Buffers Window Help | +------------------------------------------------------------+
es: +------------------------------------------------------------+ | Archivo Editar Herramientas Sintaxis Búfers Ventana Ayuda | +------------------------------------------------------------+

source: Notice that the Help menu is given a very high number, to make it appear on the far right. The second number (340) determines the location of the item within the pull-down menu. Lower numbers go on top, higher number on the bottom. These are the priorities in the File menu:
es: Tenga en cuenta que el menú «Ayuda» tiene un número muy grande, para hacer que aparezca a la extrema derecha. El segundo número determina la ubicación del elemento dentro del menú desplegable. Los números pequeños aparecen arriba, los números más grandes abajo. Éstas son la prioridades del menú «Archivo»:

source: +-----------------+ 10.310 |Open... | 10.320 |Split-Open... | 10.325 |New | 10.330 |Close | 10.335 |---------------- | 10.340 |Save | 10.350 |Save As... | 10.400 |---------------- | 10.410 |Split Diff with | 10.420 |Split Patched By | 10.500 |---------------- | 10.510 |Print | 10.600 |---------------- | 10.610 |Save-Exit | 10.620 |Exit | +-----------------+
es: +-----------------+ 10.310 |Abrir... | 10.320 |Abrir en otra ventana... | 10.325 |Nuevo | 10.330 |Cerrar | 10.335 |---------------- | 10.340 |Guardar | 10.350 |Guardar como... | 10.400 |---------------- | 10.410 |Mostrar diferencias como | 10.420 |Mostrar parcheado por | 10.500 |---------------- | 10.510 |Imprimir | 10.600 |---------------- | 10.610 |Guardar y salir | 10.620 |Salir | +-----------------+

source: Notice that there is room in between the numbers. This is where you can insert your own items, if you really want to (it's often better to leave the standard menus alone and add a new menu for your own items). When you create a submenu, you can add another ".number" to the priority. Thus each name in {menu-item} has its priority number.
es: Tenga en cuenta que hay saltos en la numeración. Es allí donde puede ubicar sus propios elementos de menú, si así lo desea (usualmente es mejor no alterar los menús estándar y crear un nuevo menú para sus elementos.) Cuando crea un menú secundario, puede añadir otro «.número» a la prioridad. De esta forma cada nombre en {elemento-menú} obtiene un número de prioridad.

source: The {menu-item} in this example is "&File.&Save<Tab>:w". This brings up an important point: {menu-item} must be one word. If you want to put a dot, space or tabs in the name, you either use the <> notation (<Space> and <Tab>, for instance) or use the backslash (\) escape. >
es: El {elemento-menú} de este ejemplo es "&Archivo.&Guardar<Tab>:w". Esto llama la atención sobre un punto importante: {elemento-menú} debe ser una sola palabra. Si desea usar puntos, espacios o tabuladores en el nombre, debe usar la notación <> (por ejemplo, <Space> y <Tab>) o escapar estos caracteres usando una barra inversa (\). >

source: :menu 10.305 &File.&Do\ It\.\.\. :exit<CR>
es: :menu 10.305 &Archivo.&Ejecutar\ Tarea\.\.\. :exit<CR>

source: In this example, the name of the menu item "Do It..." contains a space and the command is ":exit<CR>".
es: En este ejemplo, el nombre del elemento del menú "Ejecutar Tarea" contiene un espacio, y la orden es ":exit<CR>".

source: The <Tab> character in a menu name is used to separate the part that defines the menu name from the part that gives a hint to the user. The part after the <Tab> is displayed right aligned in the menu. In the File.Save menu the name used is "&File.&Save<Tab>:w". Thus the menu name is "File.Save" and the hint is ":w".
es: El carácter <Tab> se usa en el nombre de un menú para separar la definición del nombre del mismo de la parte que se usa como indicación al usuario. La parte luego del <Tab> se muestra justificada a la derecha en el menú. El nombre usado en el menú «Archivo.Guardar» es "&Archivo.&Guardar<Tab>:w". De acuerdo a lo anterior, el nombre del menú es «Archivo.Guardar» y la indicación es «:w».

source: SEPARATORS
es: SEPARADORES

source: The separator lines, used to group related menu items together, can be defined by using a name that starts and ends in a '-'. For example "-sep-". When using several separators the names must be different. Otherwise the names don't matter. The command from a separator will never be executed, but you have to define one anyway. A single colon will do. Example: >
es: Las líneas o separadores, usadas para agrupar elementos de menú relacionados, se definen usando un nombre que empieza y termina con '-'. Por ejemplo "-sep-". Al usar varios separadores debe dárseles nombres diferentes. Aparte de esto los nombres particulares no tienen importancia. La orden de un separador nunca será ejecutada, pero hay que definirla de todos modos. Un «:» es suficiente. Por ejemplo: >

source: :amenu 20.510 Edit.-sep3- :
es: :amenu 20.510 Editar.-sep3- :

source: *42.2* Menu commands
es: *42.2* Órdenes de menú

source: You can define menu items that exist for only certain modes. This works just like the variations on the ":map" command:
es: Puede definir elementos de menús que sólo existen para ciertos modos. El funcionamiento de esta característica es idéntico al proporcionado por las variaciones de la orden «:map»:

source: :menu Normal, Visual and Operator-pending mode :nmenu Normal mode :vmenu Visual mode :omenu Operator-pending mode :menu! Insert and Command-line mode :imenu Insert mode :cmenu Command-line mode :amenu All modes
es: :menu Modos Normal, Visual y Operator-pending :nmenu Modo Normal :vmenu Modo Visual :omenu Modo Operator-pending :menu! Modo Insertar y Línea de órdenes :imenu Modo Insertar :cmenu Modo Línea de órdenes :amenu Todos los modos existentes

source: To avoid that the commands of a menu item are being mapped, use the command ":noremenu", ":nnoremenu", ":anoremenu", etc.
es: Para evitar que las órdenes de un elemento en un menú se usen en una macro, use las órdenes «:noremenu», «:nnoremenu», «:anoremenu», etc.

source: USING :AMENU
es: USO DE :AMENU

source: The ":amenu" command is a bit different. It assumes that the {keys} you give are to be executed in Normal mode. When Vim is in Visual or Insert mode when the menu is used, Vim first has to go back to Normal mode. ":amenu" inserts a CTRL-C or CTRL-O for you. For example, if you use this command: > :amenu 90.100 Mine.Find\ Word *
es: La orden «:amenu» es ligeramente diferente. Asume que las {teclas} que se le indican van a ser ejecutadas en modo Normal. Cuando Vim se encuentra en modo Insertar o Visual, Vim debe primero volver al modo Normal. «:amenu» inserta un CTRL-C o un CTRL-O por usted. Por ejemplo, si usa esta orden: > :amenu 90.100 Mío.Buscar\ Palabra *

source: Then the resulting menu commands will be:
es: Las órdenes de menú resultantes serán:

source: Normal mode: * Visual mode: CTRL-C * Operator-pending mode: CTRL-C * Insert mode: CTRL-O * Command-line mode: CTRL-C *
es: Modo Normal: * Modo Visual: CTRL-C * Modo Operator-pending: CTRL-C * Modo Insertar: CTRL-O * Modo Línea de órdenes: CTRL-C *

source: When in Command-line mode the CTRL-C will abandon the command typed so far. In Visual and Operator-pending mode CTRL-C will stop the mode. The CTRL-O in Insert mode will execute the command and then return to Insert mode. CTRL-O only works for one command. If you need to use two or more commands, put them in a function and call that function. Example: >
es: En el modo Línea de órdenes CTRL-C descarta la orden que se haya escrito. En los modos Visual y Operator-pending CTRL-C saldrá del modo. En el modo Insertar CTRL-O ejecutará la orden y volverá a modo Insertar. CTRL-O sólo funciona para una orden. Si necesita usar dos o más órdenes, póngalas en una función, e invóquela. Ejemplo: >

source: :amenu Mine.Next\ File :call <SID>NextFile()<CR> :function <SID>NextFile() : next : 1/^Code :endfunction
es: :amenu Mío.Siguiente\ Archivo :call <SID>SiguienteArchivo()<CR> :function <SID>SiguienteArchivo() : next : 1/^Código :endfunction

source: This menu entry goes to the next file in the argument list with ":next". Then it searches for the line that starts with "Code". The <SID> before the function name is the script ID. This makes the function local to the current Vim script file. This avoids problems when a function with the same name is defined in another script file. See |<SID>|.
es: Esta entrada de menú pasa al siguiente archivo en la lista de argumentos usando «:next». Luego busca la línea que empieza con «Código». El <SID> antepuesto al nombre de la función es el ID del script. Este hace que la función sea local al script en el cual es definida. Esto evita problemas si se define una función con el mismo nombre en otro archivo de script. Véase |<SID>|.

source: SILENT MENUS
es: MENÚS SILENCIOSOS

source: The menu executes the {keys} as if you typed them. For a ":" command this means you will see the command being echoed on the command line. If it's a long command, the hit-Enter prompt will appear. That can be very annoying! To avoid this, make the menu silent. This is done with the <silent> argument. For example, take the call to NextFile() in the previous example. When you use this menu, you will see this on the command line:
es: El menú ejecuta las {teclas} como si hubieran sido introducidas manualmente. Con las órdenes «:» esto implica que la orden será visible en la línea de órdenes. Si es una orden larga, aparecerá el mensaje «Pulse INTRO...». ¡Esto puede ser muy molesto! Para evitar que suceda, haga que el menú sea silencioso. Puede hacerlo usando el argumento <silent>. Por ejemplo, considere la llamada a SiguienteArchivo() en el ejemplo anterior. Al usar este menú, lo siguiente aparecerá en la línea de órdenes:

source: :call <SNR>34_NextFile() ~
es: :call <SNR>34_SiguienteArchivo() ~

source: To avoid this text on the command line, insert "<silent>" as the first argument: >
es: Para evitar esto, inserte «<silent>» como primer argumento: >

source: :amenu <silent> Mine.Next\ File :call <SID>NextFile()<CR>
es: :amenu <silent> Mío.Siguiente\ Archivo :call <SID>SiguienteArchivo()<CR>

source: Don't use "<silent>" too often. It is not needed for short commands. If you make a menu for someone else, being able the see the executed command will give him a hint about what he could have typed, instead of using the mouse.
es: No use «<silent>» demasiado. No es necesario para órdenes cortas. Si está haciendo un menú que alguien más usará, la posibilidad de ver la orden ejecutada le dará una indicación acerca de lo que pudo haber introducido manualmente, en lugar de usar el ratón.

source: LISTING MENUS
es: LISTAR MENÚS

source: When a menu command is used without a {keys} part, it lists the already defined menus. You can specify a {menu-item}, or part of it, to list specific menus. Example: >
es: Cuando se usa una orden de menú sin indicar las {teclas}, se listan los menús definidos. Puede especificar un {elemento-menú}, o una parte de él, para listar menús específicos. Ejemplo: >

source: This lists all menus. That's a long list! Better specify the name of a menu to get a shorter list: >
es: Esto lista todos los menús. ¡Ésa es una lista muy larga! Es mejor indicar el nombre del menú para recibir una lista más corta: >

source: :amenu Edit
es: :amenu Editar

source: This lists only the "Edit" menu items for all modes. To list only one specific menu item for Insert mode: >
es: Esta orden lista únicamente los elementos del menú «Editar» para todos los modos. Para listar un elemento específico de un menú para modo Insertar: >

source: :imenu Edit.Undo
es: :imenu Editar.Deshacer

source: Take care that you type exactly the right name. Case matters here. But the '&' for accelerators can be omitted. The <Tab> and what comes after it can be left out as well.
es: Asegúrese de introducir exactamente el nombre apropiado. Las diferencias entre mayúsculas y minúsculas son importantes aquí. El <Tab> y lo que sigue después de él puede omitirse.

source: DELETING MENUS
es: BORRAR MENÚS

source: To delete a menu, the same command is used as for listing, but with "menu" changed to "unmenu". Thus ":menu" becomes, ":unmenu", ":nmenu" becomes ":nunmenu", etc. To delete the "Tools.Make" item for Insert mode: >
es: Para borrar un menú se usa la misma orden que para listarlo, pero cambiando «menu» por «unmenu». Así, «:menu» se convierte en «:unmenu», «:nmenu» en «:nunmenu», etc. Para borrar el elemento «Herramientas.Ejecutar Make» para el modo Insertar: >

source: :iunmenu Tools.Make
es: :iunmenu Herramientas.Ejecutar\ Make

source: You can delete a whole menu, with all its items, by using the menu name. Example: >
es: Puede borrar un menú completo, con todos sus elementos, usando el nombre del menú. Ejemplo: >

source: :aunmenu Syntax
es: :aunmenu Sintaxis

source: This deletes the Syntax menu and all the items in it.
es: Esto borra el menú «Sintaxis» y todos los elementos que contenga.

source: *42.3* Various
es: *42.3* Varios

source: You can change the appearance of the menus with flags in 'guioptions'. In the default value they are all included, except "M". You can remove a flag with a command like: >
es: Es posible cambiar la apariencia de los menús definiendo opciones en 'guioptions'. De manera predeterminada están incluidas todas, excepto «M». Puede eliminar una opción particular con una orden como: >

source: :set guioptions-=m < m When removed the menubar is not displayed.
es: :set guioptions-=m < m Al eliminar la opción la barra de menú no se muestra.

source: M When added the default menus are not loaded.
es: M Al añadirla no se cargan los menús predeterminados.

source: g When removed the inactive menu items are not made grey but are completely removed. (Does not work on all systems.)
es: g Al eliminarla, los elementos de menú deshabilitados no aparecen grises sino que son eliminados. (No funciona en todos los sistemas.)

source: t When removed the tearoff feature is not enabled.
es: t Al eliminarla se deshabilita la característica de desacoplar los menús.

source: The dotted line at the top of a menu is not a separator line. When you select this item, the menu is "teared-off": It is displayed in a separate window. This is called a tearoff menu. This is useful when you use the same menu often.
es: La línea punteada en la parte superior de un menú no es un separador. Al seleccionar este elemento, el menú es «desacoplado»: se lo muestra en una ventana separada. Se lo denomina menú desacoplable. Es una característica útil si usa un mismo menú con frecuencia.

source: For translating menu items, see |:menutrans|.
es: Para traducir elementos de menú, véase |:menutrans|.

source: Since the mouse has to be used to select a menu item, it is a good idea to use the ":browse" command for selecting a file. And ":confirm" to get a dialog instead of an error message, e.g., when the current buffer contains changes. These two can be combined: >
es: Ya que debe usar el ratón para seleccionar un elemento en un menú, usar la orden «:browse» para seleccionar un archivo es una buena idea . Añada «:confirm» para obtener un diálogo en lugar de un mensaje de error, por ejemplo, cuando el búfer actual tiene cambios no guardados. Las dos órdenes pueden combinarse: >

source: :amenu File.Open :browse confirm edit<CR>
es: :amenu Archivo.Abrir :browse confirm edit<CR>

source: The ":browse" makes a file browser appear to select the file to edit. The ":confirm" will pop up a dialog when the current buffer has changes. You can then select to save the changes, throw them away or cancel the command. For more complicated items, the confirm() and inputdialog() functions can be used. The default menus contain a few examples.
es: «:browse» despliega un explorador de archivos para seleccionar el archivo a editar. «:confirm» mostrará un diálogo cuando el búfer actual tiene cambios que no han sido guardados. Puede escoger entre guardarlos, descartarlos, o cancelar la orden. Puede usar las funciones confirm() e inputdialog() para elementos más complicados. Los menús predeterminados contienen algunos ejemplos.

source: *42.4* Toolbar and popup menus
es: *42.4* Menús de barra de herramientas y menús contextuales

source: There are two special menus: ToolBar and PopUp. Items that start with these names do not appear in the normal menu bar.
es: Hay dos menús especiales: ToolBar (Barra de Herramientas) y PopUp (Menú Contextual). Los elementos cuyos nombres empiezan con estas palabras clave no aparecen en la barra de menú normal.

source: TOOLBAR
es: BARRA DE HERRAMIENTAS (TOOLBAR)
