Repository: vim-doc-es/vimdocs
Catalog: 7.2/traducido/PO/helpes.po
Languages: es

source: *help.txt* For Vim version 7.2. Last change: 2008 Jul 21
es: *help.est* Para Vim versión 7.2. Último cambio: 2008 Jul 21

source: VIM - main help file k Move around: Use the cursor keys, or "h" to go left, h l "j" to go down, "k" to go up, "l" to go right. j Close this window: Use ":q<Enter>". Get out of Vim: Use ":qa!<Enter>" (careful, all changes are lost!).
es: VIM - archivo principal de ayuda k Desplazamiento: Use las teclas de dirección, h l o «h» para ir a la izquierda, j «j» para ir hacia abajo, «k» hacia arriba y «l» a la derecha. Cerrar esta ventana: Use «:q<Intro>». Salir de Vim: Use «:qa!<Intro>» (¡Atención, perderá todos los cambios realizados!).

source: Jump to a subject: Position the cursor on a tag (e.g. |bars|) and hit CTRL-]. With the mouse: ":set mouse=a" to enable the mouse (in xterm or GUI). Double-click the left mouse button on a tag, e.g. |bars|. Jump back: Type CTRL-T or CTRL-O (repeat to go further back).
es: Saltar a un tema: Sitúe el cursor sobre una etiqueta (p. ej., |bars|) y pulse CTRL-]. Con el ratón: «set mouse=a» activa el ratón (en xterm o GUI). Pulse dos veces el botón izquierdo del ratón sobre una etiqueta. Volver atrás: Teclee CTRL-T o CTRL-O (repetirlo le devuelve a un punto más lejano.)

source: Get specific help: It is possible to go directly to whatever you want help on, by giving an argument to the |:help| command. It is possible to further specify the context: *help-context* WHAT PREPEND EXAMPLE ~ Normal mode command (nothing) :help x Visual mode command v_ :help v_u Insert mode command i_ :help i_<Esc> Command-line command : :help :quit Command-line editing c_ :help c_<Del> Vim command argument - :help -r Option ' :help 'textwidth' Search for help: Type ":help word", then hit CTRL-D to see matching help entries for "word".
es: Obtener ayuda específica: Es posible acudir directamente donde necesite ayuda, introduciéndolo como un argumento de la orden |:help|. Es posible especificar detalladamente el contexto: *help-context* QUÉ ANEXAR EJEMPLO ~ Orden modo Normal (nada) :help x Orden modo Visual v_ :help v_u Orden modo insertar i_ :help i_<Esc> Orden de línea de órdenes : :help :quit Edición de línea de órdenes c_ :help c_<Supr> Argumento de la orden VIM - :help -r Opción ' :help 'textwidth' Buscar ayuda: Teclee «:help palabra» y pulse CTRL-D para ver las entradas de ayuda coincidentes con «palabra».

source: VIM stands for Vi IMproved. Most of VIM was made by Bram Moolenaar, but only through the help of many others. See |credits|. ------------------------------------------------------------------------------ *doc-file-list* *Q_ct* BASIC: |quickref| Overview of the most common commands you will use |tutor| 30 minutes training course for beginners |copying| About copyrights |iccf| Helping poor children in Uganda |sponsor| Sponsor Vim development, become a registered Vim user |www| Vim on the World Wide Web |bugs| Where to send bug reports
es: VIM significa «Vi IMproved» (Vi mejorado). Bram Moolenaar es el principal creador de Vim, pero sólo con la ayuda de muchos otros. Véase |credits|. ------------------------------------------------------------------------------ *doc-file-list* *Q_ct* BÁSICOS: |quickref| Vista preliminar de las órdenes que usará más frecuentemente. |tutor| Entrenamiento de 30 minutos para principiantes. |copying| Acerca de los derechos de autor. |iccf| Ayuda a niños pobres en Uganda. |sponsor| Patrocine el desarrollo de Vim, registresé como usuario de Vim. |www| Vim en el «World Wide Web». |bugs| Donde enviar informes de fallo.

source: USER MANUAL: These files explain how to accomplish an editing task.
es: MANUAL DE USUARIO: Estos archivos explican como ejecutar una tarea de edición.

source: |usr_toc.txt| Table Of Contents
es: |usr_toc.txt| Tabla de contenidos

source: Getting Started ~ |usr_01.txt| About the manuals |usr_02.txt| The first steps in Vim |usr_03.txt| Moving around |usr_04.txt| Making small changes |usr_05.txt| Set your settings |usr_06.txt| Using syntax highlighting |usr_07.txt| Editing more than one file |usr_08.txt| Splitting windows |usr_09.txt| Using the GUI |usr_10.txt| Making big changes |usr_11.txt| Recovering from a crash |usr_12.txt| Clever tricks
es: Empezar ~ |usr_01.txt| Acerca de los manuales |usr_02.txt| Primeros pasos en VIM |usr_03.txt| Movimiento |usr_04.txt| Hacer cambios pequeños |usr_05.txt| Configuración |usr_06.txt| Uso del resaltado de sintaxis |usr_07.txt| Editar más de un archivo |usr_08.txt| Dividir en ventanas |usr_09.txt| Uso de la interfaz gráfica |usr_10.txt| Hacer cambios grandes |usr_11.txt| Restaurar después de un fallo |usr_12.txt| Trucos ingeniosos

source: Editing Effectively ~ |usr_20.txt| Typing command-line commands quickly |usr_21.txt| Go away and come back |usr_22.txt| Finding the file to edit |usr_23.txt| Editing other files |usr_24.txt| Inserting quickly |usr_25.txt| Editing formatted text |usr_26.txt| Repeating |usr_27.txt| Search commands and patterns |usr_28.txt| Folding |usr_29.txt| Moving through programs |usr_30.txt| Editing programs |usr_31.txt| Exploiting the GUI |usr_32.txt| The undo tree
es: Editar con efectividad ~ |usr_20.txt| Ser eficaz en la línea de órdenes |usr_21.txt| Abandonar el editor y volver |usr_22.txt| Encontrar el archivo a editar |usr_23.txt| Editar otros archivos |usr_24.txt| Insertar con rapidez |usr_25.txt| Editar texto con formato |usr_26.txt| Repetir |usr_27.txt| Órdenes y patrones de búsqueda |usr_28.txt| Plegar |usr_29.txt| Navegar a través de los programas |usr_30.txt| Editar programas |usr_31.txt| Aprovechar la interfaz gráfica |usr_32.txt| El árbol de deshacer

source: Tuning Vim ~ |usr_40.txt| Make new commands |usr_41.txt| Write a Vim script |usr_42.txt| Add new menus |usr_43.txt| Using filetypes |usr_44.txt| Your own syntax highlighted |usr_45.txt| Select your language
es: Ajustar Vim ~ |usr_40.txt| Crear órdenes nuevas |usr_41.txt| Crear un Vim script |usr_42.txt| Añadir menús nuevos |usr_43.txt| Usar tipos de archivo (filetypes) |usr_44.txt| Crear su propio resaltado de sintaxis |usr_45.txt| Seleccionar su idioma

source: Making Vim Run ~ |usr_90.txt| Installing Vim
es: Iniciar Vim ~ |usr_90.txt| Instalar Vim

source: REFERENCE MANUAL: These files explain every detail of Vim. *reference_toc*
es: MANUAL DE REFERENCIA: Estos archivos explican cada detalle de Vim. *reference_toc*

source: General subjects ~ |intro.txt| general introduction to Vim; notation used in help files |help.txt| overview and quick reference (this file) |index.txt| alphabetical index of all commands |help-tags| all the tags you can jump to (index of tags) |howto.txt| how to do the most common editing tasks |tips.txt| various tips on using Vim |message.txt| (error) messages and explanations |quotes.txt| remarks from users of Vim |todo.txt| known problems and desired extensions |develop.txt| development of Vim |debug.txt| debugging Vim itself |uganda.txt| Vim distribution conditions and what to do with your money
es: Temas generales ~ |intro.txt| Introducción general a Vim; notación usada en los archivos de ayuda |help.txt| Información general y referencia rápida (este archivo) |index.txt| Índice alfabético de todas las órdenes |help-tags| Todas las etiquetas a las que puede saltar (índice de etiquetas) |howto.txt| Como realizar las tareas de edición más comunes |tips.txt| Varios consejos de uso de Vim |message.txt| Los mensajes de error y su explicación |quotes.txt| Comentarios de usuarios de Vim |todo.txt| Problemas conocidos y extensiones deseadas |develop.txt| Desarrollo de Vim |debug.txt| Depurando fallos de Vim |uganda.txt| Las condiciones de distribución de Vim y qué hacer con su dinero.

source: Basic editing ~ |starting.txt| starting Vim, Vim command arguments, initialisation |editing.txt| editing and writing files |motion.txt| commands for moving around |scroll.txt| scrolling the text in the window |insert.txt| Insert and Replace mode |change.txt| deleting and replacing text |indent.txt| automatic indenting for C and other languages |undo.txt| Undo and Redo |repeat.txt| repeating commands, Vim scripts and debugging |visual.txt| using the Visual mode (selecting a text area) |various.txt| various remaining commands |recover.txt| recovering from a crash
es: Edición básica ~ |starting.txt| Iniciar Vim, argumentos de la orden Vim, inicialización |editing.txt| Editar y escribir archivos |motion.txt| Órdenes de desplazamiento |scroll.txt| Desplazar el texto en una ventana |insert.txt| Modos insertar y reemplazar |change.txt| Borrar y reemplazar texto |indent.txt| Tabulación automática para C y otros lenguajes |undo.txt| Deshacer y rehacer |repeat.txt| Repetir órdenes, Vim scripts y depuración de fallos |visual.txt| Usar el modo Visual (seleccionar un área de texto) |various.txt| Otras órdenes restantes |recover.txt| Recuperar datos después de un fallo

source: Advanced editing ~ |cmdline.txt| Command-line editing |options.txt| description of all options |pattern.txt| regexp patterns and search commands |map.txt| key mapping and abbreviations |tagsrch.txt| tags and special searches |quickfix.txt| commands for a quick edit-compile-fix cycle |windows.txt| commands for using multiple windows and buffers |tabpage.txt| commands for using multiple tab pages |syntax.txt| syntax highlighting |spell.txt| spell checking |diff.txt| working with two to four versions of the same file |autocmd.txt| automatically executing commands on an event |filetype.txt| settings done specifically for a type of file |eval.txt| expression evaluation, conditional commands |fold.txt| hide (fold) ranges of lines
es: Edición avanzada ~ |cmdline.txt| Edición en línea de órdenes |options.txt| Descripción de todas las opciones |pattern.txt| Patrones de expresiones regulares y órdenes de búsqueda |map.txt| Mapeado y abreviaturas |tagsrch.txt| Etiquetas y búsquedas especiales |quickfix.txt| Órdenes para un rápido ciclo editar-compilar-arreglar |windows.txt| Órdenes de uso de múltiples ventanas y búfers |tabpage.txt| Órdenes de uso de múltiples pestañas |syntax.txt| Resaltado de sintaxis |spell.txt| Corrección ortográfica |diff.txt| Trabajar con un número de entre 2 y 4 copias del mismo archivo |autocmd.txt| Ejecutar órdenes de manera automática |filetype.txt| Configuración específica según el tipo de archivo |eval.txt| Evaluación de expresión, órdenes condicionales |fold.txt| Ocultar (plegar) rangos de líneas

source: Special issues ~ |print.txt| printing |remote.txt| using Vim as a server or client |term.txt| using different terminals and mice |digraph.txt| list of available digraphs |mbyte.txt| multi-byte text support |mlang.txt| non-English language support |arabic.txt| Arabic language support and editing |farsi.txt| Farsi (Persian) editing |hebrew.txt| Hebrew language support and editing |russian.txt| Russian language support and editing |ft_ada.txt| Ada (the programming language) support |hangulin.txt| Hangul (Korean) input mode |rileft.txt| right-to-left editing mode
es: Temas particulares ~ |print.txt| Imprimir |remote.txt| Usar Vim como servidor o cliente. |term.txt| Usar diferentes terminales y ratones |digraph.txt| Lista de dígrafos disponibles |mbyte.txt| Soporte de texto multi-bit |mlang.txt| Soporte para idiomas alternativos al inglés |arabic.txt| Soporte y edición en lengua Árabe |farsi.txt| Edición en Farsi (Persia) |hebrew.txt| Soporte y edición en Hebreo |russian.txt| Soporte y edición en Ruso |ft_ada.txt| Soporte para Ada (el lenguaje de programación) |hangulin.txt| Modo de entrada de Hangul (Koreano) |rileft.txt| Modo de edición de izquierda a derecha

source: GUI ~ |gui.txt| Graphical User Interface (GUI) |gui_w16.txt| Windows 3.1 GUI |gui_w32.txt| Win32 GUI |gui_x11.txt| X11 GUI
es: GUI/IGU ~ |gui.txt| Interfaz gráfica de usuario |gui_w16.txt| Interfaz gráfica de usuario de Windows 3.1 |gui_w32.txt| Interfaz gráfica de usuario de Win32 |gui_x11.txt| Interfaz gráfica de usuario de X11

source: Interfaces ~ |if_cscop.txt| using Cscope with Vim |if_mzsch.txt| MzScheme interface |if_perl.txt| Perl interface |if_pyth.txt| Python interface |if_sniff.txt| SNiFF+ interface |if_tcl.txt| Tcl interface |if_ole.txt| OLE automation interface for Win32 |if_ruby.txt| Ruby interface |debugger.txt| Interface with a debugger |workshop.txt| Sun Visual Workshop interface |netbeans.txt| NetBeans External Editor interface |sign.txt| debugging signs
es: Interfaces ~ |if_cscop.txt| Usar Cscope con Vim |if_mzsch.txt| Interfaz de MzScheme |if_perl.txt| Interfaz de Perl |if_pyth.txt| Interfaz de Python |if_sniff.txt| Interfaz de SNiFF+ |if_tcl.txt| Interfaz de Tcl |if_ole.txt| Interfaz de automatización de OLE para Win32 |if_ruby.txt| Interfaz de Ruby |debugger.txt| Interfaz con un depurador de fallos |workshop.txt| Interfaz de Sun Visual Workshop |netbeans.txt| Interfaz de NetBeans External Editor (editor externo) |sign.txt| Signos de depuración de fallos

source: Versions ~ |vi_diff.txt| Main differences between Vim and Vi |version4.txt| Differences between Vim version 3.0 and 4.x |version5.txt| Differences between Vim version 4.6 and 5.x |version6.txt| Differences between Vim version 5.7 and 6.x |version7.txt| Differences between Vim version 6.4 and 7.x *sys-file-list* Remarks about specific systems ~ |os_390.txt| OS/390 Unix |os_amiga.txt| Amiga |os_beos.txt| BeOS and BeBox |os_dos.txt| MS-DOS and MS-Windows NT/95 common items |os_mac.txt| Macintosh |os_mint.txt| Atari MiNT |os_msdos.txt| MS-DOS (plain DOS and DOS box under Windows) |os_os2.txt| OS/2 |os_qnx.txt| QNX |os_risc.txt| RISC-OS |os_unix.txt| Unix |os_vms.txt| VMS |os_win32.txt| MS-Windows 95/98/NT *standard-plugin-list* Standard plugins ~ |pi_getscript.txt| Downloading latest version of Vim scripts |pi_gzip.txt| Reading and writing compressed files |pi_netrw.txt| Reading and writing files over a network |pi_paren.txt| Highlight matching parens |pi_tar.txt| Tar file explorer |pi_vimball.txt| Create a self-installing Vim script |pi_zip.txt| Zip archive explorer
es: Versiones ~ |vi_diff.txt| Diferencias principales entre Vim y Vi |version4.txt| Diferencias entre las versiones de Vim 3.0 y 4.x |version5.txt| Diferencias entre las versiones de Vim 4.6 y 5.x |version6.txt| Diferencias entre las versiones de Vim 5.7 y 6.x |version7.txt| Diferencias entre las versiones de Vim 6.4 y 7.x *sys-file-list* Apuntes sobre sistemas específicos ~ |os_390.txt| OS/390 Unix |os_amiga.txt| Amiga |os_beos.txt| BeOS and BeBox |os_dos.txt| Elementos comunes entre MS-DOS y MS-Windows NT/95 |os_mac.txt| Macintosh |os_mint.txt| Atari MiNT |os_msdos.txt| MS-DOS - DOS puro y terminal de DOS bajo Windows) |os_os2.txt| OS/2 |os_qnx.txt| QNX |os_risc.txt| RISC-OS |os_unix.txt| Unix |os_vms.txt| VMS |os_win32.txt| MS-Windows 95/98/NT *standard-plugin-list* Extensiones estándar ~ |pi_getscript.txt| Descargar la última versión de Vim scripts |pi_gzip.txt| Leer y escribir archivos comprimidos |pi_netrw.txt| Leer y escribir archivos en una red |pi_paren.txt| Resaltar «parens» coincidentes |pi_tar.txt| Explorador de archivos Tar |pi_vimball.txt|Crear un script de Vim autoinstalable |pi_zip.txt| Explorador de archivos Zip

source: LOCAL ADDITIONS: *local-additions*
es: ADICIONES LOCALES: *local-additions*

source: ------------------------------------------------------------------------------ *bars* Bars example
es: ------------------------------------------------------------------------------ *bars* Ejemplo de barras verticales

source: Now that you've jumped here with CTRL-] or a double mouse click, you can use CTRL-T, CTRL-O, g<RightMouse>, or <C-RightMouse> to go back to where you were.
es: Ahora que ha saltado a este punto mediante CTRL-] o una pulsación doble del ratón, puede usar CTRL-T, CTRL-O, g<BotonDerecho>, o <C-BotonDerecho>

source: Note that tags are within | characters, but when highlighting is enabled these are hidden. That makes it easier to read a command.
es: Observe que las etiquetas se encuentran entre caracteres «|», que se ocultarán si activa el resaltado. Ello hace más sencillo leer una orden.

source: Anyway, you can use CTRL-] on any word, also when it is not within |, and Vim will try to find help for it.
es: De todas formas, puede usar CTRL-] sobre cualquier palabra, aunque no se encuentre entre «|», para que Vim intente encontrar ayuda relacionada.
