Repository: vim-doc-es/vimdocs
Catalog: 7.2/traducido/PO/usr_09es.po
Languages: es

source: *usr_09.txt* For Vim version 7.2. Last change: 2006 Apr 24
es: *usr_09.est* Para Vim versión 7.2. Último cambio: 2006 Apr 24

source: VIM USER MANUAL - by Bram Moolenaar
es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: Using the GUI
es: Uso de la GUI

source: Vim works in an ordinary terminal. GVim can do the same things and a few more. The GUI offers menus, a toolbar, scrollbars and other items. This chapter is about these extra things that the GUI offers.
es: Vim funciona en una terminal normal. GVim puede hacer las mismas cosas y algunas más. La interfaz gráfica ofrece menús, una barra de menú, barras de desplazamiento y otros. Este capítulo trata de las funcionalidades adicionales que la interfaz gráfica ofrece.

source: |09.1| Parts of the GUI |09.2| Using the mouse |09.3| The clipboard |09.4| Select mode
es: |09.1| Partes de la GUI |09.2| Uso del ratón |09.3| El portapapeles |09.4| Modo Seleccionar

source: Next chapter: |usr_10.txt| Making big changes Previous chapter: |usr_08.txt| Splitting windows Table of contents: |usr_toc.txt|
es: Capítulo siguiente: |usr_10.txt| Realizar grandes cambios Capítulo anterior: |usr_08.txt| Dividir en ventanas Tabla de contenidos: |usr_toc.txt|

source: ============================================================================== *09.1* Parts of the GUI
es: ============================================================================== *09.1* Partes de la GUI

source: You might have an icon on your desktop that starts gVim. Otherwise, one of these commands should do it: >
es: Puede que tenga un icono en su escritorio que arranca gVim. En caso contrario, una de estas órdenes lo hará: >

source: gvim file.txt vim -g file.txt
es: gvim archivo.txt vim -g archivo.txt

source: If this doesn't work you don't have a version of Vim with GUI support. You will have to install one first. Vim will open a window and display "file.txt" in it. What the window looks like depends on the version of Vim. It should resemble the following picture (for as far as this can be shown in ASCII!).
es: Si esto no funciona es que no tiene la versión de Vim con soporte para GUI. Tendrá que instalar una primero. Vim abrirá una ventana y mostrará «archivo.txt». El aspecto de la ventana dependerá de la versión de Vim. Se debería parecer a la siguiente figura (¡tanto como se pueda parecer con texto ASCII!).

source: +----------------------------------------------------+ | file.txt + (~/dir) - VIM X | <- window title +----------------------------------------------------+ | File Edit Tools Syntax Buffers Window Help | <- menubar +----------------------------------------------------+ | aaa bbb ccc ddd eee fff ggg hhh iii jjj | <- toolbar | aaa bbb ccc ddd eee fff ggg hhh iii jjj | +----------------------------------------------------+ | file text | ^ | | ~ | # | | ~ | # | <- scrollbar | ~ | # | | ~ | # | | ~ | # | | | V | +----------------------------------------------------+
es: +----------------------------------------------------+ | archivo.txt + (~/dir) - VIM X | <- título +----------------------------------------------------+ | File Edit Tools Syntax Buffers Window Help | <- barra de +----------------------------------------------------+ menú | aaa bbb ccc ddd eee fff ggg hhh iii jjj | <- barra de | aaa bbb ccc ddd eee fff ggg hhh iii jjj | herramientas +----------------------------------------------------+ | archivo de texto | ^ | | ~ | # | | ~ | # | <- barra de | ~ | # | desplazam. | ~ | # | | ~ | # | | | V | +----------------------------------------------------+

source: The largest space is occupied by the file text. This shows the file in the same way as in a terminal. With some different colors and another font perhaps.
es: El espacio más grande está ocupado por el archivo de texto. Esto muestra el archivo de una manera similar a una terminal. Con algunas diferencias de tipo de letra y color, quizá.

source: THE WINDOW TITLE
es: EL TÍTULO DE LA VENTANA

source: At the very top is the window title. This is drawn by your window system. Vim will set the title to show the name of the current file. First comes the name of the file. Then some special characters and the directory of the file in parens. These special character can be present:
es: En la parte superior se encuentra el título. Esto se genera por su sistema de ventanas. Vim pondrá en título el nombre del archivo actual. Primero viene el nombre del archivo, luego algunos caracteres especiales y el directorio del archivo entre paréntesis. Los caracteres especiales son:

source: - The file cannot be modified (e.g., a help file) + The file contains changes = The file is read-only =+ The file is read-only, contains changes anyway
es: - El archivo no se puede modificar (por ej. la ayuda) + El archivo contiene cambios = El archivo es de sólo lectura =+ El archivo es de sólo lectura pero contiene cambios

source: If nothing is shown you have an ordinary, unchanged file.
es: Si no hay ningún símbolo se trata de un archivo normal, sin cambios.

source: THE MENUBAR
es: LA BARRA DE MENÚ

source: You know how menus work, right? Vim has the usual items, plus a few more. Browse them to get an idea of what you can use them for. A relevant submenu is Edit/Global Settings. You will find these entries:
es: Ya sabe como funcionan los menús, ¿no? Vim tiene los elementos habituales, además de otros. Explórelos para tener una idea de cómo podría usarlos. Un submenú relevante es «Editar/Opciones globlales». Encontrará los siguientes elementos:

source: Toggle Toolbar make the toolbar appear/disappear Toggle Bottom Scrollbar make a scrollbar appear/disappear at the bottom Toggle Left Scrollbar make a scrollbar appear/disappear at the left Toggle Right Scrollbar make a scrollbar appear/disappear at the right
es: Toggle Toolbar barra de herramientas aparece/desaparece Toggle Bottom Scrollbar barra de despl. aparece/desaparece abajo Toggle Left Scrollbar barra de despl. aparece/desaparece a la izq. Toggle Right Scrollbar barra de despl. aparece/desaparece a la der.

source: On most systems you can tear-off the menus. Select the top item of the menu, the one that looks like a dashed line. You will get a separate window with the items of the menu. It will hang around until you close the window.
es: En la mayoría de los sistemas puede seccionar los menús. Seleccione el elemento superior del menú que parece una línea a rayas. Ahora tendrá una pequeña ventana aparte con el menú.

source: THE TOOLBAR
es: LA BARRA DE HERRAMIENTAS

source: This contains icons for the most often used actions. Hopefully the icons are self-explanatory. There are tooltips to get an extra hint (move the mouse pointer to the icon without clicking and don't move it for a second).
es: Este contiene los iconos para las acciones más empleadas. La intención es que los iconos se expliquen a sí mismos. Hay globos de ayuda que le aconsejan (pon el puntero sobre un botón y no lo muevas durante un segundo).

source: The "Edit/Global Settings/Toggle Toolbar" menu item can be used to make the toolbar disappear. If you never want a toolbar, use this command in your vimrc file: >
es: La opción «Editar/Opciones globales/Ocultar/Mostrar barra de herramientas» se puede emplear para hacer que la barra de herramientas desaparezca. Si no desea tener una barra de herramientas en ningún momento, escriba esto en su «vimrc»: >

source: This removes the 'T' flag from the 'guioptions' option. Other parts of the GUI can also be enabled or disabled with this option. See the help for it.
es: Esto elimina la marca 'T' de la opción 'guioptions'. Otras partes de la interfaz gráfica se pueden también activar o desactivar del mismo modo. Consulte la ayuda.

source: THE SCROLLBARS
es: LAS BARRAS DE DESPLAZAMIENTO

source: By default there is one scrollbar on the right. It does the obvious thing. When you split the window, each window will get its own scrollbar. You can make a horizontal scrollbar appear with the menu item Edit/Global Settings/Toggle Bottom Scrollbar. This is useful in diff mode, or when the 'wrap' option has been reset (more about that later).
es: Por omisión sólo hay una barra de desplazamiento en la derecha. Hace lo que se espera de ella. Cada ventana tendrá su barra de desplazamiento. Puede hacer que una barra horizontal aparezca con la opción «Editar/ Opciones globales/Ocultar/Mostrar barra de desplazamiento inferior». Esto es útil en el modo diff, o cuando la opción 'wrap' está desactivada (eso lo veremos más adelante).

source: When there are vertically split windows, only the windows on the right side will have a scrollbar. However, when you move the cursor to a window on the left, it will be this one the that scrollbar controls. This takes a bit of time to get used to. When you work with vertically split windows, consider adding a scrollbar on the left. This can be done with a menu item, or with the 'guioptions' option: > :set guioptions+=l
es: Cuando hay ventanas divididas verticalmente, sólo las de la derecha tendrán barra de desplazamiento. Sin embargo, si mueve el cursor a una ventana en la izquierda, será esta la que la barra controle. Lleva cierto tiempo acostumbrarse a esto. Cuando trabaje con ventanas divididas verticalmente, considere la posibilidad de añadir barras en la izquierda. Pruebe con esta opción: > :set guioptions+=1

source: This adds the 'l' flag to 'guioptions'.
es: Esto añade la marca 'l' a 'guioptions'.

source: ============================================================================== *09.2* Using the mouse
es: ============================================================================== *09.2* Uso del ratón

source: Standards are wonderful. In Microsoft Windows, you can use the mouse to select text in a standard manner. The X Window system also has a standard system for using the mouse. Unfortunately, these two standards are not the same. Fortunately, you can customize Vim. You can make the behavior of the mouse work like an X Window system mouse or a Microsoft Windows mouse. The following command makes the mouse behave like an X Window mouse: >
es: Los estándares son maravillosos. En Microsoft Windows, puede usar el ratón para seleccionar texto de una forma estándar. El sistema de ventanas X Window System también tiene un estándar para el uso del ratón. Por desgracia, estos dos estándares no son compatibles. Afortunadamente, puede personalizarlo en Vim. Puede hacer que el comportamiento del ratón sea el mismo que bajo X o el de Windows. La siguiente orden hace que el ratón se comporte como bajo X: >

source: The following command makes the mouse work like a Microsoft Windows mouse: >
es: La siguiente orden hace que el ratón se comporte como en Windows: >

source: The default behavior of the mouse on UNIX systems is xterm. The default behavior on a Microsoft Windows system is selected during the installation process. For details about what the two behaviors are, see |:behave|. Here follows a summary.
es: El comportamiento predefinido de un ratón en los sistemas UNIX es xterm. El comportamiento predefinido en un sistema Windows se selecciona durante la instalación. Para más detalles sobre estos comportamientos, véase |:behave|. Esto es un pequeño resumen:

source: XTERM MOUSE BEHAVIOR
es: COMPORTAMIENTO DEL RATÓN XTERM

source: Left mouse click position the cursor Left mouse drag select text in Visual mode Middle mouse click paste text from the clipboard Right mouse click extend the selected text until the mouse pointer
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Visual Click botón central pegar texto desde el portapapeles Click botón derecho extender el texto seleccionado hasta el puntero del ratón

source: MSWIN MOUSE BEHAVIOR
es: COMPORTAMIENTO DEL RATÓN MSWIN

source: Left mouse click position the cursor Left mouse drag select text in Select mode (see |09.4|) Left mouse click, with Shift extend the selected text until the mouse pointer Middle mouse click paste text from the clipboard Right mouse click display a pop-up menu
es: Click botón izquierdo posicionar el cursor Arrastrar botón izquierdo seleccionar texto en modo Seleccionar (|09.4|) Click botón izquierdo, con May. extender el texto seleccionado hasta el puntero del ratón Click botón central pegar texto desde el portapapeles Click botón derecho mostrar un menú pop-up

source: The mouse can be further tuned. Check out these options if you want to change the way how the mouse works:
es: Puede configurar el ratón con más detalle. Léa estas opciones para ver cómo funciona el ratón:

source: 'mouse' in which mode the mouse is used by Vim 'mousemodel' what effect a mouse click has 'mousetime' time between clicks for a double-click 'mousehide' hide the mouse while typing 'selectmode' whether the mouse starts Visual or Select mode
es: 'mouse' en qué modo Vim usa el ratón 'mousemodel' qué efectos tiene pulsar con el ratón 'mousetime' tiempo entre dos pulsacionespara un doble click 'mousehide' esconde el ratón mientras teclea 'selectmode' si el ratón comienza el modo Visual o Seleccionar

source: ============================================================================== *09.3* The clipboard
es: ============================================================================== *09.3* El portapapeles

source: In section |04.7| the basic use of the clipboard was explained. There is one essential thing to explain about X-windows: There are actually two places to exchange text between programs. MS-Windows doesn't have this.
es: En la sección |04.7| se explica el uso básico del portapapeles. Hay algo esencial que debe ser explicado sobre las X-windows: Hay dos lugares para intercambiar texto entre programas. MS-Windows sólo tiene uno.

source: In X-Windows there is the "current selection". This is the text that is currently highlighted. In Vim this is the Visual area (this assumes you are using the default option settings). You can paste this selection in another application without any further action. For example, in this text select a few words with the mouse. Vim will switch to Visual mode and highlight the text. Now start another gVim, without a file name argument, so that it displays an empty window. Click the middle mouse button. The selected text will be inserted.
es: En X-Windows hay una «selección actual». Esto es el texto que está actualmente marcado. En Vim esto es el área Visual (suponiendo que usa las opciones predefinidas). Puede pegar esta selección en otra aplicación sin ninguna acción ulterior. Por ejemplo, en este texto seleccione unas cuantas palabras con el ratón. Vim pasará al modo Visual y resaltará el texto. Ahora inicie otro gVim, sin un nombre de archivo, de forma que muestre una ventana vacía. Pulse el botón central del ratón. El texto seleccionado se insertará.

source: The "current selection" will only remain valid until some other text is selected. After doing the paste in the other gVim, now select some characters in that window. You will notice that the words that were previously selected in the other gVim window are displayed differently. This means that it no longer is the current selection.
es: La «selección actual» sólo será válida hasta que seleccione otro texto. Tras pegar el texto en otro gVim, seleccione ahora algunos caracteres en esa ventana. Se dará cuenta de que las palabras que estaban previamente seleccionadas en otra ventana gVim se muestran de otro modo. Esto significa que ya no están en la «selección actual».

source: You don't need to select text with the mouse, using the keyboard commands for Visual mode works just as well.
es: No necesitas seleccionar texto con el ratón, el uso de comandos del teclado para el modo Visual funciona igual.

source: THE REAL CLIPBOARD
es: EL VERDADERO PORTAPAPELES

source: Now for the other place with which text can be exchanged. We call this the "real clipboard", to avoid confusion. Often both the "current selection" and the "real clipboard" are called clipboard, you'll have to get used to that. To put text on the real clipboard, select a few different words in one of the gVims you have running. Then use the Edit/Copy menu entry. Now the text has been copied to the real clipboard. You can't see this, unless you have some application that shows the clipboard contents (e.g., KDE's klipper). Now select the other gVim, position the cursor somewhere and use the Edit/Paste menu. You will see the text from the real clipboard is inserted.
es: Tratemos ahora el otro lugar en el que puede intercambiar texto. Llamamos al otro portapapeles el «verdadero portapapeles», para evitar la confusión. A menudo la «selección actual» y el «verdadero portapapeles» son denominados indistintamente «portapapeles». Tendrá que acostumbrarse a esto. Para poner el texto en el verdadero portapapeles, seleccione unas palabras en uno de los gVims que tenga en ejecución. Use la entrada de menú Editar/Copiar. El texto será copiado al verdadero portapapeles. No podrá comprobar esto a menos que tenga alguna aplicación que muestre el contenido del portapapeles. Ahora seleccione otro gVim, coloque el cursor en algún lugar y use el menú Editar/Pegar. Verá que se inserta el texto del verdadero portapapeles.

source: USING BOTH
es: USAR AMBOS

source: This use of both the "current selection" and the "real clipboard" might sound a bit confusing. But it is very useful. Let's show this with an example. Use one gVim with a text file and perform these actions:
es: Esto de usar simultáneamente la «selección actual» y el «verdadero portapapeles» puede sonar un poco confuso. Pero es muy útil. Veámoslo con un ejemplo. Abra un gVim con un archivo de texto y haga lo siguiente:

source: - Select two words in Visual mode. - Use the Edit/Copy menu to get these words onto the clipboard. - Select one other word in Visual mode. - Use the Edit/Paste menu item. What will happen is that the single selected word is replaced with the two words from the clipboard. - Move the mouse pointer somewhere else and click the middle button. You will see that the word you just overwrote with the clipboard is inserted here.
es: - Seleccione dos palabras en modo Visual. - Ponga esas palabras en el portapapeles con Editar/Copiar. - Selecciona otra palabra en modo Visual. - Accede al elemento del menú Editar/Pegar. Lo que ocurrirá es que la palabra seleccionada se sustituirá con las palabras del portapapeles. - Ponga el puntero del ratón en algún lugar y pulse el botón central. Verá que la palabra que sobreescribió con el portapapeles se insertará en ese lugar.

source: If you use the "current selection" and the "real clipboard" with care, you can do a lot of useful editing with them.
es: Si usa la «selección actual» y el «verdadero portapapeles» con cuidado, puede llevar a cabo una gran variedad de trucos de edición.

source: USING THE KEYBOARD
es: USO DEL TECLADO

source: If you don't like using the mouse, you can access the current selection and the real clipboard with two registers. The "* register is for the current selection. To make text become the current selection, use Visual mode. For example, to select a whole line just press "V". To insert the current selection before the cursor: >
es: Si no le gusta usar el ratón, puede acceder a la selección actual y al verdadero portapapeles con dos registros. El registro "* es para la selección actual. Para hacer que el texto se convierta en selección actual, use el modo Visual. Por ejemplo, para seleccionar una línea completa use «V». Para insertar la selección actual antes del cursor: >

source: Notice the uppercase "P". The lowercase "p" puts the text after the cursor.
es: Observe que es una «P» mayúscula. La «p» minúscula la pone tras el cursor.

source: The "+ register is used for the real clipboard. For example, to copy the text from the cursor position until the end of the line to the clipboard: >
es: El registro "+ se usa para el verdadero portapapeles. Por ejemplo, para copiar el texto desde la posición del cursor hasta el final de línea: >

source: Remember, "y" is yank, which is Vim's copy command. To insert the contents of the real clipboard before the cursor: >
es: Recuerde, «y» es copiar («yank»). Para insertar los contenidos del verdadero portapapeles antes del cursor: >

source: It's the same as for the current selection, but uses the plus (+) register instead of the star (*) register.
es: Es lo mismo que para la selección actual, pero usa el registro (+) en lugar del registro estrella (*).

source: ============================================================================== *09.4* Select mode
es: ============================================================================== *09.4* Modo Seleccionar

source: And now something that is used more often on MS-Windows than on X-Windows. But both can do it. You already know about Visual mode. Select mode is like Visual mode, because it is also used to select text. But there is an obvious difference: When typing text, the selected text is deleted and the typed text replaces it.
es: Ahora algo que se emplea más habitualmente en MS-Windows que en X-Windows. Aún así, ambos pueden hacerlo. Ya conoce el modo Visual. El modo Seleccionar es como el modo Visual, también empleado para la selección. Pero hay una diferencia básica: Cuando escriba texto, el texto seleccionado se elimina y el texto introducido lo sustituye.

source: To start working with Select mode, you must first enable it (for MS-Windows it is probably already enabled, but you can do this anyway): >
es: Para iniciar el modo Seleccionar, debe activarlo primero (para MS-Windows está probablemente activado, pero puedes hacer esto igualmente): >

source: Now use the mouse to select some text. It is highlighted like in Visual mode. Now press a letter. The selected text is deleted, and the single letter replaces it. You are in Insert mode now, thus you can continue typing.
es: A continuación, use el ratón para seleccionar algún texto. Se resaltará como con el modo Visual. Pulse ahora un carácter. El texto seleccionado se eliminará, y ese carácter lo reemplazará. Entrará en modo Insertar.

source: Since typing normal text causes the selected text to be deleted, you can not use the normal movement commands "hjkl", "w", etc. Instead, use the shifted function keys. <S-Left> (shifted cursor left key) moves the cursor left. The selected text is changed like in Visual mode. The other shifted cursor keys do what you expect. <S-End> and <S-Home> also work.
es: Ya que escribir texto normal hace que el texto seleccionado se elimine, no podrá usar las órdenes de movimiento «hjkl», «w», etc. En su lugar, use las teclas de las flechas con mayúsculas. <S-izquierda> mueve el cursor a la izquierda. El texto seleccionado cambiará como en el modo Visual. <S-Fin> y <S-Inicio> también funcionan.

source: You can tune the way Select mode works with the 'selectmode' option.
es: Puedes ajustar el funcionamiento del modo Seleccionar mediante la opción 'selectmode'.

source: Next chapter: |usr_10.txt| Making big changes
es: Capítulo siguiente: |usr_10.txt| Hacer cambios grandes

source: Copyright: see |manual-copyright| vim:tw=78:ts=8:ft=help:norl:
es: Copyright: véase |manual-copyright| vim:tw=78:ts=8:ft=help:norl:
